{
  "source": "https://feeds.feedburner.com/threatintelligence/pvexyqv7v0v",
  "fetched_at": "2025-09-25T22:18:37.765468Z",
  "count": 20,
  "items": [
    {
      "title": "Another BRICKSTORM: Stealthy Backdoor Enabling Espionage into Tech and Legal Sectors",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/brickstorm-espionage-campaign/",
      "pubDate": "Wed, 24 Sep 2025 14:00:00 +0000",
      "description": "Written by: Sarah Yoder, John Wolfram, Ashley Pearson, Doug Bienstock, Josh Madeley, Josh Murchie, Brad Slaybaugh, Matt Lin, Geoff Carstairs, Austin Larsen\n\nIntroduction\nGoogle Threat Intelligence Group (GTIG) is tracking BRICKSTORM malware activity, which is being used to maintain persistent access to victim organizations in the United States. Since March 2025, Mandiant Consulting has responded to intrusions across a range of industry verticals, most notably legal services, Software as a Service (SaaS) providers, Business Process Outsourcers (BPOs), and Technology. The value of these targets extends beyond typical espionage missions, potentially providing data to feed development of zero-days and establishing pivot points for broader access to downstream victims.\n\n    aside_block\n    &lt;ListValue: [StructValue([(&#x27;title&#x27;, &#x27;BRICKSTORM Scanner&#x27;), (&#x27;body&#x27;, &lt;wagtail.rich_text.RichText object at 0x7f5ba45e6e80&gt;), (&#x27;btn_text&#x27;, &#x27;Get the tool"
    },
    {
      "title": "ViewState Deserialization Zero-Day Vulnerability in Sitecore Products (CVE-2025-53690)",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/viewstate-deserialization-zero-day-vulnerability/",
      "pubDate": "Wed, 03 Sep 2025 14:00:00 +0000",
      "description": "Written by: Rommel Joven, Josh Fleischer, Joseph Sciuto, Andi Slok, Choon Kiat Ng\n\nUpdate (September 3): This post was updated to include information about GoTokenTheft usage.\nIn a recent investigation, Mandiant Threat Defense discovered an active ViewState deserialization attack affecting Sitecore deployments leveraging a sample machine key that had been exposed in Sitecore deployment guides from 2017 and earlier. An attacker leveraged the exposed ASP.NET machine key to perform remote code execution.\nMandiant worked directly with Sitecore to address this issue. Sitecore tracks this vulnerable configuration as CVE-2025-53690, which affects customers who deployed any version of multiple Sitecore products using the sample key exposed in publicly available deployment guides (specifically Sitecore XP 9.0 and Active Directory 1.4 and earlier versions). Sitecore has confirmed that its updated deployments automatically generate a unique machine key and that affected customers have been notifi"
    },
    {
      "title": "Widespread Data Theft Targets Salesforce Instances via Salesloft Drift",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/data-theft-salesforce-instances-via-salesloft-drift/",
      "pubDate": "Tue, 26 Aug 2025 14:00:00 +0000",
      "description": "Written by: Austin Larsen, Matt Lin, Tyler McLellan, Omar ElAhdan\n\nUpdate (August 28)\nBased on new information identified by GTIG, the scope of this compromise is not exclusive to the Salesforce integration with Salesloft Drift and impacts other integrations. We now advise all Salesloft Drift customers to treat any and all authentication tokens stored in or connected to the Drift platform as potentially compromised.\nOn August 28, 2025, our investigation confirmed that the actor also compromised OAuth tokens for the \"Drift Email\" integration. On August 9, 2025, a threat actor used these tokens to access email from a very small number of Google Workspace accounts. The only accounts that were potentially accessed were those that had been specifically configured to integrate with Salesloft Drift; the actor would not have been able to access any other accounts on a customer's Workspace domain.\nIn response to these findings and to protect our customers, Google identified the impacted users, "
    },
    {
      "title": "Deception in Depth: PRC-Nexus Espionage Campaign Hijacks Web Traffic to Target Diplomats",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/prc-nexus-espionage-targets-diplomats/",
      "pubDate": "Mon, 25 Aug 2025 14:00:00 +0000",
      "description": "Written by: Patrick Whitsell\n\nIn March 2025, Google Threat Intelligence Group (GTIG) identified a complex, multifaceted campaign attributed to the PRC-nexus threat actor UNC6384. The campaign targeted diplomats in Southeast Asia and other entities globally. GTIG assesses this was likely in support of cyber espionage operations aligned with the strategic interests of the People's Republic of China (PRC). \nThe campaign hijacks target web traffic, using a captive portal redirect, to deliver a digitally signed downloader that GTIG tracks as STATICPLUGIN. This ultimately led to the in-memory deployment of the backdoor SOGU.SEC (also known as PlugX). This multi-stage attack chain leverages advanced social engineering including valid code signing certificates, an adversary-in-the-middle (AitM) attack, and indirect execution techniques to evade detection.\nGoogle is actively protecting our users and customers from this threat. We sent government-backed attacker alerts to all Gmail and Workspace"
    },
    {
      "title": "A Cereal Offender: Analyzing the CORNFLAKE.V3 Backdoor",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/analyzing-cornflake-v3-backdoor/",
      "pubDate": "Wed, 20 Aug 2025 14:00:00 +0000",
      "description": "Written by: Marco Galli\n\nWelcome to the Frontline Bulletin Series\nStraight from Mandiant Threat Defense, the \"Frontline Bulletin\" series brings you the latest on the most intriguing compromises we are seeing in the wild right now, equipping our community to understand and respond to the most compelling threats we observe. This edition dissects an infection involving two threat groups, UNC5518 and UNC5774, leading to the deployment of CORNFLAKE.V3.\nIntroduction\nSince June 2024, Mandiant Threat Defense has been tracking UNC5518, a financially motivated threat cluster compromising legitimate websites to serve fake CAPTCHA verification pages. This deceptive technique, known as ClickFix, lures website visitors into executing a downloader script which initiates a malware infection chain. UNC5518 appears to partner with clients or affiliates who use access obtained by the group to deploy additional malware.\nWhile the initial compromise and fake CAPTCHA deployment are orchestrated by UNC5518, "
    },
    {
      "title": "Beyond Convenience: Exposing the Risks of VMware vSphere Active Directory Integration",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/vsphere-active-directory-integration-risks/",
      "pubDate": "Wed, 23 Jul 2025 14:00:00 +0000",
      "description": "Written by: Stuart Carrera, Brian Meyer\n\nExecutive Summary\nBroadcom's VMware vSphere product continues to be a top choice for private cloud virtualization, underpinning important systems and critical infrastructure. Far from losing its appeal, organizations still rely heavily on vSphere for its stability and control. Mandiant is also observing a clear trend where critical workloads are moving back from public cloud services to these on-premises vSphere environments, often driven by strategies that balance innovation with stability and the desire for more direct operational oversight.\nThe common practice of directly integrating vSphere with Microsoft Active Directory (AD), while simplifying administration tasks, creates an attack path frequently underestimated due to a misunderstanding of the inherent risks presented today. This configuration extends the AD attack surface directly to the hypervisor. From a threat actor's perspective, this integration constitutes a high-value opportunity"
    },
    {
      "title": "From Help Desk to Hypervisor: Defending Your VMware vSphere Estate from UNC3944",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/defending-vsphere-from-unc3944/",
      "pubDate": "Wed, 23 Jul 2025 14:00:00 +0000",
      "description": "Introduction\nIn mid 2025, Google Threat Intelligence Group (GTIG) identified a sophisticated and aggressive cyber campaign targeting multiple industries, including retail, airline, and insurance. This was the work of UNC3944, a financially motivated threat group that has exhibited overlaps with public reporting of \"0ktapus,\" \"Octo Tempest,\" and \"Scattered Spider.\" Following public alerts from the Federal Bureau of Investigation (FBI), the group's targeting became clear. GTIG observed that the group was suspected of turning its ransomware and extortion operations to the U.S. retail sector. The campaign soon broadened further, with airline and transportation organizations in North America having also become targets.\nThe group's core tactics have remained consistent and do not rely on software exploits. Instead, they use a proven playbook centered on phone calls to an IT help desk. The actors are aggressive, creative, and particularly skilled at using social engineering to bypass even mat"
    },
    {
      "title": "Ongoing SonicWall Secure Mobile Access (SMA) Exploitation Campaign using the OVERSTEP Backdoor",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/sonicwall-secure-mobile-access-exploitation-overstep-backdoor/",
      "pubDate": "Wed, 16 Jul 2025 14:00:00 +0000",
      "description": "Written by: Josh Goddard, Zander Work, Dimiter Andonov\n\nUPDATE (Sep 16): Clarified hunting guidance specifics surrounding ld.so.preload files.\nUPDATE (July 30): Added additional network IOC identified by Sonicwall as being associated with OVERSTEP. \n \nIntroduction\nGoogle Threat Intelligence Group (GTIG) has identified an ongoing campaign by a suspected financially-motivated threat actor we track as UNC6148, targeting fully patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances. GTIG assesses with high confidence that UNC6148 is leveraging credentials and one-time password (OTP) seeds stolen during previous intrusions, allowing them to regain access even after organizations have applied security updates. Evidence for the initial infection vector was limited, as the actor's malware is designed to selectively remove log entries, hindering forensic investigation; however, it is likely this was through the exploitation of known vulnerabilities.\nIn this new wave of ac"
    },
    {
      "title": "Isolated Recovery Environments: A Critical Layer in Modern Cyber Resilience",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/isolated-recovery-environments-modern-cyber-resilience/",
      "pubDate": "Mon, 07 Jul 2025 14:00:00 +0000",
      "description": "Written by: Jaysn Rye\n\nExecutive Summary\nAs adversaries grow faster, stealthier, and more destructive, traditional recovery strategies are increasingly insufficient. Mandiant's M-Trends 2025 report reinforces this shift, highlighting that ransomware operators now routinely target not just production systems but also backups. This evolution demands that organizations re-evaluate their resilience posture. One approach gaining traction is the implementation of an isolated recovery environment (IRE)—a secure, logically separated environment built to enable reliable recovery even when an organization's primary network has been compromised.\nThis blog post outlines why IREs matter, how they differ from conventional disaster recovery strategies, and what practical steps enterprises can take to implement them effectively.\nThe Backup Blind Spot\nMost organizations assume that regular backups equal resilience; however, that assumption doesn't hold up against today's threat landscape. Ransomware ac"
    },
    {
      "title": "Protecting the Core: Securing Protection Relays in Modern Substations",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/securing-protection-relays-modern-substations/",
      "pubDate": "Mon, 30 Jun 2025 14:00:00 +0000",
      "description": "Written by: Seemant Bisht, Chris Sistrunk, Shishir Gupta, Anthony Candarini, Glen Chason, Camille Felx Leduc\n\nIntroduction — Why Securing Protection Relays Matters More Than Ever\nSubstations are critical nexus points in the power grid, transforming high-voltage electricity to ensure its safe and efficient delivery from power plants to millions of end-users. At the core of a modern substation lies the protection relay: an intelligent electronic device (IED) that plays a critical role in maintaining the stability of the power grid by continuously monitoring voltage, current, frequency, and phase angle. Upon detecting a fault, it instantly isolates the affected zone by tripping circuit breakers, thus preventing equipment damage, fire hazards, and cascading power outages.\nAs substations become more digitized, incorporating IEC 61850, Ethernet, USB, and remote interfaces, relays are no longer isolated devices, but networked elements in a broader SCADA network. While this enhances visibility"
    },
    {
      "title": "Trix Shots: Remote Code Execution on Aviatrix Controller",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/remote-code-execution-aviatrix-controller/",
      "pubDate": "Mon, 23 Jun 2025 14:00:00 +0000",
      "description": "Written by: Louis Dion-Marcil\n\nThis blog post highlights a Mandiant Red Team case study simulating an “Initial Access Brokerage” approach that discovered two vulnerabilities on Aviatrix Controller, a Software-Defined Networking (SDN) utility that allows for the creation of links between different cloud vendors and regions:\n\n\nCVE-2025-2171: an administrator authentication bypass\n\n\nCVE-2025-2172: an authenticated command injection \n\n\nThe vulnerabilities affected Aviatrix Controller 7.2.5012 and prior versions and were patched in versions 8.0.0, 7.2.5090, and 7.1.4208. Thank you to the team at Aviatrix who took the reported security issues seriously and remediated them in a timely manner.\nThe Red Team successfully exploited a fully patched Aviatrix Controller via authentication bypass, unsafe file upload, and argument injection. The detailed attack chain is shown in Figure 1.\n\n\n\n\n\n\n\n  \n    \n      \n  \n\n    \n\n      \n      \n        \n        \n        \n        \n      \n        Figure 1: Exploit"
    },
    {
      "title": "What’s in an ASP? Creative Phishing Attack on Prominent Academics and Critics of Russia",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/creative-phishing-academics-critics-of-russia/",
      "pubDate": "Wed, 18 Jun 2025 14:00:00 +0000",
      "description": "Written by: Gabby Roncone, Wesley Shields\n\nUPDATE (July 10)\nIn late June 2025, Google Threat Intelligence Group (GTIG) discovered continued UNC6293 operations that demonstrate an evolution in the group’s tradecraft. Using similar lure themes as previously observed activity, UNC6293 continued the ASP phishing campaign against prominent academics, critics of Russia, and journalists using different ASP names, potentially as a response to our publication of their tradecraft. In a different campaign, UNC6293 sought to convince targets to link an attacker-controlled device to their Microsoft 365 account through Microsoft’s device code authentication flow.\nIn an attempt to continue the ASP campaign, UNC6293 attempted to re-establish contact with specific individuals that had previously engaged with the initial phishing attempts. GTIG observed UNC6293 creating multiple new accounts with similar usernames to ones used previously and already disabled. UNC6293 also used different ASP names in thi"
    },
    {
      "title": "Hello, Operator? A Technical Analysis of Vishing Threats",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/technical-analysis-vishing-threats/",
      "pubDate": "Wed, 04 Jun 2025 15:00:00 +0000",
      "description": "Written by: Nick Guttilla\n\nIntroduction\nOrganizations are increasingly relying on diverse digital communication channels for essential business operations. The way employees interact with colleagues, access corporate resources, and especially, receive information technology (IT) support is often conducted through calls, chat platforms, and other remote technologies. While these various available methods enhance both efficiency and global accessibility, they also introduce an expanded attack surface that can pose a significant risk if overlooked. Prevalence of in-person social interactions has diminished and remote IT structures, such as an outsourced service desk, has normalized employees' engagement with external or less familiar personnel. As a result, threat actors continue to use social engineering tactics.\nVishing in the Wild: A Tale of Two Actors\nSocial engineering is the psychological manipulation of people into performing unsolicited actions or divulging confidential informatio"
    },
    {
      "title": "The Cost of a Call: From Voice Phishing to Data Extortion",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/voice-phishing-data-extortion/",
      "pubDate": "Wed, 04 Jun 2025 14:00:00 +0000",
      "description": "Update (August 8): Google has completed its email notifications to those affected by this incident.\nUpdate (August 8): Emails are actively being sent to those affected by this incident. Another update will be posted here once these alerts have been issued.\nUpdate (August 5)\nIn June, one of Google’s corporate Salesforce instances was impacted by similar UNC6040 activity described in this post. Google responded to the activity, performed an impact analysis and began mitigations. The instance was used to store contact information and related notes for small and medium businesses. Analysis revealed that data was retrieved by the threat actor during a small window of time before the access was cut off. The data retrieved by the threat actor was confined to basic and largely publicly available business information, such as business names and contact details.\nUNC6240\nGoogle Threat Intelligence Group (GTIG) tracks the extortion activities following UNC6040 intrusions, sometimes several months "
    },
    {
      "title": "Mark Your Calendar: APT41 Innovative Tactics",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/apt41-innovative-tactics/",
      "pubDate": "Wed, 28 May 2025 14:00:00 +0000",
      "description": "Written by: Patrick Whitsell\n\nGoogle Threat Intelligence Group’s (GTIG) mission is to protect Google’s billions of users and Google’s multitude of products and services. In late October 2024, GTIG discovered an exploited government website hosting malware being used to target multiple other government entities. The exploited site delivered a malware payload, which we have dubbed “TOUGHPROGRESS”, that took advantage of Google Calendar for command and control (C2). Misuse of cloud services for C2 is a technique that many threat actors leverage in order to blend in with legitimate activity. \nWe assess with high confidence that this malware is being used by the PRC based actor APT41 (also tracked as HOODOO). APT41’s targets span the globe, including governments and organizations within the global shipping and logistics, media and entertainment, technology, and automotive sectors. \nOverview\nIn this blog post we analyze the malware delivery methods, technical details of the malware attack ch"
    },
    {
      "title": "Text-to-Malware: How Cybercriminals Weaponize Fake AI-Themed Websites",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/cybercriminals-weaponize-fake-ai-websites/",
      "pubDate": "Tue, 27 May 2025 05:00:00 +0000",
      "description": "Written by: Diana Ion, Rommel Joven, Yash Gupta\n\nSince November 2024, Mandiant Threat Defense has been investigating an UNC6032 campaign that weaponizes the interest around AI tools, in particular those tools which can be used to generate videos based on user prompts. UNC6032 utilizes fake “AI video generator” websites to distribute malware leading to the deployment of payloads such as Python-based infostealers and several backdoors. Victims are typically directed to these fake websites via malicious social media ads that masquerade as legitimate AI video generator tools like Luma AI, Canva Dream Lab, and Kling AI, among others. Mandiant Threat Defense has identified thousands of UNC6032-linked ads that have collectively reached millions of users across various social media platforms like Facebook and LinkedIn. We suspect similar campaigns are active on other platforms as well, as cybercriminals consistently evolve tactics to evade detection and target multiple platforms to increase th"
    },
    {
      "title": "COLDRIVER Using New Malware To Steal Documents From Western Targets and NGOs",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/coldriver-steal-documents-western-targets-ngos/",
      "pubDate": "Wed, 07 May 2025 14:00:00 +0000",
      "description": "Written by: Wesley Shields\n\nGoogle Threat Intelligence Group (GTIG) has identified a new piece of malware called LOSTKEYS, attributed to the Russian government-backed threat group COLDRIVER (also known as UNC4057, Star Blizzard, and Callisto). LOSTKEYS is capable of stealing files from a hard-coded list of extensions and directories, along with sending system information and running processes to the attacker. Observed in January, March, and April 2025, LOSTKEYS marks a new development in the toolset of COLDRIVER, a group primarily known for credential phishing against high-profile targets like NATO governments, non-governmental organizations (NGOs), and former intelligence and diplomatic officers. GTIG has been tracking COLDRIVER for many years, including their SPICA malware in 2024.\nCOLDRIVER typically targets high-profile individuals at their personal email addresses or at NGO addresses. They are known for stealing credentials and after gaining access to a target’s account they exfil"
    },
    {
      "title": "Defending Against UNC3944: Cybercrime Hardening Guidance from the Frontlines",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/unc3944-proactive-hardening-recommendations/",
      "pubDate": "Tue, 06 May 2025 14:00:00 +0000",
      "description": "Background\nUNC3944, which overlaps with public reporting on Scattered Spider, is a financially-motivated threat actor characterized by its persistent use of social engineering and brazen communications with victims. In early operations, UNC3944 largely targeted telecommunications-related organizations to support SIM swap operations. However, after shifting to ransomware and data theft extortion in early 2023, they impacted organizations in a broader range of industries. Since then, we have regularly observed UNC3944 conduct waves of targeting against a specific sector, such as financial services organizations in late 2023 and food services in May 2024. Notably, UNC3944 has also previously targeted prominent brands, possibly in an attempt to gain prestige and increased attention by news media.\nGoogle Threat Intelligence Group (GTIG) observed a decline in UNC3944 activity after 2024 law enforcement actions against individuals allegedly associated with the group. Threat actors will often "
    },
    {
      "title": "Hello 0-Days, My Old Friend: A 2024 Zero-Day Exploitation Analysis",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/2024-zero-day-trends/",
      "pubDate": "Tue, 29 Apr 2025 05:00:00 +0000",
      "description": "Written by: Casey Charrier, James Sadowski, Clement Lecigne, Vlad Stolyarov\n\nExecutive Summary\nGoogle Threat Intelligence Group (GTIG) tracked 75 zero-day vulnerabilities exploited in the wild in 2024, a decrease from the number we identified in 2023 (98 vulnerabilities), but still an increase from 2022 (63 vulnerabilities). We divided the reviewed vulnerabilities into two main categories: end-user platforms and products (e.g., mobile devices, operating systems, and browsers) and enterprise-focused technologies, such as security software and appliances. \nVendors continue to drive improvements that make some zero-day exploitation harder, demonstrated by both dwindling numbers across multiple categories and reduced observed attacks against previously popular targets. At the same time, commercial surveillance vendors (CSVs) appear to be increasing their operational security practices, potentially leading to decreased attribution and detection.\nWe see zero-day exploitation targeting a grea"
    },
    {
      "title": "M-Trends 2025: Data, Insights, and Recommendations From the Frontlines",
      "link": "https://cloud.google.com/blog/topics/threat-intelligence/m-trends-2025/",
      "pubDate": "Wed, 23 Apr 2025 14:00:00 +0000",
      "description": "One of the ways threat actors keep up with the constantly evolving cyber defense landscape is by raising the level of sophistication of their attacks. This trend can be seen across many of our engagements, particularly when responding to China-nexus groups. These actors have demonstrated the ability to create custom malware ecosystems, identify and use zero-day vulnerabilities in security and other appliances, leverage proxy networks akin to botnets, target edge devices and platforms that traditionally lack endpoint detection and response, and employ custom obfuscators in their malware. They take these extra steps to evade detection, stifle analysis, and ultimately stay on systems for longer periods of time. \nHowever, not all successful attacks are highly complex and technical. Many times attackers will take advantage of the opportunities that are made available to them. This includes using credentials stolen in infostealer operations to gain initial access. Mandiant has seen such a ri"
    }
  ]
}