{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-08-31T21:15:00.160743Z",
  "items": [
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/29/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Fri, 29 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Mitsubishi Electric MELSEC iQ-F Series CPU Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-01",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AMitsubishi Electric reports the following versions of MELSEC iQ-F Series are affected: MELSEC iQ-F Series FX5U-32MT/ES: 1.060 and later MELSEC iQ-F Series FX5U-32MT/DS: 1.060 and later MELSEC iQ-F Series FX5U-32MT/ESS: 1.060 and later MELSEC iQ-F Series FX5U-32MT/DSS: 1.060 and later MELSEC iQ-F Series FX5U-64MT/ES: 1.060 and later MELSEC iQ-F Series FX5U-64MT/DS: 1.060 and later MELSEC iQ-F Series FX5U-64MT/ESS: 1.060 and later MELSEC iQ-F Series FX5U-64MT/DSS: 1.060 and later MELSEC iQ-F Series FX5U-80MT/ES: 1.060 and later MELSEC iQ-F Series FX5U-80MT/DS: 1.060 and later MELSEC iQ-F Series FX5U-80MT/ESS: 1.060 and later MELSEC iQ-F Series FX5U-80MT/DSS: 1.060 and later MELSEC iQ-F Series FX5U-32MR/ES: 1.060 and later MELSEC iQ-F Series FX5U-32MR/DS: 1.060 and later MELSEC iQ-F Series FX5U-64MR/ES: 1.060 and later MELSEC iQ-F Series FX5U-64MR/DS: 1.060 and later MELSEC iQ-F Series FX5U-80MR/ES: 1.060 and later MELSEC iQ-F Series FX5U-80MR/DS: 1.060 and later MELSEC iQ-F Series FX5UC-32MT/D: 1.060 and later MELSEC iQ-F Series FX5UC-32MT/DSS: 1.060 and later MELSEC iQ-F Series FX5UC-64MT/D: 1.060 and later MELSEC iQ-F Series FX5UC-64MT/DSS: 1.060 and later MELSEC iQ-F Series FX5UC-96MT/D: 1.060 and later MELSEC iQ-F Series FX5UC-96MT/DSS: 1.060 and later MELSEC iQ-F Series FX5UC-32MT/DS-TS: 1.060 and later MELSEC iQ-F Series FX5UC-32MT/DSS-TS: 1.060 and later MELSEC iQ-F Series FX5UC-32MR/DS-TS: 1.060 and later MELSEC iQ-F Series FX5UJ-24MT/ES: All versions MELSEC iQ-F Series FX5UJ-24MT/DS: All versions MELSEC iQ-F Series FX5UJ-24MT/ESS: All versions MELSEC iQ-F Series FX5UJ-24MT/DSS: All versions MELSEC iQ-F Series FX5UJ-40MT/ES: All versions MELSEC iQ-F Series FX5UJ-40MT/DS: All versions MELSEC iQ-F Series FX5UJ-40MT/ESS: All versions MELSEC iQ-F Series FX5UJ-40MT/DSS: All versions MELSEC iQ-F Series FX5UJ-60MT/ES: All versions MELSEC iQ-F Series FX5UJ-60MT/DS: All versions MELSEC iQ-F Series FX5UJ-60MT/ESS: All versions MELSEC iQ-F Series FX5UJ-60MT/DSS: All versions MELSEC iQ-F Series FX5UJ-24MR/ES: All versions MELSEC iQ-F Series FX5UJ-24MR/DS: All versions MELSEC iQ-F Series FX5UJ-40MR/ES: All versions MELSEC iQ-F Series 'FX5UJ-40MR/DS: All versions MELSEC iQ-F Series FX5UJ-60MR/ES: All versions MELSEC iQ-F Series FX5UJ-60MR/DS: All versions MELSEC iQ-F Series FX5UJ-24MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-24MR/ES-A: All versions MELSEC iQ-F Series FX5UJ-40MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-40MR/ES-A: All versions MELSEC iQ-F Series FX5UJ-60MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-60MR/ES-A: All versions MELSEC iQ-F Series FX5S-30MT/ES: All versions MELSEC iQ-F Series FX5S-30MT/DS: All versions MELSEC iQ-F Series FX5S-30MT/ESS: All versions MELSEC iQ-F Series FX5S-30MT/DSS: All versions MELSEC iQ-F Series FX5S-40MT/ES: All versions MELSEC iQ-F Series FX5S-40MT/DS: All versions MELSEC iQ-F Series FX5S-40MT/ESS: All versions MELSEC iQ-F Series FX5S-40MT/DSS: All versions MELSEC iQ-F Series FX5S-60MT/ES: All versions MELSEC iQ-F Series FX5S-60MT/DS: All versions MELSEC iQ-F Series FX5S-60MT/ESS: All versions MELSEC iQ-F Series FX5S-60MT/DSS: All versions MELSEC iQ-F Series FX5S-80MT/ES: All versions MELSEC iQ-F Series FX5S-80MT/DS: All versions MELSEC iQ-F Series FX5S-80MT/ESS: All versions MELSEC iQ-F Series FX5S-80MT/DSS: All versions MELSEC iQ-F Series FX5S-30MR/ES: All versions MELSEC iQ-F Series FX5S-30MR/DS: All versions MELSEC iQ-F Series FX5S-40MR/ES: All versions MELSEC iQ-F Series FX5S-40MR/DS: All versions MELSEC iQ-F Series FX5S-60MR/ES: All versions MELSEC iQ-F Series FX5S-60MR/DS: All versions MELSEC iQ-F Series FX5S-80MR/ES: All versions MELSEC iQ-F Series FX5S-80MR/DS: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.9 ATTENTION: Exploitable remotely/low attack complexity Vendor: Mitsubishi Electric Equipment: MELSEC iQ-F Series CPU module Vulnerability: Missing Authentication for Critical Function",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to read or write the device values of the product. In addition, the attacker may be able to stop the operation of the programs.",
      "vulnerability_overview": "N/AAn information disclosure, information tampering, and denial-of-service vulnerability exists in MELSEC iQ-F series CPU module due to missing authentication for critical function. Since MODBUS/TCP in the products does not have authentication features, an attacker may be able to read or write the device values of the product. In addition, the attacker may be able to stop the operation of the programs. CVE-2025-7405has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-7405. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/AMitsubishi Electric Corporation advises that there are no plans to release a fixed version. Mitsubishi Electric recommends users take the following mitigation measures to minimize the risk of vulnerability exploit: Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when internet access is required. Use within a LAN and block access from untrusted networks and hosts through firewalls. Use IP filter function to block access from untrusted hosts. For details on the IP filter function, please refer to the following manual for each product.\"13.1 IP Filter Function\" in the MELSEC iQ-F FX5 User's Manual (Communication) Please download the manual from the following URL.https://www.mitsubishielectric.com/fa/download/index.html Restrict physical access to the affected products and the LAN that is connected by them. Mitsubishi Electric Corporation recommends userscontact their local Mitsubishi Electric representativewith questions. For more information, seeMitsubishi Electric's security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Schneider Electric Saitel DR & Saitel DP Remote Terminal Unit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-03",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Schneider Electric Saitel DR RTU: versions 11.06.29 and prior Schneider Electric Saitel DP RTU: versions 11.06.34 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 6.7 ATTENTION: Low Attack Complexity Vendor: Schneider Electric Equipment: Saitel DR RTU, Saitel DP RTU Vulnerability: Improper Privilege Management",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an authenticated attacker to escalate privileges, potentially leading to arbitrary code execution.",
      "vulnerability_overview": "N/AAn improper privilege management vulnerability exists that could cause privilege escalation and arbitrary code execution when a privileged engineer user with console access modifies a configuration file used by a root-level daemon to execute custom scripts. CVE-2025-8453has been assigned to this vulnerability. A CVSS v3.1 base score of 6.7 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Schneider Electric Saitel DR RTU: HUe Firmware version 11.06.30 includes a fix for this vulnerability and is available for downloadhere. Schneider Electric Saitel DR RTU: If users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit:Limit physical or console access to trusted users only.Ensure that configuration files used by privileged daemons are owned by root, not writable by non-privileged users, and set to minimum permissions when technically feasible to prevent unauthorized modification. Limit physical or console access to trusted users only. Ensure that configuration files used by privileged daemons are owned by root, not writable by non-privileged users, and set to minimum permissions when technically feasible to prevent unauthorized modification. Schneider Electric Saitel DP RTU: Schneider Electric is establishing a remediation plan for the Saitel DP RTU product that will include a fix for this vulnerability. We will update this document when the remediation is available. Until then, users should immediately apply the following mitigations to reduce the risk of exploit:Limit physical or console access to trusted users only.Enforce password policy (strong password and update password regularly). Password updates can be applied using the EcoStruxure Cybersecurity Admin Expert tool, or device webpage.Users should also consider upgrading to the latest product offering PowerLogic T500 Substation Controller Limit physical or console access to trusted users only. Enforce password policy (strong password and update password regularly). Password updates can be applied using the EcoStruxure Cybersecurity Admin Expert tool, or device webpage. Users should also consider upgrading to the latest product offering PowerLogic T500 Substation Controller For more information see the associated Schneider Electric CPCERT security advisory SEVD-2025-224-01Saitel DR & Saitel DP Remote Terminal Unit - SEVD-2025-224-01 PDF Version,Saitel DR & Saitel DP Remote Terminal Unit - SEVD-2025-224-01 CSAF Version. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Delta Electronics CNCSoft-G2",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-04",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/AThe following versions of Delta Electronics CNCSoft-G2 are affected: CNCSoft-G2: Version 2.1.0.20 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.5 ATTENTION: Low attack complexity Vendor: Delta Electronics Equipment: CNCSoft-G2 Vulnerability: Out-of-bounds Write",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow attackers to execute arbitrary code on affected installations of the device.",
      "vulnerability_overview": "N/ADelta Electronics CNCSoft-G2 is vulnerable to a flaw in the parsing of DPAX files that allows attackers to execute arbitrary code. This vulnerability requires user interaction, such as visiting a malicious page or opening a malicious file. Exploitation of this flaw can result in memory corruption and code execution within the context of the current process. CVE-2025-47728has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-47728. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADelta Electronics recommends users update tov2.1.0.27or later. Delta has publishedDelta-PCSA-2025-00007in both English and Chinese on their security website to provide more details about these issues. Delta also recommends the following general security practices: Do not click on untrusted Internet links or open unsolicited attachments in emails. Avoid exposing control systems and equipment to the Internet. Place systems and devices behind a firewall and isolate them from the business network. When remote access is required, use a secure access method, such as a virtual private network (VPN). If you have any product-related support concerns, find a contact fromDelta's portal pagefor any information or materials you may require. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "GE Vernova CIMPLICITY",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-06",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of GE Vernova's CIMPLICITY, HMI/SCADA software, are affected: CIMPLICITY: Versions 2024, 2023, 2022, 11.0",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.0 ATTENTION: Low attack complexity Vendor: GE Vernova Equipment: CIMPLICITY Vulnerability: Uncontrolled Search Path Element",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a low-privileged local attacker to escalate privileges.",
      "vulnerability_overview": "N/ACIMPLICITY versions 2024, 2023, 2022, and 11.0 are vulnerable to an Uncontrolled Search Path Element exploit that could allow a low-level attacker to escalate their privileges. CVE-2025-7719has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7719. A base score of 7 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AGE Vernova recommends users upgrade to CIMPLICITY 2024 SIM 4. The SIM is posted to the KB as article: 000071725. Direct Link (Login Required):https://digitalsupport.ge.com/s/article/CIMPLICITY-2024-SIM-4?language=en_US. The most complete method to address the vulnerability is upgrading to CIMPLICITY 2024 SIM 4. However, if users are currently unable to upgrade and/or choose not to, it is recommended they reach out to GE Vernova support for guidance to further mitigate the issue on their version(s). Users are strongly advised to follow the Secure Deployment Guide (SDG) instructions. The complete SDG can be found at CIMPLICITY SDG (Login Required). CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Releases Nine Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/28/cisa-releases-nine-industrial-control-systems-advisories",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Delta Electronics COMMGR",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-05",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/AThe following versions of Delta Electronics COMMGR are affected: COMMGR: Versions v2.9.0 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION: Exploitable remotely/low attack complexity Vendor: Delta Electronics Equipment: COMMGR Vulnerabilities: Stack-based Buffer Overflow, Code Injection",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code.",
      "vulnerability_overview": "N/ADelta Electronics COMMGR versions 2.9.0 and prior are vulnerable to a Stack-based Buffer Overflow vulnerability that could allow an attacker to execute arbitrary code by crafting specially designed .isp files. CVE-2025-53418has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-53418. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). Delta Electronics COMMGR versions 2.9.0 and prior are vulnerable to a Code Injection vulnerability that could allow an attacker to execute arbitrary code by crafting specially designed .isp files. CVE-2025-53419has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-53419. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADelta Electronics recommends users to download andupdate to v2.10.0or later. Delta Electronics offers users the following general recommendations: Do not click on untrusted Internet links or open unsolicited attachments in emails. Avoid exposing control systems and equipment to the Internet. Place control system networks and remote devices behind firewalls and isolate them from the business network. When remote access is required, use a secure access method, such as a virtual private network (VPN). For more information, see Delta Electroncis'sAdvisory. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Mitsubishi Electric MELSEC iQ-F Series CPU Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-240-02",
      "published": "Thu, 28 Aug 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AMitsubishi Electric reports the following versions of MELSEC iQ-F Series CPU module are affected: MELSEC iQ-F Series FX5U-32MT/ES: All versions MELSEC iQ-F Series FX5U-32MT/DS: All versions MELSEC iQ-F Series FX5U-32MT/ESS: All versions MELSEC iQ-F Series FX5U-32MT/DSS: All versions MELSEC iQ-F Series FX5U-64MT/ES: All versions MELSEC iQ-F Series FX5U-64MT/DS: All versions MELSEC iQ-F Series FX5U-64MT/ESS: All versions MELSEC iQ-F Series FX5U-64MT/DSS: All versions MELSEC iQ-F Series FX5U-80MT/ES: All versions MELSEC iQ-F Series FX5U-80MT/DS: All versions MELSEC iQ-F Series FX5U-80MT/ESS: All versions MELSEC iQ-F Series FX5U-80MT/DSS: All versions MELSEC iQ-F Series FX5U-32MR/ES: All versions MELSEC iQ-F Series FX5U-32MR/DS: All versions MELSEC iQ-F Series FX5U-64MR/ES: All versions MELSEC iQ-F Series FX5U-64MR/DS: All versions MELSEC iQ-F Series FX5U-80MR/ES: All versions MELSEC iQ-F Series FX5U-80MR/DS: All versions MELSEC iQ-F Series FX5UC-32MT/D: All versions MELSEC iQ-F Series FX5UC-32MT/DSS: All versions MELSEC iQ-F Series FX5UC-64MT/D: All versions MELSEC iQ-F Series FX5UC-64MT/DSS: All versions MELSEC iQ-F Series FX5UC-96MT/D: All versions MELSEC iQ-F Series FX5UC-96MT/DSS: All versions MELSEC iQ-F Series FX5UC-32MT/DS-TS: All versions MELSEC iQ-F Series FX5UC-32MT/DSS-TS: All versions MELSEC iQ-F Series FX5UC-32MR/DS-TS: All versions MELSEC iQ-F Series FX5UJ-24MT/ES: All versions MELSEC iQ-F Series FX5UJ-24MT/DS: All versions MELSEC iQ-F Series FX5UJ-24MT/ESS: All versions MELSEC iQ-F Series FX5UJ-24MT/DSS: All versions MELSEC iQ-F Series FX5UJ-40MT/ES: All versions MELSEC iQ-F Series FX5UJ-40MT/DS: All versions MELSEC iQ-F Series FX5UJ-40MT/ESS: All versions MELSEC iQ-F Series FX5UJ-40MT/DSS: All versions MELSEC iQ-F Series FX5UJ-60MT/ES: All versions MELSEC iQ-F Series FX5UJ-60MT/DS: All versions MELSEC iQ-F Series FX5UJ-60MT/ESS: All versions MELSEC iQ-F Series FX5UJ-60MT/DSS: All versions MELSEC iQ-F Series FX5UJ-24MR/ES: All versions MELSEC iQ-F Series FX5UJ-24MR/DS: All versions MELSEC iQ-F Series FX5UJ-40MR/ES: All versions MELSEC iQ-F Series FX5UJ-40MR/DS: All versions MELSEC iQ-F Series FX5UJ-60MR/ES: All versions MELSEC iQ-F Series FX5UJ-60MR/DS: All versions MELSEC iQ-F Series FX5UJ-24MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-24MR/ES-A: All versions MELSEC iQ-F Series FX5UJ-40MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-40MR/ES-A: All versions MELSEC iQ-F Series FX5UJ-60MT/ES-A: All versions MELSEC iQ-F Series FX5UJ-60MR/ES-A: All versions MELSEC iQ-F Series FX5S-30MT/ES: All versions MELSEC iQ-F Series FX5S-30MT/DS: All versions MELSEC iQ-F Series FX5S-30MT/ESS: All versions MELSEC iQ-F Series FX5S-30MT/DSS: All versions MELSEC iQ-F Series FX5S-40MT/ES: All versions MELSEC iQ-F Series FX5S-40MT/DS: All versions MELSEC iQ-F Series FX5S-40MT/ESS: All versions MELSEC iQ-F Series FX5S-40MT/DSS: All versions MELSEC iQ-F Series FX5S-60MT/ES: All versions MELSEC iQ-F Series FX5S-60MT/DS: All versions MELSEC iQ-F Series FX5S-60MT/ESS: All versions MELSEC iQ-F Series FX5S-60MT/DSS: All versions MELSEC iQ-F Series FX5S-80MT/ES: All versions MELSEC iQ-F Series FX5S-80MT/DS: All versions MELSEC iQ-F Series FX5S-80MT/ESS: All versions MELSEC iQ-F Series FX5S-80MT/DSS: All versions MELSEC iQ-F Series FX5S-30MR/ES: All versions MELSEC iQ-F Series FX5S-30MR/DS: All versions MELSEC iQ-F Series FX5S-40MR/ES: All versions MELSEC iQ-F Series FX5S-40MR/DS: All versions MELSEC iQ-F Series FX5S-60MR/ES: All versions MELSEC iQ-F Series FX5S-60MR/DS: All versions MELSEC iQ-F Series FX5S-80MR/ES: All versions MELSEC iQ-F Series FX5S-80MR/DS: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Mitsubishi Electric Equipment: MELSEC iQ-F Series CPU module Vulnerability: Cleartext Transmission of Sensitive Information",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker the ability to obtain credential information by intercepting SLMP communication messages, and read or write the device values of the product by using the obtained credential information. In addition, the attacker may be able to stop the operations of programs.",
      "vulnerability_overview": "N/AAn information disclosure vulnerability exists in MELSEC iQ-F series CPU module due to cleartext transmission of sensitive information. An attacker may obtain credential information by intercepting SLMP communication messages and using the obtained credentials to read or write the device values. Additionally, the attacker may be able to stop the operation of programs. CVE-2025-7731has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-7731. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/AMitsubishi Electric Corporation advises there are no plans to release a fixed version. Mitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability: Use a virtual private network (VPN) or similar to encrypt SLMP communication. Restrict physical access to the LAN connected by the affected products. Mitsubishi Electric Corporation recommends users contact theirlocal Mitsubishi Electric representativewith questions. For more information, seeMitsubishi Electric's security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Countering Chinese State-Sponsored Actors Compromise of Networks Worldwide to Feed Global Espionage System",
      "link": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a",
      "published": "Wed, 27 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/APeople’s Republic of China (PRC) state-sponsored cyber threat actors are targeting networks globally, including, but not limited to, telecommunications, government, transportation, lodging, and military infrastructure networks. While these actors focus on large backbone routers of major telecommunications providers, as well as provider edge (PE) and customer edge (CE) routers, they also leverage compromised devices and trusted connections to pivot into other networks. These actors often modify routers to maintain persistent, long-term access to networks. This activity partially overlaps with cyber threat actor reporting by the cybersecurity industry—commonly referred to as Salt Typhoon, OPERATOR PANDA, RedMike, UNC5807, and GhostEmperor, among others. The authoring agencies are not adopting a particular commercial naming convention and hereafter refer to those responsible for the cyber threat activity more generically as “Advanced Persistent Threat (APT) actors” throughout this advisory. This cluster of cyber threat activity has been observed in the United States, Australia, Canada, New Zealand, the United Kingdom, and other areas globally. This Cybersecurity Advisory (CSA) includes observations from various government and industry investigations where the APT actors targeted internal enterprise environments, as well as systems and networks that deliver services directly to customers. This CSA details the tactics, techniques, and procedures (TTPs) leveraged by these APT actors to facilitate detection and threat hunting, and provides mitigation guidance to reduce the risk from these APT actors and their TTPs. This CSA is being released by the following authoring and co-sealing agencies: United States National Security Agency (NSA) United States Cybersecurity and Infrastructure Security Agency (CISA) United States Federal Bureau of Investigation (FBI) United States Department of Defense Cyber Crime Center (DC3) Australian Signals Directorate’s Australian Cyber Security Centre (ASD’s ACSC) Canadian Centre for Cyber Security (Cyber Centre) Canadian Security Intelligence Service (CSIS) New Zealand National Cyber Security Centre (NCSC-NZ) United Kingdom National Cyber Security Centre (NCSC-UK) Czech Republic National Cyber and Information Security Agency (NÚKIB) - Národní úřad pro kybernetickou a informační bezpečnost Finnish Security and Intelligence Service (SUPO) - Suojelupoliisi Germany Federal Intelligence Service (BND) - Bundesnachrichtendienst Germany Federal Office for the Protection of the Constitution (BfV) -   Bundesamt für Verfassungsschutz Germany Federal Office for Information Security (BSI) - Bundesamt für Sicherheit in der Informationstechnik Italian External Intelligence and Security Agency (AISE) - Agenzia Informazioni e Sicurezza Esterna Italian Internal Intelligence and Security Agency (AISI) - Agenzia Informazioni e Sicurezza Interna Japan National Cyber Office (NCO) - 国家サイバー統括室 Japan National Police Agency (NPA) - 警察庁 Netherlands Defence Intelligence and Security Service (MIVD) - Militaire Inlichtingen- en Veiligheidsdienst Netherlands General Intelligence and Security Service (AIVD) - Algemene Inlichtingen- en Veiligheidsdienst Polish Military Counterintelligence Service (SKW) - Służba Kontrwywiadu Wojskowego Polish Foreign Intelligence Agency (AW) - Agencja Wywiadu Spain National Intelligence Centre (CNI) - Centro Nacional de Inteligencia The authoring agencies strongly urge network defenders to hunt for malicious activity and to apply the mitigations in this CSA to reduce the threat of Chinese state-sponsored and other malicious cyber activity. Any mitigation or eviction measures listed within are subject to change as new information becomes available and ongoing coordinated operations dictate. Network defenders should ensure any actions taken in response to the CSA are compliant with local laws and regulations within the jurisdictions within which they operate.",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/AThese APT actors are having considerable success using publicly known CVEs to gain access to networks, so organizations are strongly encouraged to prioritize patching in a way that is proportionate to this threat, such as by sequencing patches to address the highest risks first. See CISA’sKnown Exploited Vulnerabilities Catalogfor further information. Specifically, organizations should ensure edge devices are not vulnerable to the known exploited CVEs identified in this advisory—CVE-2024-21887, CVE-2024-3400, CVE-2023-20273, CVE-2023-20198, and CVE-2018-0171. This list is not exhaustive. Note: This advisory usesMITRE D3FEND™, version 1.2.0, cybersecurity countermeasures. See theAppendix C: MITRE D3FEND Countermeasuressection of this advisory for a table of the mitigations mapped to MITRE D3FEND countermeasures."
    },
    {
      "title": "CISA and Partners Release Joint Advisory on Countering Chinese State-Sponsored Actors Compromise of Networks Worldwide to Feed Global Espionage Systems",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/27/cisa-and-partners-release-joint-advisory-countering-chinese-state-sponsored-actors-compromise",
      "published": "Wed, 27 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Releases Three Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/26/cisa-releases-three-industrial-control-systems-advisories",
      "published": "Tue, 26 Aug 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Schneider Electric Modicon M340 Controller and Communication Modules",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-238-03",
      "published": "Tue, 26 Aug 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Modicon M340: All versions BMXNOR0200H Ethernet/Serial RTU Module: All versions BMXNGD0100 M580 Global Data module: All versions BMXNOC0401 Modicon M340 X80 Ethernet Communication modules: All versions BMXNOE0100 Modbus/TCP Ethernet Modicon M340 module: Versions prior to 3.60 BMXNOE0110 Modbus/TCP Ethernet Modicon M340 FactoryCast module: Versions prior to 6.80",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Schneider Electric Equipment: Modicon M340 and Communication Modules Vulnerability: Improper Input Validation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition.",
      "vulnerability_overview": "N/AImproper Input Validation vulnerability exists that could cause a Denial Of Service when specially crafted FTP command is sent to the device. CVE-2025-6625has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-6625. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: BMXNOE0100 Modbus/TCP Ethernet Modicon M340 module: Version 3.60 of BMXNOE0100 includes a fix for this vulnerability and is available for downloadhere. Reboot is needed to complete the firmware upgrade. BMXNOE0110 Modbus/TCP Ethernet Modicon M340 FactoryCast module: Version 6.80 of BMXNOE0110 includes a fix for this vulnerability and is available for downloadhere.Reboot is needed to complete the firmware upgrade. Schneider Electric is establishing a remediation plan for all future versions of Modicon M340, BMXNOR0200H, BMXNGD0100, and BMXNOC401. Until then, users should immediately apply the following mitigations to reduce the risk of exploit: FTP service is disabled by default Ensure to disable FTP service when not in use Setup network segmentation and implement a firewall to block all unauthorized access to ports 21/FTP Use VPN (Virtual Private Networks) tunnels if remote access is required For more information see the associated Schneider Electric CPCERT security advisorySEVD-2025-224-05. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/26/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Tue, 26 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "INVT VT-Designer and HMITool",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-238-01",
      "published": "Tue, 26 Aug 25 12:00:00 +0000",
      "vendor": "INVT Electric",
      "affected_products": "N/AThe following versions of INVT VT-Designer and HMITool are affected: VT-Designer: Version 2.1.13 (CVE-2025-7227, CVE-2025-7228, CVE-2025-7229, CVE-2025-7230, CVE-2025-7231) HMITool: Version 7.1.011 (CVE-2025-7223, CVE-2025-7224, CVE-2025-7225, CVE-2025-7226)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.5 ATTENTION: Low attack complexity Vendor: INVT Equipment: VT-Designer and HMITool Vulnerabilities: Out-of-bounds Write, Access of Resource Using Incompatible Type ('Type Confusion')",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow attackers to execute arbitrary code in the context of the current process.",
      "vulnerability_overview": "N/AHMITool is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of VPM files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7223has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7223. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). HMITool is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of VPM files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7224has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7224. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). HMITool is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of VPM files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7225has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7225. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). HMITool is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of VPM files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7226has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7226. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). VT-Designer is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PM3 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7227has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7227. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). VT-Designer is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PM3 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7228has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7228. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). VT-Designer is vulnerable to remote attackers when who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PM3 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7229has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7229. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). VT-Designer is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PM3 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7230has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7230. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). VT-Designer is vulnerable to remote attackers who can execute arbitrary code on affected installations. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PM3 files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated data structure. An attacker can leverage this vulnerability to execute code in the context of the current process. CVE-2025-7231has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7231. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AINVT did not respond to CISA's attempt to coordinate these vulnerabilities. Users should contactINVTfor more information. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "CISA Adds Three Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/25/cisa-adds-three-known-exploited-vulnerabilities-catalog",
      "published": "Mon, 25 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Requests Public Comment for Updated Guidance on Software Bill of Materials",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/22/cisa-requests-public-comment-updated-guidance-software-bill-materials",
      "published": "Fri, 22 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "FUJIFILM Healthcare Americas Synapse Mobility",
      "link": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-233-01",
      "published": "Thu, 21 Aug 25 12:00:00 +0000",
      "vendor": "Fujifilm",
      "affected_products": "N/AThe following versions of FUJIFILM Healthcare Americas Synapse Mobility are affected: Synapse Mobility: Versions prior to 8.2",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 5.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: FUJIFILM Healthcare Americas Corporation Equipment: Synapse Mobility Vulnerability: External Control of Assumed-Immutable Web Parameter",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to access information beyond their assigned roles.",
      "vulnerability_overview": "N/AFUJIFILM Healthcare Americas Synapse Mobility versions prior to 8.2 contains a privilege escalation vulnerability through external control of Web parameter. Exploitation of this vulnerability could allow an attacker to bypass authentication and access information beyond role-based access controls. CVE-2025-54551has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-54551. A base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/AFUJIFILM Healthcare Americas has released the following mitigation options for users to follow: It is recommended to upgrade to the latest version of the product or any version from 8.2 and later to resolve this issue. There is an immediate mitigation available of disabling the search function in the configurator settings. Access to the search function for all users can also be removed by unchecking the \"Allow plain text accession number\" check box in the security section of the admin interface. This will limit the site to use of the product only via the SecureURL feature. Patches have been released which will remediate the vulnerability for software versions 8.0-8.1.1. FUJIFILM Healthcare Americas strongly encourages users to update the Synapse Mobility application to the latest version if they are past their end of support date. For more information, refer toSynapse Mobility Vulnerability Notification. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/21/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Thu, 21 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Mitsubishi Electric Corporation MELSEC iQ-F Series CPU Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-233-01",
      "published": "Thu, 21 Aug 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AThe following versions of MELSEC iQ-F Series CPU module are affected: MELSEC iQ-F Series CPU module FX5U-32MT/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-32MT/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-32MT/ESS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-32MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-32MR/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-32MR/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MT/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MT/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MT/ESS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MR/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-64MR/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MT/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MT/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MT/ESS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MR/ES: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5U-80MR/DS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-32MT/D: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-32MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-64MT/D: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-64MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-96MT/D: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-96MT/DSS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-32MT/DS-TS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-32MT/DSS-TS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UC-32MR/DS-TS: Versions 1.060 and later MELSEC iQ-F Series CPU module FX5UJ-24MT/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-24MT/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-24MT/ESS: All versions MELSEC iQ-F Series CPU module FX5UJ-24MT/DSS: All versions MELSEC iQ-F Series CPU module FX5UJ-24MR/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-24MR/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-40MT/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-40MT/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-40MT/ESS: All versions MELSEC iQ-F Series CPU module FX5UJ-40MT/DSS: All versions MELSEC iQ-F Series CPU module FX5UJ-40MR/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-40MR/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-60MT/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-60MT/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-60MT/ESS: All versions MELSEC iQ-F Series CPU module FX5UJ-60MT/DSS: All versions MELSEC iQ-F Series CPU module FX5UJ-60MR/ES: All versions MELSEC iQ-F Series CPU module FX5UJ-60MR/DS: All versions MELSEC iQ-F Series CPU module FX5UJ-24MT/ES-A: All versions MELSEC iQ-F Series CPU module FX5UJ-24MR/ES-A: All versions MELSEC iQ-F Series CPU module FX5UJ-40MT/ES-A: All versions MELSEC iQ-F Series CPU module FX5UJ-40MR/ES-A: All versions MELSEC iQ-F Series CPU module FX5UJ-60MT/ES-A: All versions MELSEC iQ-F Series CPU module FX5UJ-60MR/ES-A: All versions MELSEC iQ-F Series CPU module FX5S-30MT/ES: All versions MELSEC iQ-F Series CPU module FX5S-30MT/DS: All versions MELSEC iQ-F Series CPU module FX5S-30MT/ESS: All versions MELSEC iQ-F Series CPU module FX5S-30MT/DSS: All versions MELSEC iQ-F Series CPU module FX5S-30MR/ES: All versions MELSEC iQ-F Series CPU module FX5S-30MR/DS: All versions MELSEC iQ-F Series CPU module FX5S-40MT/ES: All versions MELSEC iQ-F Series CPU module FX5S-40MT/DS: All versions MELSEC iQ-F Series CPU module FX5S-40MT/ESS: All versions MELSEC iQ-F Series CPU module FX5S-40MT/DSS: All versions MELSEC iQ-F Series CPU module FX5S-40MR/ES: All versions MELSEC iQ-F Series CPU module FX5S-40MR/DS: All versions MELSEC iQ-F Series CPU module FX5S-60MT/ES: All versions MELSEC iQ-F Series CPU module FX5S-60MT/DS: All versions MELSEC iQ-F Series CPU module FX5S-60MT/ESS: All versions MELSEC iQ-F Series CPU module FX5S-60MT/DSS: All versions MELSEC iQ-F Series CPU module FX5S-60MR/ES: All versions MELSEC iQ-F Series CPU module FX5S-60MR/DS: All versions MELSEC iQ-F Series CPU module FX5S-80MT/ES: All versions MELSEC iQ-F Series CPU module FX5S-80MT/ESS: All versions MELSEC iQ-F Series CPU module FX5S-80MR/ES: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 5.3 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Mitsubishi Electric Corporation Equipment:MELSEC iQ-F Series CPU module Vulnerability:Improper Handling of Length Parameter Inconsistency",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in a remote attacker being able to delay the processing of the Web server function and prevent legitimate users from utilizing the Web server function by sending a specially crafted HTTP request.",
      "vulnerability_overview": "N/AA Denial-of-Service (DoS) vulnerability due to Improper Handling of Length Parameter Inconsistency exists in the Web server function of the MELSEC iQ-F Series CPU module. CVE-2025-5514has been assigned to this vulnerability. A CVSS v3 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).",
      "mitigations": "N/AMitsubishi Electric Corporation advises that there are no plans to release a fixed version. Mitsubishi Electric recommends users take the following mitigation measures to minimize the risk of exploiting this vulnerability: Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required. Use within a LAN and block access from untrusted networks and hosts through firewalls. Use IP filter function to block access from untrusted hosts. For details on the IP filter function, please refer to themanualfor each product: \"13.1 IP Filter Function\" in the MELSEC iQ-F FX5 User's Manual (Communication). Restrict physical access to the affected products and the LAN connected by them. Mitsubishi Electric Corporation recommends users contact their local Mitsubishi Electricrepresentativewith questions. For more information, see Mitsubishi Electric'ssecurity advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Three Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/21/cisa-releases-three-industrial-control-systems-advisories",
      "published": "Thu, 21 Aug 25 12:00:00 +0000",
      "vendor": "Fujifilm",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Releases Four Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/19/cisa-releases-four-industrial-control-systems-advisories",
      "published": "Tue, 19 Aug 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens Mendix SAML Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-231-02",
      "published": "Tue, 19 Aug 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens Mendix SAML (Mendix 9.24 compatible): Versions prior to V3.6.21 Siemens Mendix SAML (Mendix 10.12 compatible): Versions prior to V4.0.3 Siemens Mendix SAML (Mendix 10.21 compatible): Versions prior to V4.1.2",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 8.7 ATTENTION: Exploitable remotely Vendor: Siemens Equipment: Mendix SAML Module Vulnerability: Improper Verification of Cryptographic Signature",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow unauthenticated remote attackers to hijack an account in specific SSO configurations.",
      "vulnerability_overview": "N/AAffected versions of the module insufficiently enforce signature validation and binding checks. This could allow unauthenticated remote attackers to hijack an account in specific SSO configurations. CVE-2025-40758has been assigned to this vulnerability. A CVSS v3.1 base score of 8.7 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: All affected products: Make sure to use configurations where UseEncryption is enabled Mendix SAML (Mendix 9.24 compatible): Update to V3.6.21 orlater version Mendix SAML (Mendix 10.12 compatible): Update to V4.0.3 orlater version Mendix SAML (Mendix 10.21 compatible): Update to V4.1.2 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-395458 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Siemens Desigo CC Product Family and SENTRON Powermanager",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-231-01",
      "published": "Tue, 19 Aug 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Desigo CC family V5.0: All versions Desigo CC family V5.1: All versions Desigo CC family V6: All versions Desigo CC family V7: All versions Desigo CC family V8: All versions SENTRON Powermanager V5: All versions SENTRON Powermanager V6: All versions SENTRON Powermanager V7: All versions SENTRON Powermanager V8: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 8.2 ATTENTION: Low attack complexity Vendor: Siemens Equipment: Desigo CC Product Family and SENTRON Powermanager Vulnerability: Least Privilege Violation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow privilege escalation.",
      "vulnerability_overview": "N/AWibu CodeMeter before 8.30a sometimes allows privilege escalation immediately after installation (before a logoff or reboot). For exploitation, there must have been an unprivileged installation with UAC, and the CodeMeter Control Center component must be installed, and the CodeMeter Control Center component must not have been restarted. In this scenario, the local user can navigate from Import License to a privileged instance of Windows Explorer. CVE-2025-47809has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Please follow below steps to update the WIBU CodeMeter : Uninstall the previous installed version of CodeMeter via Control Panel Install the CodeMeter V8.30a (Refer:https://www.wibu.com/us/support.html) Restart client/server after installation of CodeMeter For more details regarding the vulnerability in CodeMeter Runtime refer to: WIBU Systems Security Advisory WIBU-100120:https://www.wibu.com/support/security-advisories/wibu-100120.html As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-201595 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/08/18/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Mon, 18 Aug 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens RUGGEDCOM ROX II",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-20",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: RUGGEDCOM ROX MX5000: All versions RUGGEDCOM ROX RX1536: All versions RUGGEDCOM ROX RX5000: All versions RUGGEDCOM ROX MX5000RE: All versions RUGGEDCOM ROX RX1400: All versions RUGGEDCOM ROX RX1500: All versions RUGGEDCOM ROX RX1501: All versions RUGGEDCOM ROX RX1510: All versions RUGGEDCOM ROX RX1511: All versions RUGGEDCOM ROX RX1512: All versions RUGGEDCOM ROX RX1524: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Low Attack Complexity Vendor: Siemens Equipment: RUGGEDCOM ROX II family Vulnerability: Authentication Bypass Using an Alternate Path or Channel",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a local attacker to bypass authentication and access a root shell on the device.",
      "vulnerability_overview": "N/AAffected devices do not properly limit access through its Built-In-Self-Test (BIST) mode. This could allow an attacker with physical access to the serial interface to bypass authentication and get access to a root shell on the device. CVE-2025-40761has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-40761. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Currently no fix is available RUGGEDCOM ROX RX1400: Ensure a secure boot password is set as described in theconfiguration manualto prevent unauthorized access to BIST mode. SeeSec. 5.9.3 for more details RUGGEDCOM ROX RX1500, RUGGEDCOM ROX RX1501, RUGGEDCOM ROX RX1510, RUGGEDCOM ROX RX1511, RUGGEDCOM ROX RX1512, RUGGEDCOM ROX RX1524, RUGGEDCOM ROX RX1536: Ensure a secure boot password is set as described in theconfiguration manualto prevent unauthorized access to BIST mode. See Sec. 5.9.3 for more details RUGGEDCOM ROX MX5000, RUGGEDCOM ROX MX5000RE, RUGGEDCOM ROX RX5000: Ensure a secure boot password is set as described in theconfiguration manualto prevent unauthorized access to BIST mode. See Sec. 5.9.3 for more details As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information see the associated Siemens security advisory SSA-094954 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Rockwell Automation Micro800",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-25",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Rockwell Automation Micro800 are affected: PLC Micro820 LC20: All versions prior to V14.011 (CVE-2023-48691, CVE-2023-48692, CVE-2023-48693) PLC Micro850 LC50: All versions prior to V12.013 (CVE-2023-48691, CVE-2023-48692, CVE-2023-48693) PLC Micro870 LC70: All versions prior to V12.013 (CVE-2023-48691, CVE-2023-48692, CVE-2023-48693) PLC Micro850 L50E: Versions V20.011 through V22.011 (CVE-2023-48691, CVE-2023-48692, CVE-2023-48693, CVE-2025-7693) PLC Micro870 L70E: Versions V20.011 through V22.011 (CVE-2023-48691, CVE-2023-48692, CVE-2023-48693, CVE-2025-7693)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION:Exploitable remotely/low attack complexity Vendor:Rockwell Automation Equipment:Micro800 Vulnerabilities:Dependency on Vulnerable Third-Party Component, Improper Input Validation",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in remote code execution or may lead to privilege escalation.",
      "vulnerability_overview": "N/AAzure RTOS NetX Duo is a TCP/IP network stack designed specifically for deeply embedded real-time and IoT applications. An attacker can cause an out-of-bounds write in Azure RTOS NETX Duo, that could lead to remote code execution. CVE-2023-48691has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2023-48691. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Azure RTOS NetX Duo is a TCP/IP network stack designed specifically for deeply embedded real-time and IoT applications. An attacker can cause remote code execution due to memory overflow vulnerabilities in Azure RTOS NETX Duo. CVE-2023-48692has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2023-48692. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Azure RTOS ThreadX is an advanced real-time operating system (RTOS) designed specifically for deeply embedded applications. An attacker can cause arbitrary read and write due to vulnerability in parameter checking mechanism in Azure RTOS ThreadX, which may lead to privilege escalation. CVE-2023-48693has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2023-48693. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). A security issue exists due to improper handling of malformed CIP Forward Close packets during fuzzing. The controller enters a solid red Fault LED state and becomes unresponsive. Upon power cycle, the controller will enter recoverable fault where the MS LED and Fault LED become flashing red and reports fault code 0xF015. To recover, clear the fault. CVE-2025-7693has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7693. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends the following updates: PLC Micro820 LC20: Migrate to Micro820 L20EV23.011 and later(this has yet to be released, target to release in Sept 2025) PLC Micro850 LC50: Migrate to Micro850 L50EV23.011 and later PLC Micro870 LC70: Migrate to Micro870 L70EV23.011 and later PLC Micro850 L50E:V23.011 and later PLC Micro870 L70E:V23.011 and later Rockwell Automation also recommends users follow their publishedSecurity Best Practices. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Rockwell FactoryTalk Linx",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-24",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following Rockwell Automation products are affected: FactoryTalk Linx: Versions prior to 6.50",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.4 ATTENTION: Low attack complexity Vendor: Rockwell Equipment: FactoryTalk Linx Vulnerability: Improper Access Control",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to to create, update, and delete FTLinx drivers.",
      "vulnerability_overview": "N/AA security issue exists within the FactoryTalk Linx Network Browser. By modifying the process.env.NODE_ENV to 'development', the attacker can disable FTSP token validation. This bypass allows access to create, update, and delete FTLinx drivers. CVE-2025-7972has been assigned to this vulnerability. A CVSS v3.1 base score of 9.0 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7972. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:H/SC:N/SI:H/SA:H).",
      "mitigations": "N/ARockwell Automation recommends users update to v6.50 Users should update to the corrected version. If users of the affected software are unable to upgrade the version,security best practicesshould be applied. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens Engineering Platforms",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-03",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens SIMATIC PCS neo V4.1: All Versions Siemens SIMATIC WinCC V18: All Versions Siemens SIMATIC WinCC V19: All versions prior to V19 Update 4 Siemens SIMATIC WinCC V20: All Versions Siemens SIMOCODE ES V17: All Versions Siemens SIMOCODE ES V18: All Versions Siemens SIMOCODE ES V19: All Versions Siemens SIMOCODE ES V20: All Versions Siemens SIMOTION SCOUT TIA V5.4: All Versions Siemens SIMOTION SCOUT TIA V5.5: All Versions Siemens SIMOTION SCOUT TIA V5.6: All versions prior to V5.6 SP1 HF7 Siemens SIMATIC PCS neo V5.0: All Versions Siemens SIMOTION SCOUT TIA V5.7: All Versions Siemens SINAMICS Startdrive V17: All Versions Siemens SINAMICS Startdrive V18: All Versions Siemens SINAMICS Startdrive V19: All Versions Siemens SINAMICS Startdrive V20: All Versions Siemens SIRIUS Safety ES V17 (TIA Portal): All Versions Siemens SIRIUS Safety ES V18 (TIA Portal): All Versions Siemens SIRIUS Safety ES V19 (TIA Portal): All Versions Siemens SIRIUS Safety ES V20 (TIA Portal): All Versions Siemens SIRIUS Soft Starter ES V17 (TIA Portal): All Versions Siemens SIMATIC PCS neo V6.0: All Versions Siemens SIRIUS Soft Starter ES V18 (TIA Portal): All Versions Siemens SIRIUS Soft Starter ES V19 (TIA Portal): All Versions Siemens SIRIUS Soft Starter ES V20 (TIA Portal): All Versions Siemens TIA Portal Cloud V17: All Versions Siemens TIA Portal Cloud V18: All Versions Siemens TIA Portal Cloud V19: All versions prior to 5.2.1.1 Siemens TIA Portal Cloud V20: All Versions Siemens TIA Portal Test Suite V20: All Versions Siemens SIMATIC S7-PLCSIM V17: All Versions Siemens SIMATIC STEP 7 V17: All Versions Siemens SIMATIC STEP 7 V18: All Versions Siemens SIMATIC STEP 7 V19: All versions prior to V19 Update 4 Siemens SIMATIC STEP 7 V20: All Versions Siemens SIMATIC WinCC V17: All Versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 8.2 ATTENTION: Low Attack Complexity Vendor: Siemens Equipment: Engineering Platforms Vulnerability: Deserialization of Untrusted Data",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a local authenticated attacker to cause a type confusion and execute arbitrary code within the affected application and its privileges.",
      "vulnerability_overview": "N/AAffected products do not properly sanitize Interprocess Communication input received through a Windows Named Pipe accessible to all local users. This could allow an authenticated local attacker to cause a type confusion and execute arbitrary code within the affected application. CVE-2024-54678has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: All affected products on Desktop systems: Execute affected software on Windows hosts where only a single user is configured All affected products on Server systems: Reduce the access on operating system level to administrators only SIMATIC PCS neo V4.1, SIMATIC S7-PLCSIM V17: Currently no fix is planned SIMATIC PCS neo V5.0, SIMATIC PCS neo V6.0, SIMATIC STEP 7 V17, SIMATIC STEP 7 V18, SIMATIC STEP 7 V20, SIMATIC WinCC V17, SIMATIC WinCC V18, SIMATIC WinCC V20, SIMOCODE ES V17, SIMOCODE ES V18, SIMOCODE ES V19, SIMOCODE ES V20, SIMOTION SCOUT TIA V5.4, SIMOTION SCOUT TIA V5.5, SIMOTION SCOUT TIA V5.7, SINAMICS Startdrive V17, SINAMICS Startdrive V18, SINAMICS Startdrive V19, SINAMICS Startdrive V20, SIRIUS Safety ES V17 (TIA Portal), SIRIUS Safety ES V18 (TIA Portal), SIRIUS Safety ES V19 (TIA Portal), SIRIUS Safety ES V20 (TIA Portal), SIRIUS Soft Starter ES V17 (TIA Portal), SIRIUS Soft Starter ES V18 (TIA Portal), SIRIUS Soft Starter ES V19 (TIA Portal), SIRIUS Soft Starter ES V20 (TIA Portal), TIA Portal Cloud V17, TIA Portal Cloud V18, TIA Portal Cloud V20, TIA Portal Test Suite V20: Currently no fix is available As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-693808 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Rockwell Automation FactoryTalk Viewpoint",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-23",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of FactoryTalk Viewpoint is affected: FactoryTalk Viewpoint: Version 14.00 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.5 ATTENTION:Low attack complexity Vendor:Rockwell Automation Equipment:FactoryTalk Viewpoint Vulnerability:Improper Handling of Insufficient Permissions or Privileges",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in full privilege escalation.",
      "vulnerability_overview": "N/AA security issue exists in FactoryTalk ViewPoint version 14.0 or below due to improper handling of MSI repair operations. During a repair, attackers can hijack the cscript.exe console window, which runs with SYSTEM privileges. This can be exploited to spawn an elevated command prompt, enabling full privilege escalation. CVE-2025-7973has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7973. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AUpdate the affected product to version 15.00 or later. If those using the affected software are not able to upgrade the version,security best practicesshould be applied. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Rockwell Automation FLEX 5000 I/O",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-226-26",
      "published": "Thu, 14 Aug 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of FLEX 5000 I/O is affected: 5069-IF8: version V2.011 (CVE-2025-7861) 5069-IY8: version V2.011 (CVE-2025-7862)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Rockwell Automation Equipment:FLEX 5000 I/O Vulnerabilities:Improper Input Validation",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could create a denial-of-service condition.",
      "vulnerability_overview": "N/AA security issue exists due to improper handling of CIP Class 32's request when a module is inhibited on the 5094-IF8 device. It causes the module to enter a fault state with the Module LED flashing red. Upon un-inhibiting, the module returns a connection fault (Code 16#0010), and the module cannot recover without a power cycle. CVE-2025-7861has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-7861. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A security issue exists due to improper handling of CIP Class 32's request when a module is inhibited on the 5094-IY8 device. It causes the module to enter a fault state with the Module LED flashing red. Upon un-inhibiting, the module returns a connection fault (Code 16#0010), and the module cannot recover without a power cycle. CVE-2025-7862has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H/E:U/RL:O/RC:C). A CVSS v4 score has also been calculated forCVE-2025-7862. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends users upgrade to V2.012 or later. The update can be downloaded fromRockwell Automation's website. Rockwell Automation also recommends users follow their publishedSecurity Best Practices. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    }
  ]
}