{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-11-14T20:21:06.353094Z",
  "items": [
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/14/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Fri, 14 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Mitsubishi Electric MELSEC iQ-F Series",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-01",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AThe following versions of Mitsubishi Electric MELSEC iQ-F Series are affected: FX5U-32MT/ES: All versions FX5U-32MT/DS: All versions FX5U-32MT/ESS: All versions FX5U-32MT/DSS: All versions FX5U-64MT/ES: All versions FX5U-64MT/DS: All versions FX5U-64MT/ESS: All versions FX5U-64MT/DSS: All versions FX5U-80MT/ES: All versions FX5U-80MT/DS: All versions FX5U-80MT/ESS: All versions FX5U-80MT/DSS: All versions FX5U-32MR/ES: All versions FX5U-32MR/DS: All versions FX5U-64MR/ES: All versions FX5U-64MR/DS: All versions FX5U-80MR/ES: All versions FX5U-80MR/DS: All versions FX5UC-32MT/D: All versions FX5UC-32MT/DSS: All versions FX5UC-64MT/D: All versions FX5UC-64MT/DSS: All versions FX5UC-96MT/D: All versions FX5UC-96MT/DSS: All versions FX5UC-32MT/DS-TS: All versions FX5UC-32MT/DSS-TS: All versions FX5UC-32MR/DS-TS: All versions FX5UJ-24MT/ES: All versions FX5UJ-24MT/DS: All versions FX5UJ-24MT/ESS: All versions FX5UJ-24MT/DSS: All versions FX5UJ-40MT/ES: All versions FX5UJ-40MT/DS: All versions FX5UJ-40MT/ESS: All versions FX5UJ-40MT/DSS: All versions FX5UJ-60MT/ES: All versions FX5UJ-60MT/DS: All versions FX5UJ-60MT/ESS: All versions FX5UJ-60MT/DSS: All versions FX5UJ-24MR/ES: All versions FX5UJ-24MR/DS: All versions FX5UJ-40MR/ES: All versions FX5UJ-40MR/DS: All versions FX5UJ-60MR/ES: All versions FX5UJ-60MR/DS: All versions FX5UJ-24MR/ES-A: All versions FX5UJ-24MT/ES-A: All versions FX5UJ-40MR/ES-A: All versions FX5UJ-40MT/ES-A: All versions FX5UJ-60MR/ES-A: All versions FX5UJ-60MT/ES-A: All versions FX5S-30MT/ES: All versions FX5S-30MT/DS: All versions FX5S-30MT/ESS: All versions FX5S-30MT/DSS: All versions FX5S-40MT/ES: All versions FX5S-40MT/DS: All versions FX5S-40MT/ESS: All versions FX5S-40MT/DSS: All versions FX5S-60MT/ES: All versions FX5S-60MT/DS: All versions FX5S-60MT/ESS: All versions FX5S-60MT/DSS: All versions FX5S-80MT/ES: All versions FX5S-80MT/DS: All versions FX5S-80MT/ESS: All versions FX5S-80MT/DSS: All versions FX5S-30MR/ES: All versions FX5S-30MR/DS: All versions FX5S-40MR/ES: All versions FX5S-40MR/DS: All versions FX5S-60MR/ES: All versions FX5S-60MR/DS: All versions FX5S-80MR/ES: All versions FX5S-80MR/DS: All versions FX5S-30MR/ES-A: All versions FX5S-30MT/ES-A: All versions FX5S-40MR/ES-A: All versions FX5S-40MT/ES-A: All versions FX5S-60MR/ES-A: All versions FX5S-60MT/ES-A: All versions FX5S-80MR/ES-A: All versions FX5S-80MT/ES-A: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 5.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Mitsubishi Electric Equipment: MELSEC iQ-F Series Vulnerability: Improper Validation of Specified Quantity in Input",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition on the product.",
      "vulnerability_overview": "N/AA denial-of-service (DoS) vulnerability exists in the TCP communication function on the MELSEC iQ-F Series CPU module. A remote attacker may be able to disconnect the connection by sending specially crafted TCP packets to cause a denial-of-service (DoS) condition on the products (CVE-2025-10259). There is no impact on connections other than the attacked one. CVE-2025-10259has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L).",
      "mitigations": "N/AMitsubishi Electric recommends that users take the following mitigation measures to minimize the risk of exploiting this vulnerability: Use a virtual private network (VPN) to encrypt the communication when Internet access is required. Restrict physical access to the affected products and the LAN that is connected by them. For more information, see Mitsubishi Electric Advisory2025-014. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens LOGO! 8 BM Devices",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-13",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: LOGO! 12/24RCE (6ED1052-1MD08-0BA2): All versions SIPLUS LOGO! 12/24RCEo (6AG1052-2MD08-7BA2): All versions SIPLUS LOGO! 230RCE (6AG1052-1FB08-7BA2): All versions SIPLUS LOGO! 230RCEo (6AG1052-2FB08-7BA2): All versions SIPLUS LOGO! 24CE (6AG1052-1CC08-7BA2): All versions SIPLUS LOGO! 24CEo (6AG1052-2CC08-7BA2): All versions SIPLUS LOGO! 24RCE (6AG1052-1HB08-7BA2): All versions SIPLUS LOGO! 24RCEo (6AG1052-2HB08-7BA2): All versions LOGO! 12/24RCEo (6ED1052-2MD08-0BA2): All versions LOGO! 230RCE (6ED1052-1FB08-0BA2): All versions LOGO! 230RCEo (6ED1052-2FB08-0BA2): All versions LOGO! 24CE (6ED1052-1CC08-0BA2): All versions LOGO! 24CEo (6ED1052-2CC08-0BA2): All versions LOGO! 24RCE (6ED1052-1HB08-0BA2): All versions LOGO! 24RCEo (6ED1052-2HB08-0BA2): All versions SIPLUS LOGO! 12/24RCE (6AG1052-1MD08-7BA2): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: LOGO! 8 BM Devices Vulnerabilities: Buffer Copy without Checking Size of Input ('Classic Buffer Overflow'), Missing Authentication for Critical Function",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to execute code remotely, put the device into a denial-of-service state, or change the behavior of the device.",
      "vulnerability_overview": "N/AAffected devices do not properly validate the structure of TCP packets in several methods. This could allow an attacker to cause buffer overflows, gain control over the instruction counter and run custom code. CVE-2025-40815has been assigned to this vulnerability. A CVSS v3.1 base score of 7.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-40815. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Affected devices do not perform certain validations during interactions. This could allow an unauthenticated remote attacker to manipulate the device's IP address, rendering it unreachable. CVE-2025-40816has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-40816. A base score of 7.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). Affected devices do not perform certain validations during interactions. This could allow an unauthenticated remote attacker to change the device's time, causing it to behave differently. CVE-2025-40817has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-40817. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens is preparing fixed versions and recommends specific countermeasures for products where fixes are not available or not yet available. Siemens has identified the following specific workarounds and mitigations users can apply to reduce risk: (CVE-2025-40815) Protect the LSC access to the device with a strong password. Currently no fix is available. (CVE-2025-40816, CVE-2025-40817) Restrict network access to port 10006/udp to trusted IP addresses. Currently no fix is planned. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-267056 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Siemens SICAM P850 family and SICAM P855 family",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-11",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: SICAM P850 (7KG8500-0AA00-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA02-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA11-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA11-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA12-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA12-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA31-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA31-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA32-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA32-2AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA00-0AA0): Versions prior to 3.11 SICAM P850 (7KG8500-0AA00-2AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA00-2AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA10-0AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA10-2AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA30-0AA0): Versions prior to 3.11 SICAM P855 (7KG8550-0AA30-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA01-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA01-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA02-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA02-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA11-0AA0): Versions prior to 3.11 SICAM P850 (7KG8500-0AA10-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA11-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA12-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA12-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA31-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA31-2AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA32-0AA0): Versions prior to 3.11 SICAM P855 (7KG8551-0AA32-2AA0): Versions prior to 3.11 SICAM P850 (7KG8500-0AA10-2AA0): Versions prior to 3.11 SICAM P850 (7KG8500-0AA30-0AA0): Versions prior to 3.11 SICAM P850 (7KG8500-0AA30-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA01-0AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA01-2AA0): Versions prior to 3.11 SICAM P850 (7KG8501-0AA02-0AA0): Versions prior to 3.11",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 5.5 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: SICAM P850 family and SICAM P855 family Vulnerabilities: Cross-Site Request Forgery (CSRF), Incorrect Permission Assignment for Critical Resource",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to perform arbitrary actions on the device on behalf of a legitimate user, or impersonate that user.",
      "vulnerability_overview": "N/AThe web interface of the affected devices are vulnerable to Cross-Site Request Forgery attacks. By tricking an authenticated victim user to click a malicious link, an attacker could perform arbitrary actions on the device on behalf of the victim user. CVE-2023-30901has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:L/A:N). Affected devices are missing cookie protection flags when using the default settings. An attacker who gains access to a session token can use it to impersonate a legitimate application user. CVE-2023-31238has been assigned to this vulnerability. A CVSS v3.1 base score of 5.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:C/C:L/I:L/A:L).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Update to V3.11 orlater version (CVE-2023-30901) All affected products: Do not access links from untrusted sources while logged in at affected devices (CVE-2023-31238) All affected products: Restrict access to port 443/tcp to trusted IP addresses only As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-201498 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Siemens COMOS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-15",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens COMOS with COMOS Web deployed: Versions prior to 10.4.5 (CVE-2023-45133) Siemens COMOS that use COMOS Snapshots component: Versions prior to 10.4.5 (CVE-2024-0056)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: COMOS Vulnerabilities: Incomplete List of Disallowed Inputs, Cleartext Transmission of Sensitive Information",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to execute arbitrary code or lead to data infiltration.",
      "vulnerability_overview": "N/ABabel is a compiler for writing JavaScript. In @babel/traverse prior to versions 7.23.2 and 8.0.0-alpha.4 and all versions of babel-traverse, using Babel to compile code that was specifically crafted by an attacker can lead to arbitrary code execution during compilation, when using plugins that rely on the path.evaluate() or path.evaluateTruthy() internal Babel methods. Known affected plugins are @babel/plugin-transform-runtime; @babel/preset-env when using its useBuiltIns option; and any \"polyfill provider\" plugin that depends on @babel/helper-define-polyfill-provider, such as babel-plugin-polyfill-corejs3, babel-plugin-polyfill-corejs2, babel-plugin-polyfill-es-shims, babel-plugin-polyfill-regenerator. No other plugins under the @babel/ namespace are impacted, but third-party plugins might be. Users that only compile trusted code are not impacted. The vulnerability has been fixed in @babel/traverse@7.23.2 and @babel/traverse@8.0.0-alpha.4. Those who cannot upgrade @babel/traverse and are using one of the affected packages mentioned above should upgrade them to their latest version to avoid triggering the vulnerable code path in affected @babel/traverse versions: @babel/plugin-transform-runtime v7.23.2, @babel/preset-env v7.23.2, @babel/helper-define-polyfill-provider v0.4.3, babel-plugin-polyfill-corejs2 v0.4.6, babel-plugin-polyfill-corejs3 v0.8.5, babel-plugin-polyfill-es-shims v0.10.0, babel-plugin-polyfill-regenerator v0.5.3. CVE-2023-45133has been assigned to this vulnerability. A CVSS v3.1 base score of 9.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). Microsoft.Data.SqlClient and System.Data.SqlClient SQL Data Provider Security Feature Bypass Vulnerability CVE-2024-0056has been assigned to this vulnerability. A CVSS v3.1 base score of 8.7 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: COMOS: Update to V10.4.5 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-682326 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Siemens Software Center and Solid Edge",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-17",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/AThe following versions of Siemens Software Center and Solid Edge are affected: Siemens Software Center: All versions prior to 3.5 Solid Edge SE2025: All versions prior to V225.0 Update 10",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.5 ATTENTION: Low attack complexity Vendor: Siemens Equipment: Software Center and Solid Edge Vulnerability: Uncontrolled Search Path Element",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code via placing a crafted DLL file on the system.",
      "vulnerability_overview": "N/AThe affected application is vulnerable to DLL hijacking. This could allow an attacker to execute arbitrary code via placing a crafted DLL file on the system. CVE-2025-40827has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-40827. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Siemens Software Center: Update toV3.5 or later version Solid Edge SE2025: Update toV225.0 Update 10 or later version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information see the associated Siemens security advisory SSA-365596 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Siemens Altair Grid Engine",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-16",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/AThe following versions of Altair Grid Engine are affected: Altair Grid Engine: All versions prior to V2026.0.0",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.8 ATTENTION: Low attack complexity Vendor: Siemens Equipment: Altair Grid Engine Vulnerabilities: Generation of Error Message Containing Sensitive Information, Uncontrolled Search Path Element",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to escalate privileges and execute arbitrary code with superuser permissions.",
      "vulnerability_overview": "N/AAffected products do not properly handle error messages and disclose sensitive password hash information when processing user authentication requests. This could allow a local attacker to extract password hashes for privileged accounts, which can then be subjected to offline brute-force attacks. CVE-2025-40760has been assigned to this vulnerability. A CVSS v3.1 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N). Affected products do not properly validate environment variables when loading shared libraries, allowing path hijacking through malicious library substitution. This could allow a local attacker to execute arbitrary code with superuser privileges by manipulating the environment variable and placing a malicious library in the controlled path. CVE-2025-40763has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Update toV2026.0.0 or later version. CVE-2025-40760: For clusters not using the UGERest API/daemon remove the setuid-root bit from the binaries for all architectures: chmod u-s $SGE_ROOT/utilbin//authuser. CVE-2025-40763: For non Windows clusters remove the setuid-root bit from the \"sgepasswd\" binary for all installed architectures: chmod u-s $SGE_ROOT/bin//sgepasswd. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information see the associated Siemens security advisory SSA-514895 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "AVEVA Edge",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-03",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "AVEVA",
      "affected_products": "N/AThe following versions of AVEVA Edge (formerly InduSoft Web Studio), a HMI/SCADA software, are affected: Edge: Versions 2023 R2 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.3 ATTENTION: Low attack complexity Vendor: AVEVA Equipment: Edge Vulnerability: Use of a Broken or Risky Cryptographic Algorithm",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a local attacker to reverse engineer passwords through brute force.",
      "vulnerability_overview": "N/AThe vulnerability, if exploited, could allow a miscreant with read access to Edge Project files or Edge Offline Cache files to reverse engineer Edge users' app-native or Active Directory passwords through computational brute-forcing of weak hashes. CVE-2025-9317has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-9317. A base score of 8.3 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:H/SI:H/SA:N).",
      "mitigations": "N/AAVEVA recommends that organizations evaluate the impact of this vulnerability based on their operational environment, architecture, and product implementation. Users using the affected product versions should take the following actions to mitigate the risk of exploit: Apply AVEVA Edge2023 R2 P01Security Update and migrate old project files. For projects that cannot be migrated (e.g. backups or transient copies), evaluate the risk of potential password leakage from these files and implement stricter read access controls to protect these unsafe files. Require AVEVA Edge users to change their passwords. Important: Edge project migration from older versions to 2023 R2 P01 is one-way due to the change in password hashing algorithms. The following general defensive measures are recommended: Access Control Lists should be applied to all folders where users will save and load project files. Maintain a trusted chain-of-custody on project files during creation, modification, distribution, and use. Apply data-protection at the project level with a strong master password. For configuration step-by-step refer to AVEVA Edge \"Technical Reference Manual\" > Project Overview > Configuring Additional Project Settings > Options Tab > Data Protection. If passwords are being used as function parameters inside project documents (such as scripts or worksheets), it is recommended to remove those passwords and use project tags instead. For more information on tags refer to AVEVA Edge \"Technical Reference Manual\" > Tags and the Tag Database > About Tags and the Project Database. For information on how to reach AVEVA support for your product, please refer to this link:AVEVA Customer Support. For more information, see AVEVA's Security BulletinAVEVA-2025-006or AVEVA'sbulletins page. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "General Industrial Controls Lynx+ Gateway",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-08",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Lynx+ Gateway are affected: Lynx+ Gateway: Version R08 Lynx+ Gateway: Version V03 Lynx+ Gateway: Version V05 Lynx+ Gateway: Version V18",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.2 ATTENTION:Exploitable remotely/low attack complexity Vendor:General Industrial Controls Equipment:Lynx+ Gateway Vulnerabilities:Weak Password Requirements, Missing Authentication for Critical Function, Cleartext Transmission of Sensitive Information",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in obtaining sensitive device information, unauthorized access, or create a denial-of-service condition.",
      "vulnerability_overview": "N/AThe affected product is vulnerable to a weak password requirement vulnerability, which may allow an attacker to execute a brute-force attack resulting in unauthorized access and login. CVE-2025-55034has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N). A CVSS v4 score has also been calculated forCVE-2025-55034. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:L/VA:N/SC:N/SI:N/SA:N). The affected product is missing critical authentication in the embedded web server which could allow an attacker to remotely reset the device. CVE-2025-58083has been assigned to this vulnerability. A CVSS v3 base score of 10.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-58083. A base score of 9.2 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:H). The affected product is missing critical authentication in the embedded web server which could allow an attacker to send GET requests to obtain sensitive device information. CVE-2025-59780has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-59780. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). The affected product is vulnerable to a cleartext transmission vulnerability that could allow an attacker to observe network traffic to obtain sensitive information, including plaintext credentials. CVE-2025-62765has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-62765. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/AGeneral Industrial Controls (GIC) did not respond to CISA's attempts to coordinate. Users of General Industrial Controls Lynx+ Gateway are encouraged to reach out toGICfor more information. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation FactoryTalk DataMosaix Private Cloud",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-07",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of FactoryTalk DataMosaix Private Cloud are affected: FactoryTalk DataMosaix Private Cloud: Versions 7.11, 8.00, 8.01 (CVE-2025-11084) FactoryTalk DataMosaix Private Cloud: Versions 7.11, 8.00 (CVE-2025-11085)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: FactoryTalk DataMosaix Private Cloud Vulnerabilities: Weak Authentication, Improper Encoding or Escaping of Output",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to take over accounts, steal credentials, redirect users to a malicious website, or bypass MFA.",
      "vulnerability_overview": "N/AA security issue exists within DataMosaix™ Private Cloud, allowing attackers to bypass MFA during setup and obtain a valid login-token cookie without knowing the users password. This vulnerability occurs when MFA is enabled but not completed within a 7-day period. CVE-2025-11084has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-11084. A base score of 7.6 has been calculated; the CVSS vector string is (AV:A/AC:H/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N). A security issue exists within DataMosaix™ Private Cloud allowing for Persistent cross-site scripting. This vulnerability can result in the execution of malicious JavaScript, allowing for account takeover, credential theft, or redirection to a malicious website. CVE-2025-11085has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-11085. A base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation encourages users of the affected software to apply the following risk mitigations, if possible: For CVE-2025-11084: Update FactoryTalk DataMosaix Private Cloud to Version 8.02 For CVE-2025-11085: Update FactoryTalk DataMosaix Private Cloud to Version 8.01 Users using the affected software, who are not able to upgrade to one of the corrected versions, should use Rockwell Automation's bestsecurity practices. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA and Partners Release Advisory Update on Akira Ransomware",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/13/cisa-and-partners-release-advisory-update-akira-ransomware",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens Solid Edge",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-14",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens Solid Edge SE2025: All versions prior to V225.0 Update 11",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Solid Edge Vulnerability: Improper Certificate Validation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to perform man in the middle attacks.",
      "vulnerability_overview": "N/AAffected applications do not properly validate client certificates to connect to License Service endpoint. This could allow an unauthenticated remote attacker to perform man in the middle attacks. CVE-2025-40744has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-40744. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Solid Edge SE2025: Update to V225.0 Update 11 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-522291 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases 18 Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/13/cisa-releases-18-industrial-control-systems-advisories",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Rockwell Automation AADvance-Trusted SIS Workstation",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-10",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/ARockwell Automation reports the following versions of AADvance-Trusted SIS Workstation, a software suite for developing and managing safety instrumented system (SIS) applications, are affected: AADvance-Trusted SIS Workstation: Versions 2.00.00 to 2.00.04",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: AADvance-Trusted SIS Workstation Vulnerability: Path Traversal",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability may allow remote code execution.",
      "vulnerability_overview": "N/AA directory traversal vulnerability in DotNetZip v.1.16.0 and earlier may allow a remote attacker to execute arbitrary code via the src/Zip.Shared/ZipEntry.Extract.cs component. Exploitation requires the victim to open a malicious file. CVE-2024-48510has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-48510. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation reports this issue is corrected in software Version 2.01.00 and later. For more information about this issue, see the advisory on theRockwell Automation security page. Users of the affected software who are unable to upgrade to one of the corrected versions should followRockwell Automation security best practices. If you have any questions regarding the security issue above and how to mitigate it, contact TechConnect for assistance. More information can be found atContact Us | Rockwell Automation | US. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Brightpick Mission Control / Internal Logic Control",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-04",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Brightpick AI's warehouse automation platform, are affected: Brightpick Mission Control / Internal Logic Control: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Brightpick AI Equipment: Brightpick Mission Control / Internal Logic Control Vulnerabilities: Missing Authentication for Critical Function, Unprotected Transport of Credentials",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in the exposure of sensitive information and the manipulation of critical functions by an attacker.",
      "vulnerability_overview": "N/AThe Brightpick Internal Logic Control web interface is accessible without requiring user authentication. An unauthorized user could exploit this interface to manipulate robot control functions, including initiating or halting runners, assigning jobs, clearing stations, and deploying storage totes. CVE-2025-64307has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-64307. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N). The Brightpick Mission Control web application exposes hardcoded credentials in its client-side JavaScript bundle. CVE-2025-64308has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-64308. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). The affected product discloses device telemetry, configuration, and credential information via WebSocket traffic to unauthenticated users when they connect to a specific URL. The unauthenticated URL can be discovered through basic network scanning techniques. CVE-2025-64309has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-64309. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:N/VA:N/SC:L/SI:N/SA:N).",
      "mitigations": "N/ABrightpick AI has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of the affected products are encouraged to contactBrightpick AIfor additional information. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation Verve Asset Manager",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-05",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Verve Asset Manager, an OT cybersecurity platform, are affected: Verve Asset Manager: Version 1.33 Verve Asset Manager: Version 1.34 Verve Asset Manager: Version 1.35 Verve Asset Manager: Version 1.36 Verve Asset Manager: Version 1.37 Verve Asset Manager: Version 1.38 Verve Asset Manager: Version 1.39 Verve Asset Manager: Version 1.40 Verve Asset Manager: Version 1.41 Verve Asset Manager: Version 1.41.1 Verve Asset Manager: Version 1.41.2 Verve Asset Manager: Version 1.41.3",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.4 ATTENTION:Exploitable remotely/low attack complexity Vendor:Rockwell Automation Equipment:Verve Asset Manager Vulnerability:Incorrect Authorization",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in an attacker accessing or altering user data.",
      "vulnerability_overview": "N/AA security issue was discovered within Verve Asset Manager allowing unauthorized read-only users to read, update, and delete users via the API. CVE-2025-11862has been assigned to this vulnerability. A CVSS v3 base score of 9.9 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-11862. A base score of 8.4 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:L/VI:H/VA:H/SC:N/SI:L/SA:H).",
      "mitigations": "N/ARockwell Automation has addressed this issue in version 1.41.4 and 1.42. Rockwell Automation encourages users to update to the newest available version. For more information about this issue, see the advisory on theRockwell Automation security page. Users with additional questions can contact Rockwell AutomationTechConnect for help. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation FactoryTalk Policy Manager",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-09",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/ARockwell Automation reports that the following versions of FactoryTalk Policy Manager, a software tool that enables OT teams to design, deploy, and manage system-wide security policies using CIP Security and OPC UA standards, are affected: FactoryTalk Policy Manager: Versions 6.51.00 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: FactoryTalk Policy Manager Vulnerability: Improper Resource Shutdown or Release",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could lead to resource exhaustion and denial of service.",
      "vulnerability_overview": "N/AA vulnerability in Node.js HTTP servers may allow an attacker to send a specially crafted HTTP request with chunked encoding, which can lead to resource exhaustion and denial of service. The server reads an unbounded number of bytes from a single connection, exploiting the lack of limitations on chunk extension bytes. This issue can cause CPU and network bandwidth exhaustion, bypassing standard safeguards like timeouts and body size limits. CVE-2024-22019has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2024-22019. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation reports this issue is corrected in softwareVersion 6.60.00 and later. For more information about this issue, see the advisory on theRockwell Automation security page. Users of the affected software who are unable to upgrade to one of the corrected versions should followRockwell Automation security best practices. If you have any questions regarding the security issue above and how to mitigate it, contact TechConnect for assistance. More information can be found atContact Us | Rockwell Automation | US. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation Studio 5000 Simulation Interface",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-06",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Rockwell Automation Studio 5000 Simulation Interface are affected: Studio 5000 Simulation Interface: Version 2.02 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Low attack complexity Vendor: Rockwell Automation Equipment: Studio 5000 Simulation Interface Vulnerabilities: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal'), Server-Side Request Forgery (SSRF)",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow attackers to trigger outbound SMB requests to capture NTLM hashes and execute scripts with Administrator privileges upon system reboot.",
      "vulnerability_overview": "N/AA local code execution security issue exists within Studio 5000 Simulation Interface via the API. This vulnerability allows any Windows user on the system to extract files using path traversal sequences, resulting in execution of scripts with Administrator privileges on system reboot. CVE-2025-11696has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-11696. A base score of 9.3 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H). A local server-side request forgery (SSRF) security issue exists within Studio 5000 Simulation Interface via the API. This vulnerability allows any Windows user on the system to trigger outbound SMB requests, enabling the capture of NTLM hashes. CVE-2025-11697has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-11697. A base score of 8.8 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:P/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H).",
      "mitigations": "N/ARockwell Automation recommends that users upgrade to version 3.0.0 or later. Users who are unable to upgrade to the corrected version are encouraged to follow Rockwell Automation'ssecurity best practices. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "AVEVA Application Server IDE",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-02",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "AVEVA",
      "affected_products": "N/AThe following versions of AVEVA Application Server are affected: Application Server: Versions 2023 R2 SP1 P02 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.2 ATTENTION: Low attack complexity Vendor: AVEVA Equipment: Application Server IDE Vulnerability: Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to tamper with help files and inject cross-site scripting (XSS) code.",
      "vulnerability_overview": "N/AThe vulnerability, if exploited, could allow an authenticated miscreant (with privilege of \"aaConfigTools\") to tamper with App Objects' help files and persist a cross-site scripting (XSS) injection that when executed by a victim user, can result in horizontal or vertical escalation of privileges. The vulnerability can only be exploited during config-time operations within the IDE component of Application Server. Run-time components and operations are not affected. CVE-2025-8386has been assigned to this vulnerability. A CVSS v3.1 base score of 6.9 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:C/C:H/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-8386. A base score of 7.2 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:H/UI:P/VC:H/VI:L/VA:L/SC:H/SI:H/SA:H).",
      "mitigations": "N/AAVEVA recommends that organizations evaluate the impact of these vulnerabilities based on their operational environment, architecture, and product implementation. Users using affected product versions should apply security updates to mitigate the risk of exploit. All affected versions of the Application Server IDE can be fixed by upgrading to AVEVA System Platform2023 R2 SP1 P03or higher. The following general defensive measures are recommended: Audit assigned permissions to ensure that only trusted users are added to the \"aaConfigTools\" OS Group. For additional information on Application Server OS Security groups and accounts, seehttps://docs.aveva.com/bundle/sp-install/page/738031.html For more information, see AVEVA's Security BulletinAVEVA-2025-005or AVEVA'sbulletins page. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Siemens Spectrum Power 4",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-317-12",
      "published": "Thu, 13 Nov 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Spectrum Power 4: Versions prior to V4.70 SP12 Update 2",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Spectrum Power 4 Vulnerabilities: Incorrect Use of Privileged APIs, Incorrect Privilege Assignment, Incorrect Permission Assignment for Critical Resource, Inclusion of Functionality from Untrusted Control Sphere",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to remotely execute code as application administrator or locally execute code as operating system administrator.",
      "vulnerability_overview": "N/AThe affected application is vulnerable to a local privilege escalation due to an exposed debug interface on the localhost. This allows any local user to gain code execution as administrative application user. CVE-2024-32008has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-32008. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The affected application is vulnerable to a local privilege escalation due to wrongly set permissions to a binary which allows any local attacker to gain administrative privileges. CVE-2024-32009has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-32009. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The affected application is vulnerable to extraction of database credentials via a world-readable credential file. This allows an attacker to connect to the database as privileged application user and to run system commands via the database. CVE-2024-32010has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-32010. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The affected application is vulnerable to run arbitrary commands via the user interface. This user interface can be used via the network and allows the execution of commands as administrative application user. CVE-2024-32011has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-32011. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The affected application is vulnerable to alter the local database which contains the application credentials. This allows an attacker to gain administrative application privileges. CVE-2024-32014has been assigned to this vulnerability. A CVSS v3.1 base score of 4.7 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2024-32014. A base score of 5.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:H/AT:N/PR:N/UI:A/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Spectrum Power 4: Update to V4.70 SP12 Update 2 or later version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-339694 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Adds Three Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/12/cisa-adds-three-known-exploited-vulnerabilities-catalog",
      "published": "Wed, 12 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Update: Implementation Guidance for Emergency Directive on Cisco ASA and Firepower Device Vulnerabilities",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/12/update-implementation-guidance-emergency-directive-cisco-asa-and-firepower-device-vulnerabilities",
      "published": "Wed, 12 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/10/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Mon, 10 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Ubia Ubox",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-310-02",
      "published": "Thu, 06 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following product version is reported to be affected: Ubox: v1.1.124",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.1 ATTENTION: Exploitable remotely/low attack complexity Vendor: Ubia Equipment: Ubox Vulnerability: Insufficiently Protected Credentials",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to remotely view camera feeds or modify settings.",
      "vulnerability_overview": "N/AThe Ubia camera ecosystem fails to adequately secure API credentials, potentially enabling an attacker to connect to backend services. The attacker would then be able to gain unauthorized access to available cameras, enabling the viewing of live feeds or modification of settings. CVE-2025-12636has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-12636. A base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/AUbia did not respond to CISA's attempts to coordinate. Users of Ubia Cameras are encouraged to reach out out toUbiafor more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "ABB FLXeon Controllers",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-310-03",
      "published": "Thu, 06 Nov 25 12:00:00 +0000",
      "vendor": "ABB",
      "affected_products": "N/AThe following ABB FLXeon products are affected: FBXi-8R8-X96 (2CQG201028R1011): Versions 9.3.5 and prior FBXi-8R8-H-X96 (2CQG201029R1011): Versions 9.3.5 and prior FBXi-X256 (2CQG201014R1021): Versions 9.3.5 and prior FBXi-X48 (2CQG201018R1021): Versions 9.3.5 and prior FBXi-8R8-X96-S (2CQG201606R1011): Versions 9.3.5 and prior FBVi-2U4-4T (2CQG201015R1021 ): Versions 9.3.5 and prior FBVi-2U4-4T-IMP (2CQG201016R1021): Versions 9.3.5 and prior FBVi-2U4-4T-SI: Versions 9.3.5 and prior FBTi-7T7-1U1R (2CQG201022R1011): Versions 9.3.5 and prior FBTi-6T1-1U1R (2CQG201022R1011): Versions 9.3.5 and prior CBXi-8R8 (2CQG201001R1021): Versions 9.3.5 and prior CBXi-8R8-H (2CQG201001R1021): Versions 9.3.5 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: ABB Equipment: FBXi, FBVi, FBTi, CBXi Vulnerabilities: Use of Hard-coded Credentials, Improper Validation of Specified Type of Input, Use of a One-Way Hash without a Salt",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to take remote control of the product, insert and run arbitrary code, and crash the device being accessed.",
      "vulnerability_overview": "N/ACredentials that are required for the functioning of the product cannot be stored in a HW supported secure storage as the product does not implement such a component. CVE-2024-48842has been assigned to this vulnerability. A CVSS v3.1 base score of 7.0 has been calculated; the CVSS vector string is (AV:P/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-48842. A base score of 7.3 has been calculated; the CVSS vector string is (AV:P/AC:H/AT:P/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H). A remote code execution is possible due to an improper input validation. CVE-2024-48851has been assigned to this vulnerability. A CVSS v3.1 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-48851. A base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:P/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Password hashes are stored using a vulnerable MD5 algorithm with low entropy on salt, stored in plain text on unencrypted partitions. CVE-2025-10205has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-10205. A base score of 8.7 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Users can push files with full pathnames allowing file operations in off limits directories. CVE-2025-10207has been assigned to this vulnerability. A CVSS v3.1 base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-10207. A base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:P/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AABB recommends users do the following actions on any released SW version of FLXeon: Stop and disconnect any FLXeon products that are exposed directly to the Internet, either via a direct ISP connection or via NAT port forwarding. Ensure that physical controls are in place, so no unauthorized personnel can access your devices, components, peripheral equipment, and networks. Ensure that all FLXeon products are upgraded to the latest firmware version. The latest version of FLXeon firmware can be found on the respective product homepage. When remote access is required, only use secure methods. If a Virtual Private Network (VPN) is used, ensure that the chosen VPN is secure i.e. updated to the most current version available and configured for secure access. For more information refer to ABB's Cybersecurity Advisory9AKK108471A7121. The ABB advisory includes a detailed mapping of applicable mitigations for each listed vulnerability. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Locate control system networks and remote devices behind firewalls and isolating them from business networks. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Advantech DeviceOn/iEdge",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-310-01",
      "published": "Thu, 06 Nov 25 12:00:00 +0000",
      "vendor": "Advantech",
      "affected_products": "N/AThe following version of DeviceOn/iEdge, an IoT management platform, is affected: DeviceOn/iEdge: Version 2.0.2 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Advantech Equipment:DeviceOn/iEdge Vulnerabilities:Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in a denial-of-service condition, remote code execution, or an attacker reading arbitrary files.",
      "vulnerability_overview": "N/AInsufficient input sanitization in the dashboard label or path can allow an attacker to trigger a device error causing information disclosure or data manipulation. CVE-2025-64302has been assigned to this vulnerability. A CVSS v3 base score of 6.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N). A CVSS v4 score has also been calculated forCVE-2025-64302. A base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:L/SC:N/SI:N/SA:L). Due to insufficient sanitization, an attacker can upload a specially crafted configuration file to traverse directories and achieve remote code execution with system-level permissions. CVE-2025-62630has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-62630. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). A vulnerability in a device dependency allows an unauthenticated attacker to read arbitrary files or bypass authentication. CVE-2025-59171has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-59171. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). Due to insufficient sanitization, an attacker can upload a specially crafted configuration file to cause a denial-of-service condition, traverse directories, or read/write files, within the context of the local system account. CVE-2025-58423has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-58423. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AAdvantech has stated that the listed products are end-of-life, and recommends all users upgrade their devices to DeviceOn, which is not vulnerable to these vulnerabilities. For further questions or upgrade assistance, users shouldcontact Advantech. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Four Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/06/cisa-releases-four-industrial-control-systems-advisories",
      "published": "Thu, 06 Nov 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "IDIS ICM Viewer",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-308-05",
      "published": "Tue, 04 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following version of ICM Viewer is affected: ICM Viewer: Version v1.6.0.10",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION:Exploitable remotely/low attack complexity Vendor:IDIS Equipment:ICM Viewer Vulnerability:Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in an attacker executing arbitrary code.",
      "vulnerability_overview": "N/AAn argument injection vulnerability exists in the affected product that could allow an attacker to execute arbitrary code within the context of the host machine. CVE-2025-12556has been assigned to this vulnerability. A CVSS v3 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-12556. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AIDIS recommends users to follow these guidelines: For users who continue to use the ICM Viewer:You must accesshttps://icm.idisglobal.comand follow the instructions provided to upgrade to version v1.7.1. IDIS requires all users to upgrade to v1.7.1. Failure to do so will render the ICM Viewer unusable. You must accesshttps://icm.idisglobal.comand follow the instructions provided to upgrade to version v1.7.1. IDIS requires all users to upgrade to v1.7.1. Failure to do so will render the ICM Viewer unusable. For users who do not use the ICM Viewer:You must immediately uninstall the program from your system. You must immediately uninstall the program from your system. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Survision License Plate Recognition Camera",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-308-02",
      "published": "Tue, 04 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Survision LPR Camera are affected: License Plate Recognition LPR Camera: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Survision Equipment: License Plate Recognition (LPR) Camera Vulnerability: Missing Authentication for Critical Function",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to fully access the system without requiring authentication.",
      "vulnerability_overview": "N/AThe Survision LPR Camera system does not enforce password protection by default. This allows access to the configuration wizard immediately without a login prompt or credentials check. CVE-2025-12108has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-12108. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASurvision has released the following versions for users to update to: License Plate Recognition LPR Camera: Firmware version v3.5 Survision recommends users to enable the configuration password authentication by defining users and roles with minimal rights in the user management system and, where possible, enforce client certificate authentication. For future deployments, plan for integration of the new login/password mechanism and update your installation procedures accordingly. On previous versions (inferior to 3.5) Survision recommends activating the \"lock\" password in the security parameters and, where possible, enforce client certificate authentication. For more information, contactSurvision. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/11/04/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "published": "Tue, 04 Nov 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    }
  ]
}