{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-10-08T05:17:27.630349Z",
  "items": [
    {
      "title": "Delta Electronics DIAScreen",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-280-01",
      "published": "Tue, 07 Oct 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/AThe following versions of Delta Electronics DIAScreen are affected: DIAScreen: Version 1.6.0 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.8 ATTENTION: Low attack complexity Vendor: Delta Electronics Equipment: DIAScreen Vulnerabilities: Out-of-bounds Write",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to write data outside of the allocated memory buffer.",
      "vulnerability_overview": "N/ADelta Electronics DIAScreen can write data outside of the intended memory buffer when a valid user opens a maliciously crafted project file. CVE-2025-59297has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-59297. A base score of 6.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). Delta Electronics DIAScreen can write data outside of the intended memory buffer when a valid user opens a maliciously crafted project file. CVE-2025-59298has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-59298. A base score of 6.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). Delta Electronics DIAScreen can write data outside of the intended memory buffer when a valid user opens a maliciously crafted project file. CVE-2025-59299has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-59299. A base score of 6.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). Delta Electronics DIAScreen can write data outside of the intended memory buffer when a valid user opens a maliciously crafted project file. CVE-2025-59300has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-59300. A base score of 6.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADelta Electronics has releasedv1.6.1 of DIAScreenand recommends users install this update on all affected systems. For more information, seeDelta Electronics' advisory Delta-PCSA-2025-00018. CISA recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "CISA Releases Two Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/10/07/cisa-releases-two-industrial-control-systems-advisories",
      "published": "Tue, 07 Oct 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/10/07/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Tue, 07 Oct 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Seven Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/10/06/cisa-adds-seven-known-exploited-vulnerabilities-catalog",
      "published": "Mon, 06 Oct 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Five Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/10/02/cisa-adds-five-known-exploited-vulnerabilities-catalog",
      "published": "Thu, 02 Oct 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Releases Two Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/10/02/cisa-releases-two-industrial-control-systems-advisories",
      "published": "Thu, 02 Oct 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Raise3D Pro2 Series 3D Printers",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-275-01",
      "published": "Thu, 02 Oct 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following firmware versions of the Rasie3D Pro2 Series printers are affected: Pro2 Series: All Versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION:Exploitable remotely/low attack complexity Vendor:Raise3D Equipment:Pro2 Series Vulnerability:Authentication Bypass Using an Alternate Path or Channel",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in data exfiltration and compromise of the target device.",
      "vulnerability_overview": "N/AAn unauthenticated debug port may allow access to the device file system. CVE-2025-10653has been assigned to this vulnerability. A CVSS v3 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-10653. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARaise3D confirmed this vulnerability exists in the Pro2 Series devices when developer mode is enabled. Raise3D is developing a patched version of the printer firmware; however, no release date has yet been provided. Raise3D recommends disabling developer mode if it is not required. Further information is available from Raise3D at theRaise3D Support Center CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Hitachi Energy MSM Product",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-275-02",
      "published": "Thu, 02 Oct 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/AHitachi Energy reports that the following products are affected: MSM: Versions 2.2.10 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.5 ATTENTION: Exploitable remotely/low attack complexity Vendor: Hitachi Energy Equipment: MSM Product Vulnerabilities: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting'), Reachable Assertion",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow HTML injection via the name parameter or an assertion failure in fuzz_binary_decode, resulting in a crash.",
      "vulnerability_overview": "N/Agoform/formTest in EmbedThis GoAhead 2.5 allows HTML injection via the name parameter. CVE-2023-53155has been assigned to this vulnerability. A CVSS v3.1 base score of 7.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:L/A:N). Open62541 v1.4.6 has an assertion failure in fuzz_binary_decode, which leads to a crash. CVE-2024-53429has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "mitigations": "N/AHitachi Energy recommends the following general mitigation factors: MSM is not intrinsically designed and intended to be directly connected to the internet. Disconnect the device from any internet-facing network. Hitachi Energy suggests adopting user access management and any state-of-the-art antivirus protection engines equipped with the latest signature rules on the computers that have installed and are operating the MSM Client application. As an example, use the operating system (OS) built-in user access management functionality, if supported, to limit the probability of unauthorized access followed by rogue commands via the MSM Client application. Hitachi Energy also recommends following the hardening guidelines published by\"The Center for Internet Security (CIS)\"to protect the host operating system of computers connected with MSM. This measure can help prevent the lateral movement of the attack vector into MSM via these connected devices. Some examples for Windows-based computers are listed below. CIS Microsoft Windows Desktop Benchmarks CIS Microsoft Windows Server Benchmarks Also follow the cybersecurity deployment recommendations as documented in section 3.9 of2GHV045871_2018-P-en-Modular Switchgear Monitoring (MSM) - C. Additionally, Hitachi Energy recommends hardening web browsers in accordance withCIS Critical Security Control 9: Email and Web Browser Protections. Recommended security practices and firewall configurations can help protect a process control network from attacks that originate from outside the network. Such practices include ensuring that process control systems are physically protected from direct access by unauthorized personnel, have no direct connections to the internet, and are separated from other networks by means of a firewall system that has a minimal number of ports exposed, and others that have to be evaluated case by case. Process control systems should not be used for internet surfing, instant messaging, or receiving e-mails. Portable computers and removable storage media should be carefully scanned for viruses before they are connected to a control system. Proper password policies and processes should be followed. For more information, see the associated Hitachi Energy security advisory8DBD000228 Open-Source Software Vulnerabilities in Hitachi Energy MSM Product. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Festo SBRD-Q/SBOC-Q/SBOI-Q",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-02",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/AFesto reports that the following products are affected: Festo Firmware installed on Festo Hardware SBOC-Q-R1B: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R1B-S1: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R1C: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R1C-S1: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R2B: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R2B-S1: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R2C: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R3B-WB: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R3B-WB-S1: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R3C-WB: All versions Festo Firmware installed on Festo Hardware SBOC-Q-R3C-WB-S1: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R1B: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R1B-S1: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R1C: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R1C-S1: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R3B-WB: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R3B-WB-S1: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R3C-WB: All versions Festo Firmware installed on Festo Hardware SBOI-Q-R3C-WB-S1: All versions Festo Firmware installed on Festo Hardware SBRD-Q: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 8.2 ATTENTION: Exploitable remotely/low attack complexity Vendor: Festo Equipment: SBRD-Q/SBOC-Q/SBOI-Q Vulnerabilities: Incorrect Conversion between Numeric Types, Out-of-bounds Read, Reachable Assertion",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities may allow the attacker to read arbitrary data or cause a denial-of-service condition.",
      "vulnerability_overview": "N/AA specifically-crafted packet sent by an attacker to EIPStackGroup OpENer EtherNet/IP commits and versions prior to February 10, 2021, may cause a denial-of-service condition. CVE-2021-27478has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H). A specifically-crafted packet sent by an attacker to EIPStackGroup OpENer EtherNet/IP commits and versions prior to February 10, 2021, may allow an attacker to read arbitrary data. CVE-2021-27482has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A specifically-crafted packet sent by an attacker to EIPStackGroup OpENer EtherNet/IP commits and versions prior to February 10, 2021, may result in a denial-of-service condition. CVE-2021-27500has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A specifically-crafted packet sent by an attacker to EIPStackGroup OpENer EtherNet/IP commits and versions prior to February 10, 2021, may result in a denial-of-service condition. CVE-2021-27498has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "mitigations": "N/AFesto has identified the following specific mitigations and remediations users can apply to reduce risk: Minimize network exposure for all control system devices and/or systems and ensure that they are not accessible from the Internet. Deactivate EtherNet/IP in device settings if not used. There is no fix planned. For more information, see the associated Festo security advisory FSA-202101FSA-202101: Festo: Multiple vulnerabilities in Ethernet/IP Stack of SBRD-Q/SBOC-Q/SBOI-Q - HTML,FSA-202101: Festo: Multiple vulnerabilities in Ethernet/IP Stack of SBRD-Q/SBOC-Q/SBOI-Q - CSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "LG Innotek Camera Multiple Models",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-07",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following models of LG Innotek CCTV Cameras are affected: LG LND7210: All Versions LG LNV7210R: All Versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION: Exploitable remotely/Low attack complexity Vendor: LG Innotek Equipment: Camera Models LND7210 and LNV7210R Vulnerability: Authentication Bypass Using an Alternate Path or Channel",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to gain administrative access to the device.",
      "vulnerability_overview": "N/AAn authentication bypass vulnerability exists in LG Innotek camera models LND7210 and LNV7210R. The vulnerability allows a malicious actor to gain access to camera information including user account information. CVE-2025-10538has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-10538. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ALG Innotek is aware of the vulnerability but has noted this is an end-of-life product that can no longer be patched. Visit theLG Security Centerfor further guidance. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "National Instruments Circuit Design Suite",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-06",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "National Instruments",
      "affected_products": "N/AThe following National Instruments products are affected: Circuit Design Suite: Versions v14.3.1 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.4 ATTENTION: Low attack complexity Vendor: National Instruments Equipment: Circuit Design Suite Vulnerabilities: Type Confusion, Out-of-bounds Read",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to cause memory corruption, potentially leading to information disclosure and execution of arbitrary code.",
      "vulnerability_overview": "N/AThe affected product is vulnerable to a memory corruption of a function table, which could allow an attacker to disclose information or execute arbitrary code. CVE-2025-6033has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-6033. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The affected product is vulnerable to an out-of-bounds read, which may allow an attacker to execute arbitrary code. CVE-2025-6034has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-6034. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ANational Instruments recommends users update to version 14.3.2 or later from NI Package Manager orSoftware Downloads. For more information, refer to the National Instruments security pages for each vulnerability: CVE-2025-6033 CVE-2025-6034 See theNational Instruments security updatepage for additional information. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "CISA Releases Ten Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/30/cisa-releases-ten-industrial-control-systems-advisories",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "MegaSys Enterprises Telenium Online Web Application",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-01",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following MegaSys Enerprises products are affected: Telenium Online Web Application: Versions 8.4.21 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Megasys Enterprises Equipment: Telenium Online Web Application Vulnerability: OS Command Injection",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an unauthenticated attacker to inject arbitrary operating system commands through a crafted HTTP request, leading to remote code execution on the server in the security context of the web application service account.",
      "vulnerability_overview": "N/AThe Telenium Online Web Application is vulnerable due to a PHP endpoint accessible to unauthenticated network users that improperly handles user-supplied input. This vulnerability occurs due to the insecure termination of a regular expression check within the endpoint. Because the input is not correctly validated or sanitized, an unauthenticated attacker can inject arbitrary operating system commands through a crafted HTTP request, leading to remote code execution on the server in the context of the web application service account. CVE-2025-10659has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-10659. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AMegasys Enterprises has provided a fix for this vulnerability. Users should access theMegasys support pageto get instructions on applying the fix. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Festo Controller CECC-S,-LK,-D Family Firmware",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-04",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/AFesto reports that the following products are affected: Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-D (All versions): All versions Festo Firmware (R06 (11.10.2016) = 2.3.8.1) installed on Festo Hardware Controller CECC-LK (All versions): All versions Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-S (All versions): All versions Festo Firmware (R06 (11.10.2016) = 2.3.8.1) installed on Festo Hardware Controller CECC-LK (All versions): All versions Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-S (All versions): All versions Festo Firmware (R06 (11.10.2016) = 2.3.8.1) installed on Festo Hardware Controller CECC-S (All versions): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 9.8 ATTENTION: Exploitable remotely/low attack complexity Vendor: Festo Equipment: Controller CECC-S,-LK,-D Family Firmware Vulnerabilities: Exposure of Resource to Wrong Sphere, Untrusted Pointer Dereference, NULL Pointer Dereference, Files or Directories Accessible to External Parties, Out-of-bounds Write, Improper Privilege Management, Incorrect Permission Assignment for Critical Resource, Buffer Copy without Checking Size of Input ('Classic Buffer Overflow'), Missing Release of Memory after Effective Lifetime, Improper Handling of Exceptional Conditions, Use of a Broken or Risky Cryptographic Algorithm, Weak Password Recovery Mechanism for Forgotten Password, Use of Password Hash With Insufficient Computational Effort, Improper Access Control, Allocation of Resources Without Limits or Throttling, Improper Input Validation, Buffer Over-read, Use of Insufficiently Random Values, Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal'), Uncontrolled Recursion, Missing Encryption of Sensitive Data, Improper Restriction of Operations within the Bounds of a Memory Buffer",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to crash services, escalate privileges, bypass authentication, or gain unauthorized access to sensitive systems and data.",
      "vulnerability_overview": "N/AA remote, authenticated attacker could utilize the control program of the CODESYS Control runtime system to use the vulnerability in order to read and modify the configuration file(s) of the affected products. CVE-2022-22515has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N). An authenticated, remote attacker can gain access to a dereferenced pointer contained in a request. The accesses can subsequently lead to local overwriting of memory in the CmpTraceMgr, whereby the attacker can neither gain the values read internally nor control the values to be written. If invalid memory is accessed, this results in a crash. CVE-2022-22514has been assigned to this vulnerability. A CVSS v3.1 base score of 7.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:H). An authenticated remote attacker can cause a null pointer dereference in the CmpSettings component of the affected CODESYS products which leads to a crash. CVE-2022-22513has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). In CODESYS V3 web server before 3.5.17.10, files or directories are accessible to External Parties. CVE-2021-36763has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). CODESYS Control Runtime system before 3.5.17.10 has a Heap-based Buffer Overflow. CVE-2021-33485has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). CODESYS V3 web server before 3.5.15.40, as used in CODESYS Control runtime systems, has a buffer overflow. CVE-2020-10245has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). An issue was discovered in 3S-Smart CODESYS V3 through 3.5.12.30. A user with low privileges can take full control over the runtime. CVE-2019-9008has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). CODESYS 3 web server before 3.5.15.20, as distributed with CODESYS Control runtime systems, has a Buffer Overflow. CVE-2019-18858has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). CODESYS V3 web server, all versions prior to 3.5.14.10, allows an attacker to send specially crafted http or https requests which could cause a stack overflow and create a denial-of-service condition or allow remote code execution. CVE-2019-13548has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). 3S-Smart Software Solutions GmbH CODESYS V3 OPC UA Server, all versions 3.5.11.0 to 3.5.15.0, allows an attacker to send crafted requests from a trusted OPC UA client that cause a NULL pointer dereference, which may trigger a denial-of-service condition. CVE-2019-13542has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). CODESYS Control runtime system before 3.5.16.10 allows Uncontrolled Memory Allocation. CVE-2020-15806has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). An issue was discovered in 3S-Smart CODESYS before 3.5.15.0 . Crafted network packets cause the Control Runtime to crash. CVE-2019-9009has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). In Pilz PMC programming tool 3.x before 3.5.17 (based on CODESYS Development System), an attacker can identify valid usernames. CVE-2019-9011has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). An issue was discovered in 3S-Smart CODESYS V3 products. The application may utilize non-TLS based encryption, which results in user credentials being insufficiently protected during transport. All variants of the following CODESYS V3 products in all versions containing the CmpUserMgr component are affected regardless of the CPU type or operating system: CODESYS Control for BeagleBone, CODESYS Control for emPC-A/iMX6, CODESYS Control for IOT2000, CODESYS Control for Linux, CODESYS Control for PFC100, CODESYS Control for PFC200, CODESYS Control for Raspberry Pi, CODESYS Control RTE V3, CODESYS Control RTE V3 (for Beckhoff CX), CODESYS Control Win V3 (also part of the CODESYS Development System setup), CODESYS V3 Simulation Runtime (part of the CODESYS Development System), CODESYS Control V3 Runtime System Toolkit, CODESYS HMI V3. CVE-2019-9013has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). In Pilz PMC programming tool 3.x before 3.5.17 (based on CODESYS Development System), a user's password may be changed by an attacker without knowledge of the current password. CVE-2020-12067has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). In CODESYS V3 products in all versions prior V3.5.16.0 containing the CmpUserMgr, the CODESYS Control runtime system stores the online communication passwords using a weak hashing algorithm. This can be used by a local attacker with low privileges to gain full control of the device. CVE-2020-12069has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). In CODESYS Gateway V3 before 3.5.17.10, there is a NULL Pointer Dereference. Crafted communication requests may cause a Null pointer dereference in the affected CODESYS products and may result in a denial-of-service condition. CVE-2021-36764has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). An issue was discovered in 3S-Smart CODESYS V3 products. A crafted communication request may cause uncontrolled memory allocations in the affected CODESYS products and may result in a denial-of-service condition. All variants of the following CODESYS V3 products in all versions prior to v3.5.14.20 that contain the CmpGateway component are affected, regardless of the CPU type or operating system: CODESYS Control for BeagleBone, CODESYS Control for emPC-A/iMX6, CODESYS Control for IOT2000, CODESYS Control for Linux, CODESYS Control for PFC100, CODESYS Control for PFC200, CODESYS Control for Raspberry Pi, CODESYS Control V3 Runtime System Toolkit, CODESYS Gateway V3, CODESYS V3 Development System. CVE-2019-9012has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). CODESYS Control V3, Gateway V3, and HMI V3 before 3.5.15.30 allow uncontrolled memory allocation which can result in a remote denial of service condition. CVE-2020-7052has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). An exploitable memory corruption vulnerability exists in the Name Service Client functionality of 3S-Smart Software Solutions CODESYS GatewayService. A specially crafted packet can cause a large memcpy, resulting in an access violation and termination of the process. An attacker can send a packet to a device running the GatewayService.exe to trigger this vulnerability. All variants of the CODESYS V3 products in all versions prior V3.5.16.10 containing the CmpRouter or CmpRouterEmbedded component are affected, regardless of the CPU type or operating system: CODESYS Control for BeagleBone, CODESYS Control for emPC-A/iMX6, CODESYS Control for IOT2000, CODESYS Control for Linux, CODESYS Control for PLCnext, CODESYS Control for PFC100, CODESYS Control for PFC200, CODESYS Control for Raspberry Pi, CODESYS Control RTE V3, CODESYS Control RTE V3 (for Beckhoff CX), CODESYS Control Win V3 (also part of the CODESYS Development System setup), CODESYS Control V3 Runtime System Toolkit, CODESYS V3 Embedded Target Visu Toolkit, CODESYS V3 Remote Target Visu Toolkit, CODESYS V3 Safety SIL2, CODESYS Edge Gateway V3, CODESYS Gateway V3, CODESYS HMI V3, CODESYS OPC Server V3, CODESYS PLCHandler SDK, CODESYS V3 Simulation Runtime (part of the CODESYS Development System). CVE-2019-5105has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). CODESYS Gateway 3 before 3.5.16.70 has a NULL pointer dereference that may result in a denial of service (DoS). CVE-2021-29241has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). CODESYS Control Runtime system before 3.5.17.0 has improper input validation. Attackers can send crafted communication packets to change the router's addressing scheme and may re-route, add, remove or change low level communication packages. CVE-2021-29242has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). A remote, unauthenticated attacker can send a specific crafted HTTP or HTTPS requests causing a buffer over-read resulting in a crash of the webserver of the CODESYS Control runtime system. CVE-2022-22519has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). An unauthenticated, remote attacker can disrupt existing communication channels between CODESYS products by guessing a valid channel ID and injecting packets. This results in the communication channel to be closed. CVE-2022-22517has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). CODESYS V3 web server, all versions prior to 3.5.14.10, allows an attacker to send specially crafted http or https requests which may allow access to files outside the restricted working directory of the controller. CVE-2019-13532has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). Use of Insufficiently Random Values exists in CODESYS V3 products versions prior V3.5.14.0. CVE-2018-20025has been assigned to this vulnerability. A CVSS v3.0 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). Constructed ASN.1 types with a recursive definition (such as can be found in PKCS7) could eventually exceed the stack given malicious input with excessive recursion. This could result in a Denial Of Service attack. There are no such structures used within SSL/TLS that come from untrusted sources so this is considered safe. Fixed in OpenSSL 1.1.0h (Affected 1.1.0-1.1.0g). Fixed in OpenSSL 1.0.2o (Affected 1.0.2b-1.0.2n). CVE-2018-0739has been assigned to this vulnerability. A CVSS v3.0 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H). In 3S-Smart Software Solutions GmbH CODESYS Control V3 products prior to version 3.5.14.0, user access management and communication encryption is not enabled by default, which could allow an attacker access to the device and sensitive information, including user credentials. CVE-2018-10612has been assigned to this vulnerability. A CVSS v3.0 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). While parsing an IPAddressFamily extension in an X.509 certificate, it is possible to do a one-byte overread. This would result in an incorrect text display of the certificate. This bug has been present since 2006 and is present in all versions of OpenSSL before 1.0.2m and 1.1.0g. CVE-2017-3735has been assigned to this vulnerability. A CVSS v3.0 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:N).",
      "mitigations": "N/AFesto has identified the following specific workarounds and mitigations users can apply to reduce risk: (CVE-2022-22515, CVE-2022-22514, CVE-2022-22513, CVE-2021-36763, CVE-2021-33485, CVE-2020-10245, CVE-2020-15806, CVE-2019-9011, CVE-2019-9013, CVE-2020-12067, CVE-2020-12069, CVE-2021-36764, CVE-2019-5105, CVE-2021-29241, CVE-2021-29242, CVE-2022-22519, CVE-2022-22517, CVE-2018-0739) (Product Group: Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-D(All versions), Festo Firmware (R06 (11.10.2016) = 2.3.8.1) installed on Festo Hardware Controller CECC-LK(All versions), Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-S(All versions)): No fix planned. This issue will be handled with next hardware generation release. (CVE-2019-9008, CVE-2019-18858, CVE-2019-13548, CVE-2019-13542, CVE-2019-9009, CVE-2019-9012, CVE-2020-7052, CVE-2019-13532, CVE-2018-20025, CVE-2018-10612, CVE-2017-3735) (Product Group: Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-D(All versions), Festo Firmware (R06 (11.10.2016) = 2.3.8.1) installed on Festo Hardware Controller CECC-LK(All versions), Festo Firmware (R05 (17.06.2016) = 2.3.8.0) installed on Festo Hardware Controller CECC-S(All versions)): Update to version 2.4.2.0. This also fixes CODESYS Advisory 2017-01, CODESYS Advisory 2017-03, CODESYS Advisory 2017-06, CODESYS Advisory 2017-07, CODESYS Advisory 2017-09, CODESYS Advisory 2018-04, CODESYS Advisory 2018-05, CODESYS Advisory 2018-07, CODESYS Advisory 2018-11. The following product versions have been fixed: Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-9008 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-9008 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-18858 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-18858 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-13548 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-13548 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-13542 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-13542 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-9009 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-9009 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-9012 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-9012 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2020-7052 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2020-7052 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2019-13532 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2019-13532 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2018-20025 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2018-20025 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2018-0739 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2018-0739 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2018-10612 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2018-10612 Firmware 2.4.2.0 installed on Controller CECC-D are fixed versions for CVE-2017-3735 Firmware 2.4.2.0 installed on Controller CECC-LK are fixed versions for CVE-2017-3735 For more information see the associated Festo SE & Co. KG security advisory FSA-202202FSA-202202: Festo: Controller CECC-S,LK,D family <= 2.3.8.1 - multiple vulnerabilities in CODESYS V3 runtime system - HTML,FSA-202202: Festo: Controller CECC-S,LK,D family <= 2.3.8.1 - multiple vulnerabilities in CODESYS V3 runtime system - CSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "OpenPLC_V3",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-05",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of OpenPLC_V3 are affected: OpenPLC_V3: Versions prior to pull request #292",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.1 ATTENTION: Low attack complexity Vendor: OpenPLC_V3 Equipment: OpenPLC_V3 Vulnerability: Reliance on Undefined, Unspecified, or Implementation-Defined Behavior",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could cause a denial of service, making the PLC runtime process crash.",
      "vulnerability_overview": "N/AOpenPLC_V3 has a vulnerability in the enipThread function that occurs due to the lack of a return value. This leads to a crash when the server loop ends and execution hits an illegal ud2 instruction. This issue can be triggered remotely without authentication by starting the same server multiple times or if the server exits unexpectedly. The vulnerability allows an attacker to cause a Denial of Service (DoS) against the PLC runtime, stopping any PC started remotely without authentication. This results in the PLC process crashing and halting all automation or control logic managed by OpenPLC. CVE-2025-54811has been assigned to this vulnerability. A CVSS v3.1 base score of 7.1 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-54811. A base score of 6.1 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:N/SC:N/SI:N/SA:H).",
      "mitigations": "N/APull request #292 resolves this issue. Users are advised to update OpenPLC_V3 to pull request #292 or later from themain GitHub repository. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Festo CPX-CEC-C1 and CPX-CMXX",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-273-03",
      "published": "Tue, 30 Sep 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/AFesto reports that the following products are affected: Festo Firmware installed on Festo Hardware Control block CPX-CEC-C1: Versions 2.0.12 and prior Festo Firmware installed on Festo Hardware Control block CPX-CMXX: Versions 1.2.34 rev.404 and prior Festo Firmware installed on Festo Hardware Control block-SET CPX-CEC-C1: Versions 1.2.34 rev.404 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.5 ATTENTION: Exploitable remotely/low attack complexity Vendor: Festo Equipment: CPX-CEC-C1 and CPX-CMXX Vulnerability: Improper Privilege Management",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow unauthenticated, remote access to critical webpage functions which may cause a denial of service.",
      "vulnerability_overview": "N/AFesto control block CPX-CEC-C1 and CPX-CMXX in multiple versions allow unauthenticated, remote access to critical webpage functions which may cause a denial of service. CVE-2022-3079has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "mitigations": "N/AFesto has identified the following specific remediations users can apply to reduce risk: Limit access to the webserver (TCP port 80) of the device to what is absolutely necessary. Currently, no fix is planned. Replace CPX-CEC-C1 with the follow-up product CPX-CEC-C1-V3. Replace CPX-CMXX with the follow-up product CPX-CEC-M1-V3. For more information, see the associated Festo security advisoryFSA-202207: Festo: CPX-CEC-C1 and CPX-CMXX, Missing Authentication for Critical Webpage Function - HTMLandFSA-202207: Festo: CPX-CEC-C1 and CPX-CMXX, Missing Authentication for Critical Webpage Function - CSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Adds Five Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/29/cisa-adds-five-known-exploited-vulnerabilities-catalog",
      "published": "Mon, 29 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA and UK NCSC Release Joint Guidance for Securing OT Systems",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/29/cisa-and-uk-ncsc-release-joint-guidance-securing-ot-systems",
      "published": "Mon, 29 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Strengthens Commitment to SLTT Governments",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/29/cisa-strengthens-commitment-sltt-governments",
      "published": "Mon, 29 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Releases One Industrial Control Systems Advisory",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/25/cisa-releases-one-industrial-control-systems-advisory",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Directs Federal Agencies to Identify and Mitigate Potential Compromise of Cisco Devices",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/25/cisa-directs-federal-agencies-identify-and-mitigate-potential-compromise-cisco-devices",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Dingtian DT-R002",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-268-01",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Dingtian DT-R002, a relay board, are affected: DT-R002: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Dingtian Equipment: DT-R002 Vulnerabilities: Insufficiently Protected Credentials",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to retrieve credentials without authentication.",
      "vulnerability_overview": "N/AAll versions of Dingtian DT-R002 are vulnerable to an Insufficiently Protected Credentials vulnerability that could allow an attacker to retrieve the current user's username without authentication. CVE-2025-10879has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N. A CVSS v4 score has also been calculated forCVE-2025-10879. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). All versions of Dingtian DT-R002 are vulnerable to an Insufficiently Protected Credentials vulnerability that could allow an attacker to extract the proprietary \"Dingtian Binary\" protocol password by sending an unauthenticated GET request CVE-2025-10880has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N. A CVSS v4 score has also been calculated forCVE-2025-10880. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADingtian has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of affected versions of Dingtian DT-R002 are invited to contact Dingtiancustomer supportfor additional information. The researchers recommend the following to help reduce risk: Restrict access to HTTP (TCP/80), and the Dingtian Protocol on (UDP/60000) and (UDP/60001). CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Advisory on Lessons Learned from an Incident Response Engagement",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/cisa-releases-advisory-lessons-learned-incident-response-engagement",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Mitsubishi Electric MELSEC-Q Series CPU Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-02",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AThe following versions of Mitsubishi Electric MELSEC-Q Series CPU modules are affected: MELSEC-Q Series Q03UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q04UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q06UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q13UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q26UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q04UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q06UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q13UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q26UDPVCPU: The first 5 digits of serial No. '24082' to '27081'",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3.1 6.8 ATTENTION: Exploitable remotely Vendor: Mitsubishi Electric Equipment: MELSEC-Q Series CPU module Vulnerability: Improper Handling of Length Parameter Inconsistency",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to cause a denial of service (DoS).",
      "vulnerability_overview": "N/AA Denial-of-Service (DoS) vulnerability exists in the MELSEC-Q series CPU module when the user authentication function is enabled, due to improper handling of length parameter inconsistency. CVE-2025-8531has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).",
      "mitigations": "N/AMitsubishi Electric has released the fixed version as shown below, but updating the product to the fixed version is currently unavailable. Consider migrating to the successor model, MELSEC iQ-R Series. MELSEC-QSeries Q03UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q04UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q06UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q13UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q26UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q04UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q06UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q13UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q26UDPVCPU: The first 5 digits of serial No. '27082' or later. Mitsubishi Electric recommends users employ the following mitigation measures to minimize the risk of vulnerability exploit. Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required. Use within a LAN and block access from untrusted networks and hosts through firewalls. Restrict physical access to the affected products, as well as to computers and network devices that can be connected to those products. See Mitsubishi Electric'ssecurity bulletinfor more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Widespread Supply Chain Compromise Impacting npm Ecosystem",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/widespread-supply-chain-compromise-impacting-npm-ecosystem",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Shares Lessons Learned from an Incident Response Engagement",
      "link": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-266a",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/ACISA recommends organizations implement the mitigations below to improve cybersecurity posture based on lessons learned from the engagement. These mitigations align with the Cross-Sector Cybersecurity Performance Goals (CPGs) developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. Visit CISA’sCross-Sector Cybersecurity Performance Goalsfor more information on the CPGs, including additional recommended baseline protections. Establish a vulnerability management plan that includes procedures for prioritization and emergency patching.Prioritize patching of known exploited vulnerabilities listed in the KEV catalog.CISA urges organizations to address KEV catalog vulnerabilitiesimmediately.Prioritize patching vulnerabilities in high-risk systems, including public facing systems as they are attractive targets for threat actors.Ensure high-risk systems are identified and prioritized for rapid patching by implementing asset management practices and conducting an asset inventory.Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners).Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization.Form a dedicated team responsible for assessing and implementing emergency patches, this team should include representatives from IT, security, and relevant business units. Prioritize patching of known exploited vulnerabilities listed in the KEV catalog.CISA urges organizations to address KEV catalog vulnerabilitiesimmediately. CISA urges organizations to address KEV catalog vulnerabilitiesimmediately. Prioritize patching vulnerabilities in high-risk systems, including public facing systems as they are attractive targets for threat actors. Ensure high-risk systems are identified and prioritized for rapid patching by implementing asset management practices and conducting an asset inventory.Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners).Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization. Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners). Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization. Form a dedicated team responsible for assessing and implementing emergency patches, this team should include representatives from IT, security, and relevant business units. Maintain, practice, and update cybersecurity IRPs[CPG 2.S,5.A].Prepare a written IRP policy and IRP with senior leadership support.The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners.The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs).The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents).Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises.For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. Prepare a written IRP policy and IRP with senior leadership support.The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners.The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs).The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents).Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises.For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners. The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). Key personnel with knowledge of the network Key resources and courses of action (COAs) for containment and eradication in the event of compromise. Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents). Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises. During the test, include engagement with third party incident responders and external EDR agents and other tools. Following the test, update the IRP as necessary. See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises. For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. Implement comprehensive (i.e., large coverage) and verbose (i.e., detailed) logging and aggregate logsin an out-of-band, centralized location.Prepare SOCs with sufficient resources to monitor collected logs and responses to malicious cyber threat activity.Consider using a SIEM solution for log aggregation and management.Identify, alert on, and investigate abnormal network activity (as threat actor activity generates unusual network traffic across all phases of the attack chain).Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network.For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. Prepare SOCs with sufficient resources to monitor collected logs and responses to malicious cyber threat activity. Consider using a SIEM solution for log aggregation and management. Identify, alert on, and investigate abnormal network activity (as threat actor activity generates unusual network traffic across all phases of the attack chain).Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network.For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network. Running scans to discover other network connected devices. Running commands to list, add, or alter administrator accounts. Using PowerShell to download and execute remote programs. Running scripts not usually seen on a network. For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. In addition to the above, CISA recommends organizations implement the following mitigations based on threat actor activity: Requirephishing-resistant MFAfor access to all privileged accounts and email services accounts [CPG 2.H]. Implement allowlistingfor applications, scripts, and network traffic to prevent unauthorized execution and access."
    },
    {
      "title": "Viessmann Vitogate 300",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-04",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Viessmann Vitogate 300 are affected: Vitogate 300: Versions prior to 3.1.0.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Low attack complexity Vendor: Viessmann Equipment: Vitogate 300 Vulnerabilities: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection'), Client-Side Enforcement of Server-Side Security",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to modify an intended OS command when it is sent to a downstream component, or allow an attacker to cause unexpected interactions between the client and server.",
      "vulnerability_overview": "N/AVitogate 300 constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component. CVE-2025-9494has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9494. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). When the server relies on client-side protection mechanisms, an attacker can modify the client-side behavior to bypass the protection mechanisms, resulting in potentially unexpected interactions between the client and server. The consequences will vary, depending on what the mechanisms are trying to protect. CVE-2025-9495has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9495. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AThese vulnerabilities have been resolved in Vitogate 300 software version 3.1.0.1. Users are strongly encouraged to upgrade by downloading software version 3.1.0.1 or newer from theVitogate 300 website. For more information refer toCarrier's product security advisory CARR-PSA-2025-02. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "Schneider Electric SESU",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-03",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Schneider Electric SESU: <3.0.12 Schneider Electric SESU installed on Schneider Electric BESS ANSI: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy MiCOM P30: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy MiCOM P40: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy Studio: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Harmony XB5S Soft: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric eXLhoist Configuration Software: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Device Maintenance: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert Basic: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Expert Motion: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Operator Terminal Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Control Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Process Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Process Expert for AVEVA System Platform: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Architecture Builder: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert HVAC: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Power Operations (EPO): SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Power Commission Desktop (EPC): SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Microgrid Operations Medium: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Microgrid Flex: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric PowerLogic P5: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric PowerLogic P7: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric ZelioSoft 2: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric SoMove: SESU versions prior to 3.0.12",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.3 ATTENTION: Low Attack Complexity Vendor: Schneider Electric Equipment: SESU Vulnerability: Improper Link Resolution Before File Access ('Link Following')",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an authenticated attacker to write arbitrary data to protected locations, potentially leading to escalation of privilege, arbitrary file corruption, exposure of application and system information or persistent denial of service when a low-privileged attacker tampers with the installation folder.",
      "vulnerability_overview": "N/AA link following vulnerability exists that could cause arbitrary data to be written to protected locations, potentially leading to escalation of privilege, arbitrary file corruption, exposure of application and system information or persistent denial of service when a low-privileged attacker tampers with the installation folder. CVE-2025-5296has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:H).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Version 3.0.12 of SESU includes a fix for this vulnerability and is available for downloadhere. Follow the installation instructions. If a predecessor version of SESU is already installed, then the update to V3.0.12 will be done automatically as a critical update in the background depending on the \"automatic\"update configuration. If users choose not to apply the remediation detailed above, they should immediately apply the following mitigations to reduce the risk of exploit: SESU Installation Directory (chosen by the user at installation time) should not be accessible from the network and only by trusted persons. For more information see the associated Schneider Electric CPCERT security advisory SEVD-2025-224-03Schneider Electric Software Update - SEVD-2025-224-03 PDF Version,Schneider Electric Software Update - SEVD-2025-224-03 CSAF Version. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Releases Six Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/cisa-releases-six-industrial-control-systems-advisories",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "AutomationDirect CLICK PLUS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-01",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "AutomationDirect",
      "affected_products": "N/AThe following AutomationDirect products are affected: CLICK PLUS C0-0x CPU firmware: Versions prior to v3.71 CLICK PLUS C0-1x CPU firmware: Versions prior to v3.71 CLICK PLUS C2-x CPU firmware: Versions prior to v3.71",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: AutomationDirect Equipment: CLICK PLUS Vulnerabilities: Cleartext Storage of Sensitive Information, Use of Hard-coded Cryptographic Key, Use of a Broken or Risky Cryptographic Algorithm, Predictable Seed in Pseudo-Random Number Generator, Improper Resource Shutdown or Release, Missing Authorization",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities disclose sensitive information, modify device settings, escalate privileges, or cause a denial-of-service condition on the affected device.",
      "vulnerability_overview": "N/ACleartext storage of sensitive information was discovered in Click Programming Software version v3.60. The vulnerability can be exploited by a local user with access to the file system, while an administrator session is active, to steal credentials stored in clear text. CVE-2025-54855has been assigned to this vulnerability. A CVSS v3.1 base score of 4.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-54855. A base score of 4.1 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:P/PR:H/UI:P/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). The use of a hard-coded cryptographic key was discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software contains a hard-coded AES key used to protect the initial messages of a new KOPS session. CVE-2025-58069has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-58069. A base score of 6.9 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N). The use of a broken or risky cryptographic algorithm was discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software uses an insecure implementation of the RSA encryption algorithm. CVE-2025-59484has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-59484. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N). A predictable seed in pseudo-random number generator vulnerability has been discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software implements a predictable seed for its pseudo-random number generator, which compromises the security of the generated private keys. CVE-2025-55069has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-55069. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N). An improper resource shutdown or release vulnerability has been identified in the Click Plus C2-03CPU-2 device running firmware version 3.60. The vulnerability allows an unauthenticated attacker to perform a denial-of-service attack by exhausting all available device sessions of the Click Programming Software. CVE-2025-58473has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-58473. A base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). An authorization bypass vulnerability has been discovered in the Click Plus C2-03CPU2 device firmware version 3.60. Through the KOPR protocol utilized by the Remote PLC application, authenticated users with low-level access permissions can exploit this vulnerability to read and modify PLC variables beyond their intended authorization level. CVE-2025-55038has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-55038. A base score of 7.6 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:L/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N). An improper resource shutdown or release vulnerability has been identified in the Click Plus C2-03CPU-2 device running firmware version 3.60. The vulnerability allows an unauthenticated attacker to perform a denial-of-service attack by exhausting all available device sessions in the Remote PLC application. CVE-2025-57882has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-57882. A base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AAutomationDirect recommends that users update CLICK PLUS and firmware toV3.80. If the update cannot be applied right away, the following compensating controls are recommended until the upgrade can be performed: Network Isolation – Disconnect the CLICK PLUS PLC from external networks (e.g., the internet or corporate LAN) to reduce exposure. Secure Communications – Use only trusted, dedicated internal networks or air-gapped systems for device communication. Access Control – Restrict both physical and logical access to authorized personnel only. Application Whitelisting – Configure whitelisting so that only trusted, pre-approved applications are allowed to run. Block any unauthorized software. Endpoint Protection – Use antivirus or EDR tools and configure host-based firewalls to block unauthorized access attempts. Logging & Monitoring – Enable and regularly review system logs to detect suspicious or unauthorized activity. Backup & Recovery – Maintain secure, tested backups of the PLC and its configurations to minimize downtime in case of an incident. Ongoing Risk Assessment – Continuously evaluate risks associated with running outdated firmware and adjust compensating measures accordingly. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    }
  ]
}