{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-09-14T03:01:05.243063Z",
  "items": [
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/11/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Daikin Security Gateway",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-10",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Daikin Security Gateway are affected: Security Gateway: App: 100, Frm: 214",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION: Exploitable remotely/low attack complexity/public exploits are available Vendor: Daikin Equipment: Security Gateway Vulnerability: Weak Password Recovery Mechanism for Forgotten Password",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to the system.",
      "vulnerability_overview": "N/ADaikin Security Gateway is vulnerable to an authorization bypass through a user-controlled key vulnerability that could allow an attacker to bypass authentication. An unauthorized attacker could access the system without prior credentials. CVE-2025-10127has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-10127. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:L).",
      "mitigations": "N/ADaikin has reported they will not fix this vulnerability and will respond directly to user inquiries. For more information, contactDaikin customer support. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens User Management Component (UMC)",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-07",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens SIMATIC PCS neo V4.1: All versions Siemens SIMATIC PCS neo V5.0: All versions Siemens User Management Component (UMC): Versions prior to 2.15.1.3",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: User Management Component (UMC) Vulnerabilities: Stack-based Buffer Overflow, Out-of-bounds Read",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an unauthenticated remote attacker to execute arbitrary code or to cause a denial-of-service condition.",
      "vulnerability_overview": "N/AAffected products contain a stack-based buffer overflow vulnerability in the integrated UMC component. This vulnerability could allow an unauthenticated remote attacker to execute arbitrary code or to cause a denial-of-service condition. CVE-2025-40795has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-40795. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Affected products contain an out-of-bounds read vulnerability in the integrated UMC component. This vulnerability could allow an unauthenticated remote attacker to cause a denial-of-service condition. CVE-2025-40796has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-40796. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). Affected products contain an out-of-bounds read vulnerability in the integrated UMC component. This vulnerability could allow an unauthenticated remote attacker to cause a denial-of-service condition. CVE-2025-40797has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-40797. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). Affected products contain an out-of-bounds read vulnerability in the integrated UMC component. This vulnerability could allow an unauthenticated remote attacker to cause a denial-of-service condition. CVE-2025-40798has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-40798. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has released a new version for User Management Component (UMC) and recommends updating to the latest version. Siemens recommends specific countermeasures for products where fixes are not available or are not yet available. Siemens has identified the following specific workarounds and mitigations users can apply to reduce risk: User Management Component (UMC):Update to V2.15.1.3 or later version. All affected products: In non-networked scenarios/deployments, block TCP ports 4002 and 4004 on machines with UMC installed. If the deployment is not using the 'RT Server' type of UMC machine, port 4004 can be blocked everywhere without impacting network functionality for all other UMC machine-types (Server, Ring-Server, Agent). SIMATIC PCS neo V4.1, SIMATIC PCS neo V5.0: No fix is currently planned. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information, see the associated Siemens security advisory SSA-722410 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Siemens Apogee PXC and Talon TC Devices",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-05",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: APOGEE PXC Series (BACnet): All versions APOGEE PXC Series (P2 Ethernet): All versions TALON TC Series (BACnet): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Apogee PXC and Talon TC Devices Vulnerability: Exposure of Sensitive Information to an Unauthorized Actor",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to download the device's encrypted database file via BACnet.",
      "vulnerability_overview": "N/AAffected devices connected to the network allow unrestricted access to sensitive files, such as databases. This could allow an attacker to download encrypted .db file containing passwords. CVE-2025-40757has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-40757. A base score of 6.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Ensure all three default passwords are changed, even if not in use. Ensure that passwords for all accounts are strong and hard to guess. Passwords can be 15 characters long and can contain upper case, lower case, numbers and special characters. Disable telnet (telnet is disabled by default). As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-916339 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Eleven Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/11/cisa-releases-eleven-industrial-control-systems-advisories",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens SIMOTION Tools",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-01",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: SIMATIC Technology Package TPCamGen (6ES7823-0FE30-1AA0): All versions SIMOTION OA MIIF (6AU1820-3DA20-0AB0): All versions SIMOTION OACAMGEN (6AU1820-3EA20-0AB0): All versions SIMOTION OALECO (6AU1820-3HA20-0AB0): All versions SIMOTION OAVIBX (6AU1820-3CA20-0AB0): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 8.1 ATTENTION: Exploitable locally Vendor: Siemens Equipment: SIMOTION Tools Vulnerability: Improper Check for Unusual or Exceptional Conditions",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code with SYSTEM privileges when a legitimate user installs an application that uses the affected setup component.",
      "vulnerability_overview": "N/ANullsoft Scriptable Install System (NSIS) before 3.11 on Windows allows local users to escalate privileges to SYSTEM during an installation, because the temporary plugins directory is created under %WINDIR%\\temp and unprivileged users can place a crafted executable file by winning a race condition. This occurs because EW_CREATEDIR does not always set the CreateRestrictedDirectory error flag. CVE-2025-43715has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H).",
      "mitigations": "N/ASiemens reports that no fix currently is available. Siemens has also identified the following workarounds and mitigations users can apply to reduce risk: Ensure that no other users are logged in and that no unknown programs are running before starting the installation of the affected products As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-563922 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity."
    },
    {
      "title": "Schneider Electric Modicon M340, BMXNOE0100, and BMXNOE0110",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-09",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Modicon M340: All versions Modbus/TCP Ethernet Modicon M340 module: Versions prior to SV3.60 Modbus/TCP Ethernet Modicon M340 FactoryCast module: Versions prior to SV6.80",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.9 ATTENTION: Exploitable remotely/low attack complexity Vendor: Schneider Electric Equipment: Modicon M340, BMXNOE0100, and BMXNOE0110 Vulnerability: Files or Directories Accessible to External Parties",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow attackers to prevent firmware updates and disrupt the webserver's proper behavior by removing specific files or directories from the filesystem.",
      "vulnerability_overview": "N/AA Files or Directories Accessible to External Parties vulnerability exists which may prevent user to update the device firmware and prevent proper behavior of the webserver when specific files or directories are removed from the filesystem. CVE-2024-5056has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2024-5056. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Modbus/TCP Ethernet Modicon M340 module: Version SV3.60 of BMXNOE0100 includes a fix for this vulnerability and is available for downloadhere. Modbus/TCP Ethernet Modicon M340 FactoryCast module: Version SV6.80 of BMXNOE0110 includes a fix for this vulnerability and is available for downloadhere. Schneider Electric is establishing a remediation plan for all future versions of Modicon M340 that will include a fix for this vulnerability. They will provide an update when the remediation is available. Until then, users should immediately apply the following mitigations to reduce the risk of exploit: Set up network segmentation and implement a firewall to block all unauthorized access to FTP port 21/TCP on the devices. FTP service is disabled by default. Deactivate the FTP service after use when not needed. Configure the Access Control List following the recommendations of theuser manual\"Modicon M340 for Ethernet Communications Modules and Processors User Manual\" in chapter \"Messaging Configuration Parameters\". For more information see the associated Schneider Electric CPCERT security advisorySEVD-2024-163-01,SEVD-2024-163-01 CSAF Version. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens Industrial Edge Management OS (IEM-OS)",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-06",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Industrial Edge Management OS (IEM-OS): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Industrial Edge Management OS (IEM-OS) Vulnerability: Allocation of Resources Without Limits or Throttling",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a remote attacker to cause a denial-of-service condition.",
      "vulnerability_overview": "N/AAllocation of resources for multipart headers with insufficient limits enables a denial-of-service vulnerability in Apache Commons FileUpload. CVE-2025-48976has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-48976. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Migrate to Industrial Edge Management Virtual (IEM-V). Limit access to trusted users and systems only. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information, see the associated Siemens security advisory SSA-640476 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens SINEC OS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-04",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens RUGGEDCOM RST2428P (6GK6242-6PA00): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 2.3 ATTENTION: Exploitable from adjacent network Vendor: Siemens Equipment: SINEC OS Vulnerabilities: Uncontrolled Resource Consumption, Exposure of Sensitive Information to an Unauthorized Actor",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to access non-sensitive information without authentication or potentially cause a temporary denial of service.",
      "vulnerability_overview": "N/AThe affected device may be susceptible to resource exhaustion when subjected to high volumes of query requests. This could allow an attacker to cause a temporary denial of service, with the system recovering once the activity stops. CVE-2025-40802has been assigned to this vulnerability. A CVSS v3.1 base score of 3.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L). A CVSS v4 score has also been calculated forCVE-2025-40802. A base score of 2.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:H/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N). The affected device exposes certain non-critical information from the device. This could allow an unauthenticated attacker to access sensitive data, potentially leading to a breach of confidentiality. CVE-2025-40803has been assigned to this vulnerability. A CVSS v3.1 base score of 3.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-40803. A base score of 2.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:H/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: RUGGEDCOM RST2428P (6GK6242-6PA00): Create a firewall rule that blocks the UDP ports if not required. The device uses UDP 34964 and one port in range 49152-65535 for discovery protocols like LLDP, DCP, MRP etc. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-494539 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. These vulnerabilities have a high attack complexity."
    },
    {
      "title": "Siemens SINAMICS Drives",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-03",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens SINAMICS G220 V6.4: Versions prior to V6.4 HF2 Siemens SINAMICS S200 V6.4: All versions Siemens SINAMICS S210 V6.4: Versions prior to V6.4 HF2",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.9 ATTENTION: Exploitable from a local network Vendor: Siemens Equipment: SINAMICS Drives Vulnerability: Improper Privilege Management",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow users to escalate their privileges.",
      "vulnerability_overview": "N/AThe affected devices allow a factory reset to be executed without the required privileges due to improper privilege management as well as manipulation of configuration data because of leaked privileges of previous sessions. This could allow an unauthorized attacker to escalate their privileges. CVE-2025-40594has been assigned to this vulnerability. A CVSS v3.1 base score of 6.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:C/C:N/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-40594. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:H/AT:P/PR:N/UI:A/VC:N/VI:H/VA:L/SC:N/SI:H/SA:L).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: SINAMICS S200 V6.4: Currently has no fix available. SINAMICS S210 V6.4: Update to V6.4 HF2 orlater version. SINAMICS G220 V6.4: Update to V6.4 HF2 orlater version. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-027652 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. This vulnerability has a high attack complexity."
    },
    {
      "title": "Siemens SIMATIC Virtualization as a Service (SIVaaS)",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-02",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: SIMATIC Virtualization as a Service (SIVaaS): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: SIVaaS Vulnerability: Incorrect Permission Assignment for Critical Resource",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to access or alter sensitive data without proper authorization.",
      "vulnerability_overview": "N/AThe affected application exposes a network share without any authentication. This could allow an attacker to access or alter sensitive data without proper authorization. CVE-2025-40804has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-40804. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: SIMATIC Virtualization as a Service (SIVaaS): Contact Technical Support for assistance As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-534283 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Schneider Electric EcoStruxure",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-08",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/AThe following Schneider Electric products are affected: EcoStruxure Building Operation Enterprise Server 7.x: Versions prior to 7.0.2.348 EcoStruxure Building Operation Enterprise Server 6.x: Versions prior to 6.0.4.10001 (CP8) EcoStruxure Building Operation Enterprise Server 5.x: Versions prior to 5.0.3.17009 (CP16) EcoStruxure Enterprise Server 7.x: Versions prior to 7.0.2.348 EcoStruxure Enterprise Server 6.x: Versions prior to 6.0.4.10001 (CP8) EcoStruxure Enterprise Server 5.x: Versions prior to 5.0.3.17009 (CP16) EcoStruxure Workstation 7.x: Versions prior to 7.0.2.348 EcoStruxure Workstation 6.x: Versions prior to 6.0.4.10001 (CP8) EcoStruxure Workstation 5.x: Versions prior to 5.0.3.17009 (CP16)",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 4.1 ATTENTION: Exploitable from an adjacent network Vendor: Schneider Electric Equipment: EcoStruxure Vulnerabilities: Uncontrolled Resource Consumption, Exposure of Sensitive Information to an Unauthorized Actor",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service condition or disclose sensitive credential data.",
      "vulnerability_overview": "N/AUncontrolled resource consumption vulnerability exists that could cause a denial of service when an authenticated user sends a specially crafted request to a specific endpoint from within the BMS network CVE-2025-8449has been assigned to this vulnerability. A CVSS v3.1 base score of 4.5 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:R/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-8449. A base score of 4.1 has been calculated; the CVSS vector string is (AV:A/AC:H/AT:N/PR:L/UI:P/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). Exposure of sensitive information to an unauthorized actor vulnerability exists that could cause unauthorized access to sensitive credential data when an attacker is able to capture local SMB traffic between a valid user within the BMS network and the vulnerable products. CVE-2025-8448has been assigned to this vulnerability. A CVSS v3.1 base score of 2.3 has been calculated; the CVSS vector string is (AV:A/AC:H/PR:L/UI:R/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-8448. A base score of 1.0 has been calculated; the CVSS vector string is (AV:A/AC:H/AT:N/PR:L/UI:P/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASchneider Electric recommends users to update to the following versions of Enterprise Server, Enterprise Central, and Workstation that include a fix for the vulnerabilities: 7.0.2.348 6.0.4.10001 (CP8) 5.0.3.17009 (CP16) To receive the patch: Step 1: Locate the appropriate version for your system on theEcoExpert Software Center Step 2: Follow the installation instructions provided in the accompanying readme file. Additionally, ensure you are following theEBO hardening guidelines If users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit: Implement strong access controls to limit system access to authorized personnel. Use multi factor authentication if using EBO version 7.0 or later Use firewalls to segregate networks and protect the building management system Regularly monitor system activity For more information see the associated Schneider Electric CPCERT security advisorySEVD-2025-224-04. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation 1783-NATR",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-09",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Rockwell Automation 1783-NATR are affected: 1783-NATR: All versions prior to 1.007",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.9 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: 1783-NATR Vulnerability: Use of Platform-Dependent Third Party Components",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to cause a memory corruption on the product.",
      "vulnerability_overview": "N/AIn Wind River VxWorks, memory allocator has a possible overflow in calculating the memory block's size to be allocated by calloc(). As a result, the actual memory allocated is smaller than the buffer size specified by the arguments, leading to memory corruption. CVE-2020-28895has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2020-28895. A base score of 6.9 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation released a product update addressing this vulnerability: Version 1.007 Users of the affected software unable to upgrade to one of the corrected versions should follow Rockwell Automation'ssecurity best practices. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation ControlLogix 5580",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-07",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of ControlLogix 5580 is affected: ControlLogix 5580: Version 35.013",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.2 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Rockwell Automation Equipment:ControlLogix 5580 Vulnerability:NULL Pointer Dereference",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in a major nonrecoverable fault on the controller.",
      "vulnerability_overview": "N/AA denial-of-service vulnerability that exists in the affected product and version. The vulnerability stems from the controller repeatedly attempting to forward messages which could result in a major nonrecoverable fault on the controller. CVE-2025-9166has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-9166. A base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:P/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends users to update toversion 35.014 or laterif possible. If users of the affected software are unable to upgrade the version,security best practicesshould be applied. For more information, see theRockwell Automation security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation FactoryTalk Activation Manager",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-05",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of FactoryTalk Activation Manager, a secure software tool that enables activation and management of Rockwell Automation products without physical media, is affected: FactoryTalk Activation Manager: Version 5.00",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Rockwell Automation Equipment:FactoryTalk Activation Manager Vulnerability:Incorrect Implementation of Authentication Algorithm",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in in data exposure, session hijacking, or full communication compromise.",
      "vulnerability_overview": "N/AA security issue exists within FactoryTalk Activation Manager. An error in the implementation of cryptography within the software could allow attackers to decrypt traffic. This could result in data exposure, session hijacking, or full communication compromise. CVE-2025-7970has been assigned to this vulnerability. A CVSS v3 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-7970. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends users update FactoryTalk Activation Manager software to Version 5.02 or later. If users are not able to upgrade to one of the corrected versions, Rockwell Automation recommends following theirsecurity best practices. For more information, see theRockwell Automation security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation Stratix IOS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-03",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Stratix IOS are affected: Stratix IOS: Versions 15.2(8)E5 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: Stratix IOS Vulnerability: Injection",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to run malicious configurations without authentication.",
      "vulnerability_overview": "N/AA security issue affecting multiple Cisco devices also directly impacts Stratix® 5410, 5700, and 8000 devices. This can lead to remote code execution by uploading and running malicious configurations without authentication. CVE-2025-7350has been assigned to this vulnerability. A CVSS v3.1 base score of 9.6 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7350. A base score of 8.6 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation has provided an update that mitigates this vulnerability. Users are recommended to update to version 15.2(8)E6 or later. If users are not able to upgrade to the corrected version, Rockwell Automation recommends referring to theirsecurity best practices. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Rockwell Automation Analytics LogixAI",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-08",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following versions of Rockwell Automation Analytics LogixAI are affected: Analytics LogixAI: Versions 3.00 and 3.01",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable from an adjacent network/low attack complexity Vendor: Rockwell Automation Equipment: Analytics LogixAI Vulnerability: Exposure of Sensitive System Information to an Unauthorized Control Sphere",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to access sensitive information.",
      "vulnerability_overview": "N/AAn open database issue exists in the affected product and version. The security issue stems from an over permissive Redis instance. This could result in an attacker on the intranet accessing sensitive data and potential alteration of data. CVE-2025-9364has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9364. A base score of 8.7 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation released a product update addressing this vulnerability: Versions 3.02 and later Users of the affected software unable to upgrade to one of the corrected versions should use Rockwell Automation'ssecurity best practices. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Rockwell Automation ThinManager",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-01",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/ARockwell Automation reports the following versions of ThinManager, a thin client management software, are affected: ThinManager: Versions 13.0 through 14.0",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Rockwell Automation Equipment: ThinManager Vulnerability: Server-Side Request Forgery (SSRF)",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could expose the ThinServer service account NTLM hash.",
      "vulnerability_overview": "N/AA server-side request forgery security issue exists within Rockwell Automation ThinManager software due to the lack of input sanitization. Authenticated attackers can exploit this vulnerability by specifying external SMB paths, thereby exposing the ThinServer service account NTLM hash. CVE-2025-9065has been assigned to this vulnerability. A CVSS v3.1 base score of 7.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9065. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation corrected the issue in version 14.1 and recommends users upgrade to this version or newer. Users of the affected software who are not able to upgrade to one of the corrected versions should follow Rockwell Automation'ssecurity best practices. Users can also reference the following article from Microsoft toblock NTLM connections on SMB in Windows Server 2025. For more information about these issues, refer to theRockwell Automation security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "ABB Cylon Aspect BMS/BAS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-02",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "ABB",
      "affected_products": "N/AABB reports that the following products are affected: ABB ASPECT-Enterprise ASP-ENT-x: Versions prior to 3.08.04-s01 ABB NEXUS Series NEX-2x: Versions prior to 3.08.04-s01 ABB NEXUS Series NEXUS-3-x: Versions prior to 3.08.04-s01 ABB MATRIX Series MAT-x: Versions prior to 3.08.04-s01",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: ABB Equipment: ASPECT, NEXUS, MATRIX Vulnerabilities: Authentication Bypass Using an Alternate Path or Channel, Missing Authentication for Critical Function, Classic Buffer Overflow",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to assume control of the target device or perform a denial-of-service (DoS) attack.",
      "vulnerability_overview": "N/ADue to an issue in configuration, code that was intended for debugging purposes was included in the market release of the ASPECT FW allowing an attacker to bypass authentication. This vulnerability may allow an attacker to change the system time, access files, and make function calls without prior authentication. This issue affects all versions of ASPECT prior to 3.08.04-s01. CVE-2025-53187has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-53187. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). A denial-of-service (DoS) attack is possible if access to the local network is provided to unauthorized users. This is due to a buffer copy issue that may lead to a software crash. This issue affects all versions of ASPECT. CVE-2025-7677has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-7677. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). The ASPECT system allows users to bypass authentication. This issue affects all versions of ASPECT. CVE-2025-7679has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-7679. A base score of 9.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AFor more information refer to ABB's Cybersecurity Advisory9AKK108471A4 462. The ABB advisory includes a detailed mapping of applicable mitigations for each listed vulnerability. ABB has identified the following specific workarounds and mitigations users can apply to reduce risk: CVE-2025-53187: This vulnerability has been resolved in product versions 3.08.04-s01 and later. The remaining mitigations are general security measures that apply to all vulnerabilities: All vulnerabilities reported in the scope of this document are exploitable only if the attackers can access the network segment where ASPECT is installed and exposed directly to the Internet. ABB therefore recommends the following guidelines to protect customer networks:ASPECT devices should never be exposed directly to the Internet either via a direct ISP connection or via NAT port forwarding. If remote access to an ASPECT system is a user requirement, the system shall operate behind a firewall. Users accessing ASPECT remotely shall do this using a VPN Gateway allowing access to the network segment where ASPECT is installed and configured.Note: It is crucial that the VPN Gateway and Network are set up in accordance with best industry standards and maintained in terms of security patches for all related components.Authorized users shall change all default credentials during commissioning of an ASPECT system. If credentials have not been changed during commissioning state, ABB advises users to change each changeable credential at the earliest opportunity.Ensure that all ASPECT products are upgraded to the latest firmware version. The latest version of ASPECT firmware can be found on the respective product homepage. ASPECT devices should never be exposed directly to the Internet either via a direct ISP connection or via NAT port forwarding. If remote access to an ASPECT system is a user requirement, the system shall operate behind a firewall. Users accessing ASPECT remotely shall do this using a VPN Gateway allowing access to the network segment where ASPECT is installed and configured.Note: It is crucial that the VPN Gateway and Network are set up in accordance with best industry standards and maintained in terms of security patches for all related components. Note: It is crucial that the VPN Gateway and Network are set up in accordance with best industry standards and maintained in terms of security patches for all related components. Authorized users shall change all default credentials during commissioning of an ASPECT system. If credentials have not been changed during commissioning state, ABB advises users to change each changeable credential at the earliest opportunity. Ensure that all ASPECT products are upgraded to the latest firmware version. The latest version of ASPECT firmware can be found on the respective product homepage. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Fourteen Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/09/cisa-releases-fourteen-industrial-control-systems-advisories",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Rockwell Automation FactoryTalk Optix",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-04",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of FactoryTalk Optix, a scalable, cloud-enabled visualization platform, is affected: FactoryTalk Optix: Versions 1.5.0 through 1.5.7",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.3 ATTENTION:Exploitable remotely Vendor:Rockwell Automation Equipment:FactoryTalk Optix Vulnerability:Improper Input Validation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in an attacker achieving remote code execution.",
      "vulnerability_overview": "N/AA security issue exists within FactoryTalk Optix MQTT broker due to the lack of URI sanitization. This flaw enables the loading of remote Mosquito plugins, which can be used to achieve remote code execution. CVE-2025-9161has been assigned to this vulnerability. A CVSS v3 base score of 7.1 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9161. A base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:P/PR:L/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends users update FactoryTalk Optix software to Version 1.6.0 or later. If users are not able to upgrade to one of the corrected versions, Rockwell Automation recommends following theirsecurity best practices. For more information, see theRockwell Automation security advisory. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Rockwell Automation CompactLogix® 5480",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-252-06",
      "published": "Tue, 09 Sep 25 12:00:00 +0000",
      "vendor": "Rockwell Automation",
      "affected_products": "N/AThe following version of CompactLogix® 5480 is affected: CompactLogix® 5480: Version 32-37.011 with Windows package (2.1.0) Win10 v1607",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.0 ATTENTION:Low attack complexity Vendor:Rockwell Automation Equipment:CompactLogix® 5480 Vulnerability:Missing Authentication for Critical Function",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in arbitrary code execution.",
      "vulnerability_overview": "N/AA code execution vulnerability exists in the affected product. An attacker with physical access could abuse the maintenance menu of the controller with a crafted payload which could result in arbitrary code execution. CVE-2025-9160has been assigned to this vulnerability. A CVSS v3 base score of 6.8 has been calculated; the CVSS vector string is (AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9160. A base score of 7.0 has been calculated; the CVSS vector string is (AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ARockwell Automation recommends users to implement best practices. Security Best Practices System Security Design Guidelines CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Releases Five Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/04/cisa-releases-five-industrial-control-systems-advisories",
      "published": "Thu, 04 Sep 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Three Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/04/cisa-adds-three-known-exploited-vulnerabilities-catalog",
      "published": "Thu, 04 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Honeywell OneWireless Wireless Device Manager (WDM)",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-247-01",
      "published": "Thu, 04 Sep 25 12:00:00 +0000",
      "vendor": "Honeywell",
      "affected_products": "N/AHoneywell reports these vulnerabilities affect the following: OneWireless WDM: All releases prior to R322.5 OneWireless WDM: All releases prior to R331.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION: Exploitable remotely/low attack complexity Vendor: Honeywell Equipment: OneWireless Wireless Device Manager (WDM) Vulnerabilities: Improper Restriction of Operations within the Bounds of a Memory Buffer, Sensitive Information in Resource Not Removed Before Reuse, Integer Underflow (Wrap or Wraparound), Deployment of Wrong Handler",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in information exposure, denial of service, or remote code execution.",
      "vulnerability_overview": "N/AThe Honeywell OneWireless WDM contains a memory buffer vulnerability in the component Control Data Access (CDA). An attacker could potentially exploit this vulnerability, leading to buffer overread, which could result in improper index validation against buffer borders leading to remote code execution. CVE-2025-2521has been assigned to this vulnerability. A CVSS v3.1 base score of 8.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-2521. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N). The Honeywell OneWireless WDM contains a sensitive information in resource vulnerability in the component Control Data Access (CDA). An attacker could potentially exploit this vulnerability, leading to a communication channel manipulation, which could result in buffer reuse which may cause incorrect system behavior. CVE-2025-2522has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N). A CVSS v4 score has also been calculated forCVE-2025-2522. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N). The Honeywell OneWireless WDM contains an integer underflow vulnerability in the component Control Data Access (CDA). An attacker could potentially exploit this vulnerability, leading to a communication channel manipulation, which could result in a failure during subtraction, allowing remote code execution. CVE-2025-2523has been assigned to this vulnerability. A CVSS v3.1 base score of 9.4 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-2523. A base score of 8.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:H/VA:H/SC:N/SI:N/SA:N). The Honeywell OneWireless WDM contains a deployment of wrong handler vulnerability in the component Control Data Access (CDA). An attacker could potentially exploit this vulnerability, leading to input data manipulation, which could result in incorrect handling of packets, leading to remote code execution. CVE-2025-3946has been assigned to this vulnerability. A CVSS v3.1 base score of 8.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-3946. A base score of 8.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:L/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AHoneywell recommends updating OneWireless WDM to R322.5 or R331.1. For more information, see thesecurity notice. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA, NSA, and Global Partners Release a Shared Vision of Software Bill of Materials (SBOM) Guidance",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/03/cisa-nsa-and-global-partners-release-shared-vision-software-bill-materials-sbom-guidance",
      "published": "Wed, 03 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/03/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "published": "Wed, 03 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Releases Four Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/02/cisa-releases-four-industrial-control-systems-advisories",
      "published": "Tue, 02 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/02/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "published": "Tue, 02 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Fuji Electric FRENIC-Loader 4",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-245-02",
      "published": "Tue, 02 Sep 25 12:00:00 +0000",
      "vendor": "Fuji Electric",
      "affected_products": "N/AThe following Fuji Electric products are affected: FRENIC-Loader 4: Versions prior to 1.4.0.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.4 ATTENTION: Low attack complexity Vendor: Fuji Electric Equipment: FRENIC-Loader 4 Vulnerability: Deserialization of Untrusted Data",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to execute arbitrary code.",
      "vulnerability_overview": "N/AThe affected product is vulnerable to a deserialization of untrusted data when importing a file through a specified window, which may allow an attacker to execute arbitrary code. CVE-2025-9365has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9365. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AFuji Electric recommends users update tov1.4.0.1 or later. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    }
  ]
}