{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-09-26T11:14:58.501990Z",
  "items": [
    {
      "title": "CISA Releases One Industrial Control Systems Advisory",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/25/cisa-releases-one-industrial-control-systems-advisory",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Dingtian DT-R002",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-268-01",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Dingtian DT-R002, a relay board, are affected: DT-R002: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Dingtian Equipment: DT-R002 Vulnerabilities: Insufficiently Protected Credentials",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to retrieve credentials without authentication.",
      "vulnerability_overview": "N/AAll versions of Dingtian DT-R002 are vulnerable to an Insufficiently Protected Credentials vulnerability that could allow an attacker to retrieve the current user's username without authentication. CVE-2025-10879has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N. A CVSS v4 score has also been calculated forCVE-2025-10879. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). All versions of Dingtian DT-R002 are vulnerable to an Insufficiently Protected Credentials vulnerability that could allow an attacker to extract the proprietary \"Dingtian Binary\" protocol password by sending an unauthenticated GET request CVE-2025-10880has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N. A CVSS v4 score has also been calculated forCVE-2025-10880. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADingtian has not responded to requests to work with CISA to mitigate these vulnerabilities. Users of affected versions of Dingtian DT-R002 are invited to contact Dingtiancustomer supportfor additional information. The researchers recommend the following to help reduce risk: Restrict access to HTTP (TCP/80), and the Dingtian Protocol on (UDP/60000) and (UDP/60001). CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Directs Federal Agencies to Identify and Mitigate Potential Compromise of Cisco Devices",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/25/cisa-directs-federal-agencies-identify-and-mitigate-potential-compromise-cisco-devices",
      "published": "Thu, 25 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "AutomationDirect CLICK PLUS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-01",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "AutomationDirect",
      "affected_products": "N/AThe following AutomationDirect products are affected: CLICK PLUS C0-0x CPU firmware: Versions prior to v3.71 CLICK PLUS C0-1x CPU firmware: Versions prior to v3.71 CLICK PLUS C2-x CPU firmware: Versions prior to v3.71",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: AutomationDirect Equipment: CLICK PLUS Vulnerabilities: Cleartext Storage of Sensitive Information, Use of Hard-coded Cryptographic Key, Use of a Broken or Risky Cryptographic Algorithm, Predictable Seed in Pseudo-Random Number Generator, Improper Resource Shutdown or Release, Missing Authorization",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities disclose sensitive information, modify device settings, escalate privileges, or cause a denial-of-service condition on the affected device.",
      "vulnerability_overview": "N/ACleartext storage of sensitive information was discovered in Click Programming Software version v3.60. The vulnerability can be exploited by a local user with access to the file system, while an administrator session is active, to steal credentials stored in clear text. CVE-2025-54855has been assigned to this vulnerability. A CVSS v3.1 base score of 4.2 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-54855. A base score of 4.1 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:P/PR:H/UI:P/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N). The use of a hard-coded cryptographic key was discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software contains a hard-coded AES key used to protect the initial messages of a new KOPS session. CVE-2025-58069has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-58069. A base score of 6.9 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N). The use of a broken or risky cryptographic algorithm was discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software uses an insecure implementation of the RSA encryption algorithm. CVE-2025-59484has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-59484. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N). A predictable seed in pseudo-random number generator vulnerability has been discovered in firmware version 3.60 of the Click Plus PLC. The vulnerability relies on the fact that the software implements a predictable seed for its pseudo-random number generator, which compromises the security of the generated private keys. CVE-2025-55069has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-55069. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N). An improper resource shutdown or release vulnerability has been identified in the Click Plus C2-03CPU-2 device running firmware version 3.60. The vulnerability allows an unauthenticated attacker to perform a denial-of-service attack by exhausting all available device sessions of the Click Programming Software. CVE-2025-58473has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-58473. A base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). An authorization bypass vulnerability has been discovered in the Click Plus C2-03CPU2 device firmware version 3.60. Through the KOPR protocol utilized by the Remote PLC application, authenticated users with low-level access permissions can exploit this vulnerability to read and modify PLC variables beyond their intended authorization level. CVE-2025-55038has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-55038. A base score of 7.6 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:L/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N). An improper resource shutdown or release vulnerability has been identified in the Click Plus C2-03CPU-2 device running firmware version 3.60. The vulnerability allows an unauthenticated attacker to perform a denial-of-service attack by exhausting all available device sessions in the Remote PLC application. CVE-2025-57882has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-57882. A base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AAutomationDirect recommends that users update CLICK PLUS and firmware toV3.80. If the update cannot be applied right away, the following compensating controls are recommended until the upgrade can be performed: Network Isolation – Disconnect the CLICK PLUS PLC from external networks (e.g., the internet or corporate LAN) to reduce exposure. Secure Communications – Use only trusted, dedicated internal networks or air-gapped systems for device communication. Access Control – Restrict both physical and logical access to authorized personnel only. Application Whitelisting – Configure whitelisting so that only trusted, pre-approved applications are allowed to run. Block any unauthorized software. Endpoint Protection – Use antivirus or EDR tools and configure host-based firewalls to block unauthorized access attempts. Logging & Monitoring – Enable and regularly review system logs to detect suspicious or unauthorized activity. Backup & Recovery – Maintain secure, tested backups of the PLC and its configurations to minimize downtime in case of an incident. Ongoing Risk Assessment – Continuously evaluate risks associated with running outdated firmware and adjust compensating measures accordingly. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Schneider Electric SESU",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-03",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Schneider Electric SESU: <3.0.12 Schneider Electric SESU installed on Schneider Electric BESS ANSI: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy MiCOM P30: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy MiCOM P40: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Easergy Studio: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric Harmony XB5S Soft: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric eXLhoist Configuration Software: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Device Maintenance: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert Basic: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Automation Expert Motion: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Operator Terminal Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Control Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Process Expert: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Process Expert for AVEVA System Platform: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Architecture Builder: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Machine Expert HVAC: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Power Operations (EPO): SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Power Commission Desktop (EPC): SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Microgrid Operations Medium: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric EcoStruxure Microgrid Flex: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric PowerLogic P5: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric PowerLogic P7: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric ZelioSoft 2: SESU versions prior to 3.0.12 Schneider Electric SESU installed on Schneider Electric SoMove: SESU versions prior to 3.0.12",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.3 ATTENTION: Low Attack Complexity Vendor: Schneider Electric Equipment: SESU Vulnerability: Improper Link Resolution Before File Access ('Link Following')",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an authenticated attacker to write arbitrary data to protected locations, potentially leading to escalation of privilege, arbitrary file corruption, exposure of application and system information or persistent denial of service when a low-privileged attacker tampers with the installation folder.",
      "vulnerability_overview": "N/AA link following vulnerability exists that could cause arbitrary data to be written to protected locations, potentially leading to escalation of privilege, arbitrary file corruption, exposure of application and system information or persistent denial of service when a low-privileged attacker tampers with the installation folder. CVE-2025-5296has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:H).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Version 3.0.12 of SESU includes a fix for this vulnerability and is available for downloadhere. Follow the installation instructions. If a predecessor version of SESU is already installed, then the update to V3.0.12 will be done automatically as a critical update in the background depending on the \"automatic\"update configuration. If users choose not to apply the remediation detailed above, they should immediately apply the following mitigations to reduce the risk of exploit: SESU Installation Directory (chosen by the user at installation time) should not be accessible from the network and only by trusted persons. For more information see the associated Schneider Electric CPCERT security advisory SEVD-2025-224-03Schneider Electric Software Update - SEVD-2025-224-03 PDF Version,Schneider Electric Software Update - SEVD-2025-224-03 CSAF Version. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Mitsubishi Electric MELSEC-Q Series CPU Module",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-02",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AThe following versions of Mitsubishi Electric MELSEC-Q Series CPU modules are affected: MELSEC-Q Series Q03UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q04UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q06UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q13UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q26UDVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q04UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q06UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q13UDPVCPU: The first 5 digits of serial No. '24082' to '27081' MELSEC-Q Series Q26UDPVCPU: The first 5 digits of serial No. '24082' to '27081'",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3.1 6.8 ATTENTION: Exploitable remotely Vendor: Mitsubishi Electric Equipment: MELSEC-Q Series CPU module Vulnerability: Improper Handling of Length Parameter Inconsistency",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to cause a denial of service (DoS).",
      "vulnerability_overview": "N/AA Denial-of-Service (DoS) vulnerability exists in the MELSEC-Q series CPU module when the user authentication function is enabled, due to improper handling of length parameter inconsistency. CVE-2025-8531has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:N/A:H).",
      "mitigations": "N/AMitsubishi Electric has released the fixed version as shown below, but updating the product to the fixed version is currently unavailable. Consider migrating to the successor model, MELSEC iQ-R Series. MELSEC-QSeries Q03UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q04UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q06UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q13UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q26UDVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q04UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q06UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q13UDPVCPU: The first 5 digits of serial No. '27082' or later. MELSEC-QSeries Q26UDPVCPU: The first 5 digits of serial No. '27082' or later. Mitsubishi Electric recommends users employ the following mitigation measures to minimize the risk of vulnerability exploit. Use a firewall or virtual private network (VPN), etc. to prevent unauthorized access when Internet access is required. Use within a LAN and block access from untrusted networks and hosts through firewalls. Restrict physical access to the affected products, as well as to computers and network devices that can be connected to those products. See Mitsubishi Electric'ssecurity bulletinfor more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Widespread Supply Chain Compromise Impacting npm Ecosystem",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/widespread-supply-chain-compromise-impacting-npm-ecosystem",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Shares Lessons Learned from an Incident Response Engagement",
      "link": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-266a",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/ACISA recommends organizations implement the mitigations below to improve cybersecurity posture based on lessons learned from the engagement. These mitigations align with the Cross-Sector Cybersecurity Performance Goals (CPGs) developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. Visit CISA’sCross-Sector Cybersecurity Performance Goalsfor more information on the CPGs, including additional recommended baseline protections. Establish a vulnerability management plan that includes procedures for prioritization and emergency patching.Prioritize patching of known exploited vulnerabilities listed in the KEV catalog.CISA urges organizations to address KEV catalog vulnerabilitiesimmediately.Prioritize patching vulnerabilities in high-risk systems, including public facing systems as they are attractive targets for threat actors.Ensure high-risk systems are identified and prioritized for rapid patching by implementing asset management practices and conducting an asset inventory.Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners).Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization.Form a dedicated team responsible for assessing and implementing emergency patches, this team should include representatives from IT, security, and relevant business units. Prioritize patching of known exploited vulnerabilities listed in the KEV catalog.CISA urges organizations to address KEV catalog vulnerabilitiesimmediately. CISA urges organizations to address KEV catalog vulnerabilitiesimmediately. Prioritize patching vulnerabilities in high-risk systems, including public facing systems as they are attractive targets for threat actors. Ensure high-risk systems are identified and prioritized for rapid patching by implementing asset management practices and conducting an asset inventory.Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners).Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization. Continuously discover and validate internet-facing assets through automated asset management and scanning (e.g., attack surface management tools, vulnerability scanners). Consider using a configuration management database (CMDB) with discovery and vulnerability tools to enrich asset context and support automated prioritization. Form a dedicated team responsible for assessing and implementing emergency patches, this team should include representatives from IT, security, and relevant business units. Maintain, practice, and update cybersecurity IRPs[CPG 2.S,5.A].Prepare a written IRP policy and IRP with senior leadership support.The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners.The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs).The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents).Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises.For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. Prepare a written IRP policy and IRP with senior leadership support.The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners.The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs).The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents).Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises.For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. The policy should identify purpose and objectives, what constitutes an incident, prioritization or severity ratings of incidents, clear escalation procedures, IR personnel, and plans for notification, interaction and information sharing with media, law enforcement, and partners. The IRP should identify:Key personnel with knowledge of the networkKey resources and courses of action (COAs) for containment and eradication in the event of compromise.Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). Key personnel with knowledge of the network Key resources and courses of action (COAs) for containment and eradication in the event of compromise. Procedures for granting third parties prompt access to networks and security tools.This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). This should include processes for expediating deployment of EDR and other security tools through change control boards (CCBs). The IRP should include procedures for establishing out-of-band communications systems and accounts in case primary systems are compromised or not available (such as with ransomware incidents). Periodically test the IRP under real-world conditions, such as via purple team engagements and tabletop exercises.During the test, include engagement with third party incident responders and external EDR agents and other tools.Following the test, update the IRP as necessary.See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises. During the test, include engagement with third party incident responders and external EDR agents and other tools. Following the test, update the IRP as necessary. See CISA’sTabletop Exercise Packagesfor resources designed to assist organizations with conducting their own exercises. For more information on IRPs, see the National Institute of Science and Technology’s (NIST’s)SP 800-61 Rev. 3, Incident Response Recommendations and Considerations for Cybersecurity Risk Management: A CSF 2.0 Community Profile. Implement comprehensive (i.e., large coverage) and verbose (i.e., detailed) logging and aggregate logsin an out-of-band, centralized location.Prepare SOCs with sufficient resources to monitor collected logs and responses to malicious cyber threat activity.Consider using a SIEM solution for log aggregation and management.Identify, alert on, and investigate abnormal network activity (as threat actor activity generates unusual network traffic across all phases of the attack chain).Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network.For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. Prepare SOCs with sufficient resources to monitor collected logs and responses to malicious cyber threat activity. Consider using a SIEM solution for log aggregation and management. Identify, alert on, and investigate abnormal network activity (as threat actor activity generates unusual network traffic across all phases of the attack chain).Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network.For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. Abnormal activity to look for includes:Running scans to discover other network connected devices.Running commands to list, add, or alter administrator accounts.Using PowerShell to download and execute remote programs.Running scripts not usually seen on a network. Running scans to discover other network connected devices. Running commands to list, add, or alter administrator accounts. Using PowerShell to download and execute remote programs. Running scripts not usually seen on a network. For additional information, see joint guideIdentifying and Mitigating Living off the Land Techniques, which provides prioritized detection recommendations that enable behavior analytics, anomaly detection, and proactive hunting. In addition to the above, CISA recommends organizations implement the following mitigations based on threat actor activity: Requirephishing-resistant MFAfor access to all privileged accounts and email services accounts [CPG 2.H]. Implement allowlistingfor applications, scripts, and network traffic to prevent unauthorized execution and access."
    },
    {
      "title": "CISA Releases Six Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/cisa-releases-six-industrial-control-systems-advisories",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Viessmann Vitogate 300",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-266-04",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Viessmann Vitogate 300 are affected: Vitogate 300: Versions prior to 3.1.0.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Low attack complexity Vendor: Viessmann Equipment: Vitogate 300 Vulnerabilities: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection'), Client-Side Enforcement of Server-Side Security",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to modify an intended OS command when it is sent to a downstream component, or allow an attacker to cause unexpected interactions between the client and server.",
      "vulnerability_overview": "N/AVitogate 300 constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component. CVE-2025-9494has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9494. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:H/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). When the server relies on client-side protection mechanisms, an attacker can modify the client-side behavior to bypass the protection mechanisms, resulting in potentially unexpected interactions between the client and server. The consequences will vary, depending on what the mechanisms are trying to protect. CVE-2025-9495has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-9495. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:A/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AThese vulnerabilities have been resolved in Vitogate 300 software version 3.1.0.1. Users are strongly encouraged to upgrade by downloading software version 3.1.0.1 or newer from theVitogate 300 website. For more information refer toCarrier's product security advisory CARR-PSA-2025-02. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "CISA Releases Advisory on Lessons Learned from an Incident Response Engagement",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/23/cisa-releases-advisory-lessons-learned-incident-response-engagement",
      "published": "Tue, 23 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "SonicWall Releases Advisory for Customers after Security Incident",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/22/sonicwall-releases-advisory-customers-after-security-incident",
      "published": "Mon, 22 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Malicious Listener for Ivanti Endpoint Mobile Management Systems",
      "link": "https://www.cisa.gov/news-events/analysis-reports/ar25-261a",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/ACISA recommends organizations implement the mitigations below to improve your organization’s cybersecurity posture on the basis of the threat actors’ activity. These mitigations align with theCross-Sector Cybersecurity Performance Goals (CPGs)developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. Visit CISA’sCPGs webpagefor more information on the CPGs, including additional recommended baseline protections. Upgrade Ivanti EPMM versions to the latest versionas soon as possible. Treat mobile device management (MDM) systems as high-value assets (HVAs)with additional restrictions and monitoring. MDM systems provide elevated access to thousands of hosts and should be treated as HVAs with additional restrictions and monitoring. Follow best cybersecurity practices in production and enterprise environments, including mandating phishing-resistant multifactor authentication (MFA) for all staff and services. For additional best practices, see CISA’sCross-Sector Cybersecurity Performance Goals (CPGs)."
    },
    {
      "title": "Cognex In-Sight Explorer and In-Sight Camera Firmware",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-06",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Cognex",
      "affected_products": "N/AThe following Cognex products are affected: In-Sight 2000 series: Versions 5.x up to and including 6.5.1 In-Sight 7000 series: Versions 5.x up to and including 6.5.1 In-Sight 8000 series: Versions 5.x up to and including 6.5.1 In-Sight 9000 series: Versions 5.x up to and including 6.5.1 In-Sight Explorer: Versions 5.x up to and including 6.5.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION: Exploitable remotely/low attack complexity Vendor: Cognex Equipment: In-Sight Explorer, In-Sight Camera Firmware Vulnerabilities: Use of Hard-coded Password, Cleartext Transmission of Sensitive Information, Incorrect Default Permissions, Improper Restriction of Excessive Authentication Attempts, Incorrect Permission Assignment for Critical Resource, Authentication Bypass by Capture-replay, Client-Side Enforcement of Server-Side Security",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to disclose sensitive information, steal credentials, modify files, or cause a denial-of-service condition.",
      "vulnerability_overview": "N/AAn attacker with adjacent access, without authentication, can exploit this vulnerability to retrieve a hard-coded password embedded in publicly available software. This password can then be used to decrypt sensitive network traffic, affecting the Cognex device. CVE-2025-54754has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54754. A base score of 8.6 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). An adjacent attacker without authentication can exploit this vulnerability to retrieve a set of user-privileged credentials. These credentials are present during the firmware upgrade procedure. CVE-2025-47698has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-47698. A base score of 8.6 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). A local attacker with low privileges on the Windows system where the software is installed can exploit this vulnerability to corrupt sensitive data. A data folder is created with very weak privileges, allowing any user logged into the Windows system to modify its content. CVE-2025-53947has been assigned to this vulnerability. A CVSS v3.1 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-53947. A base score of 6.9 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes a telnet-based service on port 23 in order to allow management operations on the device such as firmware upgrades and device reboot requiring an authentication. A wrong management of login failures of the service causes a DoS attack, leaving the telnet service into an unreachable state. CVE-2025-54860has been assigned to this vulnerability. A CVSS v3.1 base score of 7.7 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54860. A base score of 6.9 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes a Telnet-based service on port 23 to allow management operations such as firmware upgrades and device reboots, which require authentication. A user with protected privileges can successfully invoke the SetSystemConfig functionality to modify relevant device properties (such as network settings), contradicting the security model proposed in the user manual. CVE-2025-52873has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-52873. A base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes a Telnet-based service on port 23 to allow management operations such as firmware upgrades and device reboots, which require authentication. A user with protected privileges can successfully invoke the SetSerialPort functionality to modify relevant device properties (such as serial interface settings), contradicting the security model proposed in the user manual. CVE-2025-54497has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54497. A base score of 7.2 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes a proprietary protocol on TCP port 1069 to perform management operations such as modifying system properties. The user management functionality handles sensitive data such as registered usernames and passwords over an unencrypted channel, allowing an adjacent attacker to intercept valid credentials to gain access to the device. CVE-2025-54818has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54818. A base score of 8.6 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes three protocols that require user authentication to be accessible, which share the same authentication scheme. The authentication mechanism is based on a username and password. Communication occurs over an unencrypted channel, with the password encrypted to mitigate data leakage. However, the same encryption key is repeatedly used across multiple sessions, allowing an attacker monitoring network traffic to capture the encrypted password and carry out a replay attack to gain unauthorized access. CVE-2025-54810has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is (AV:A/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54810. A base score of 8.6 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). The device exposes a service implementing a proprietary protocol on TCP port 1069 to allow the client-side software, such as the In-Sight Explorer tool, to perform management operations such as changing network settings or modifying users' access to the device. CVE-2025-53969has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-53969. A base score of 8.6 has been calculated; the CVSS vector string is (AV:A/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ACognex reports that In-Sight Explorer based vision systems are legacy products not intended for new applications. To reduce risk, asset owners are advised to switch to next generation In-Sight Vision Suite based vision systems, such as the In-Sight 2800, In-Sight 3800, In-Sight 8900 series embedded cameras. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Malware Analysis Report on Malicious Listener Targeting Ivanti Endpoint Manager Mobile Systems",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/18/cisa-releases-malware-analysis-report-malicious-listener-targeting-ivanti-endpoint-manager-mobile",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Westermo Network Technologies WeOS 5",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-02",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Westermo",
      "affected_products": "N/AWestermo reports following versions of WeOS 5, an industrial network operating system, are affected: WeOS 5: Versions 5.23.0 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.2 ATTENTION: Exploitable remotely Vendor: Westermo Network Technologies Equipment: WeOS 5 Vulnerability: Improper Validation of Syntactic Correctness of Input",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could cause the device to reboot.",
      "vulnerability_overview": "N/AWhen configured for IPSec, a Westermo device running WeOS 5 could be vulnerable to a denial-of-service attack. A specifically crafted ESP packet could trigger an immediate reboot of the device. CVE-2025-46419has been assigned to this vulnerability. A CVSS v3.1 base score of 5.9 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-46419. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AWestermo recommends upgrading to thelatest WeOS 5 version available.The vulnerability has been addressed and removed in WeOS 5 Version 5.24.0. This version is available for download on the Westermo Network Technologies support site. For more information refer toWestermo's security advisory Westermo-25-02. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "CISA Releases Nine Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/18/cisa-releases-nine-industrial-control-systems-advisories",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Hitachi Energy Service Suite",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-05",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/AHitachi Energy reports that the following products are affected: Service Suite: Versions prior to 9.6.0.4 EP4",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Hitachi Energy Equipment: Service Suite Vulnerability: Deserialization of Untrusted Data",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow attackers to compromise Oracle WebLogic Server, resulting in potential impacts on confidentiality, integrity, and availability.",
      "vulnerability_overview": "N/AEasily exploitable vulnerability allows unauthenticated attacker with network access via IIOP, T3 to compromise Oracle WebLogic Server. Successful attacks of this vulnerability can result in takeover of Oracle WebLogic Server. CVE-2020-2883has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2020-2883. A base score of 9.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AHitachi Energy has identified the following specific workarounds and mitigations users can apply to reduce risk: Service Suite versions prior to 9.6.0.4 EP4: Update to version 9.8.2 or latest- Hitachi Energy recommends that customers apply the update at the earliest convenience - While reviewing the recommended immediate actions, assess the risk exposure of affected products within the operational environment and update or upgrade if necessary. Service Suite versions prior to 9.6.0.4 EP4: Apply general Mitigation Factors. For more information see the associated Hitachi Energy PSIRT security advisory 8DBD000215Remote Code Execution Vulnerability in Hitachi Energy Service Suite Product. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Hitachi Energy Asset Suite",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-04",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/AHitachi Energy reports that the following products are affected: Asset Suite: Versions 9.6.4.5 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Hitachi Energy Equipment: Asset Suite Vulnerabilities: Server-Side Request Forgery (SSRF), Deserialization of Untrusted Data, Cleartext Storage of Sensitive Information, Uncontrolled Resource Consumption, URL Redirection to Untrusted Site ('Open Redirect'), Improper Authentication",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow attackers to trigger resource consumption or information disclosure through SSRF in Apache XML Graphics Batik, mount a Denial-Of-Service attack via poisoned data in logback, discover cleartext passwords in H2 Database Engine, fill up the file system in Apache CXF, perform open redirect or SSRF attacks through UriComponentsBuilder, and execute arbitrary code in Apache ActiveMQ.",
      "vulnerability_overview": "N/AServer-Side Request Forgery (SSRF) vulnerability in Apache Software Foundation Apache XML Graphics Batik. This issue affects Apache XML Graphics Batik: 1.16. On version 1.16, a malicious SVG could trigger loading external resources by default, causing resource consumption or in some cases even information disclosure. CVE-2022-44729has been assigned to this vulnerability. A CVSS v3.1 base score of 7.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2022-44729. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:N/UI:P/VC:H/VI:N/VA:H/SC:N/SI:N/SA:N). A serialization vulnerability in logback receiver component part of logback version 1.4.11 allows an attacker to mount a Denial-of-Service attack by sending poisoned data. This vulnerability affects logback versions prior to 1.2.13, 1.3.12 and 1.4.12. CVE-2023-6378has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2023-6378. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N). The web-based admin console in H2 Database Engine before 2.2.220 can be started via the CLI with the argument -webAdminPassword, which allows the user to specify the password in cleartext for the web admin console. Consequently, a local user (or an attacker that has obtained local access through some means) would be able to discover the password by listing processes and their arguments. The issue was fixed in 2.2.220 by the vendor H2. CVE-2022-45868has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2022-45868. A base score of 8.5 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). A potential denial of service vulnerability is present in versions of Apache CXF before 3.5.10, 3.6.5 and 4.0.6. In some edge cases, the CachedOutputStream instances may not be closed and, if backed by temporary files, may fill up the file system (it applies to servers and clients). CVE-2025-23184has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-23184. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). Applications that use UriComponentsBuilder to parse an externally provided URL (e.g. through a query parameter) AND perform validation checks on the host of the parsed URL may be vulnerable to a open redirect attack or to a SSRF attack if the URL is used after passing validation checks. CVE-2024-22262has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2024-22262. A base score of 8.6 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:P/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N). In Apache ActiveMQ, once a user is authenticated on Jolokia, the user can potentially trigger arbitrary code execution. In details, in ActiveMQ configurations, jetty allows org.jolokia.http.AgentServlet to handle request to /api/jolokia org.jolokia.http.HttpRequestHandler#handlePostRequest is able to create JmxRequest through JSONObject. And calls to org.jolokia.http.HttpRequestHandler#executeRequest. Into deeper calling stacks, org.jolokia.handler.ExecHandler#doHandleRequest can be invoked through reflection. This could lead to RCE through via various mbeans. CVE-2022-41678has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2022-41678. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AHitachi Energy has identified the following specific workarounds and mitigations users can apply to reduce risk: Asset Suite versions 9.6.4.5 and prior: Apply general mitigation factors (CVE-2022-44729, CVE-2023-6378, CVE-2022-45868, CVE-2025-23184, CVE-2024-22262) Asset Suite versions 9.6.4.5 and prior: Upgrade to version 9.7 (CVE-2022-41678) Asset Suite versions 9.6.4.5 and prior: Upgrade to version 9.8 when available For more information see the associated Hitachi Energy PSIRT security advisory 8DBD000221Multiple Open-Source Software Vulnerabilities in Hitachi Energy Asset Suite Product. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Schneider Electric Saitel DR & Saitel DP Remote Terminal Unit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-03",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Schneider Electric Saitel DR RTU: Versions 11.06.29 and prior Schneider Electric Saitel DP RTU: Versions 11.06.33 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 5.8 ATTENTION: Low Attack Complexity Vendor: Schneider Electric Equipment: Saitel DR RTU Vulnerabilities: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could enable an attacker to execute arbitrary shell commands on the affected devices.",
      "vulnerability_overview": "N/AAn OS command injection vulnerability exists that could cause the execution of any shell command when executing a netstat command using BLMon Console in an SSH session. CVE-2025-9996has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-9996. A base score of 5.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:P/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N). CWE-78: Improper Neutralization of Special Elements used in an OS Command vulnerability exists that could cause command injection in BLMon that is executed in the operating system console when in an SSH session. CVE-2025-9997has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-9997. A base score of 5.8 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:P/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Schneider Electric Saitel DR RTU Versions 11.06.29 and prior:HUe Firmware version 11.06.30of Saitel DR includes a fix for this vulnerability and is available for download. A reboot is necessary to complete the firmware upgrade. Schneider Electric Saitel DP RTU Versions 11.06.33 and prior:Firmware SM_CPU866e version 11.06.34of Saitel DP includes a fix for this vulnerability and is available for download. A reboot is necessary to complete the firmware upgrade. Schneider Electric recommends that users follow appropriate patching methodologies when applying these patches to their systems. They strongly recommend the use of back-ups and evaluating the impact of these patches in a Test and Development environment or on an offline infrastructure. Contact Schneider Electric'sCustomer Care Centerfor assistance removing a patch. If users are unable to apply these patches, Schneider Electric recommends immediately applying the following mitigations to reduce the risk of exploitation: Restrict access to BLMon by assigning permissions only to a limited set of user roles. Ensure users are assigned the least privileged role that still allows them to perform their designated tasks. Implement firewall rules to restrict SSH connections to the device. Schneider Electric strongly recommends the following industry cybersecurity best practices. Locate control and safety system networks and remote devices behind firewalls and isolate them from the business network. Install physical controls so no unauthorized personnel can access your industrial control and safety systems, components, peripheral equipment, and networks. Place all controllers in locked cabinets and never leave them in the \"Program\" mode. Never connect programming software to any network other than the network intended for that device. Scan all methods of mobile data exchange with the isolated network such as CDs, USB drives, etc. before use in the terminals or any node connected to these networks. Never allow mobile devices that have connected to any other network besides the intended network to connect to the safety or control networks without proper sanitation. Minimize network exposure for all control system devices and systems and ensure that they are not accessible from the Internet. When remote access is required, use secure methods, such as Virtual Private Networks (VPNs). Recognize that VPNs may have vulnerabilities and should be updated to the most current version available. Also, understand that VPNs are only as secure as the connected devices. For more information refer to the Schneider ElectricRecommended Cybersecurity Best Practicesdocument. For more information see the associated Schneider Electric CPCERT security advisory SEVD-2025-252-02Saitel DR & Saitel DP Remote Terminal Unit - SEVD-2025-252-02 PDF Version,Saitel DR & Saitel DP Remote Terminal Unit - SEVD-2025-252-02 CSAF Version. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely."
    },
    {
      "title": "Dover Fueling Solutions ProGauge MagLink LX4 Devices",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-07",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of ProGauge MagLink LX, a fuel and water tank monitor, are affected: ProGauge MagLink LX 4: Versions prior to 4.20.3 ProGauge MagLink LX Plus: Versions prior to 4.20.3 ProGauge MagLink LX Ultimate: Versions prior to 5.20.3",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION:Exploitable remotely/Low attack complexity Vendor:Dover Fueling Solutions Equipment:ProGauge MagLink LX4, ProGauge MagLink LX4 Plus, ProGauge MagLink LX4 Ultimate Vulnerabilities:Integer Overflow or Wraparound, Use of Hard-coded Cryptographic Key, Use of Weak Credentials",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in a remote attacker causing a denial-of-service condition or gaining administrative access to the device.",
      "vulnerability_overview": "N/AAffected devices fail to handle Unix time values beyond a certain point. An attacker can manually change the system time to exploit this limitation, potentially causing errors in authentication and leading to a denial-of-service condition. CVE-2025-55068has been assigned to this vulnerability. A CVSS v3 base score of 8.2 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-55068. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:L/VA:H/SC:N/SI:N/SA:N). The secret used for validating authentication tokens is hardcoded in device firmware for affected versions. An attacker who obtains the signing key can bypass authentication, gaining complete access to the system. CVE-2025-54807has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-54807. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Affected versions of the device have default root credentials that cannot be changed through standard administrative means. An attacker with network access to the device can gain administrative access to the system. CVE-2025-30519has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-30519. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ADover Fueling Solutions recommends users update their ProGauge MagLink devices to Version 4.20.3 or later for MagLink LX 4 and MagLink LX Plus models. The upgrade can be downloaded from the Dover Fueling Solutionswebsite. For MagLink LX Ultimate devices, Dover Fueling Solutions recommends usersupdate to version 5.20.3or later. Dover Fueling Solutions recommends all users install the software behind a firewall to minimize risk of remote attacks. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Westermo Network Technologies WeOS 5",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-261-01",
      "published": "Thu, 18 Sep 25 12:00:00 +0000",
      "vendor": "Westermo",
      "affected_products": "N/AWestermo reports following versions of WeOS 5, an industrial network operating system, are affected: WeOS 5: Versions 5.24 and later",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely Vendor: Westermo Network Technologies Equipment: WeOS 5 Vulnerability: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker with administrative permissions to execute commands that would typically be inaccessible. This could allow the execution of commands with privileges beyond those normally granted to the attacker.",
      "vulnerability_overview": "N/AWestermo has identified a vulnerability in WeOS 5 that could potentially be used to inject OS commands due to unsafe handling of media definitions. CVE-2025-46418has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-46418. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:H/AT:N/PR:H/UI:A/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H).",
      "mitigations": "N/AWestermo recommends the following mitigations which do not require a software update: Limit administration account access to trusted parties. Use best practices for passwords related to administration accounts. For more information refer toWestermo's security advisory Westermo-25-07. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Schneider Electric Altivar Products, ATVdPAC Module, ILC992 InterLink Converter",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-259-01",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Schneider  Electric",
      "affected_products": "N/ASchneider Electric reports that the following products are affected: Schneider Electric ATVdPAC module: Versions prior to 25.0 Schneider Electric Altivar Process Drives ATV930: All versions Schneider Electric Altivar Process Drives ATV950: All versions Schneider Electric Altivar Process Drives ATV955: All versions Schneider Electric Altivar Process Drives ATV960: All versions Schneider Electric Altivar Process Drives ATV980: All versions Schneider Electric Altivar Process Drives ATV9A0: All versions Schneider Electric Altivar Process Drives ATV9B0: All versions Schneider Electric Altivar Process Drives ATV9L0: All versions Schneider Electric Altivar Process Drives ATV991: All versions Schneider Electric Altivar Process Drives ATV992: All versions Schneider Electric Altivar Process Drives ATV993: All versions Schneider Electric ILC992 InterLink Converter: All versions Schneider Electric Altivar Machine Drives ATV340E: All versions Schneider Electric Altivar Process Drives ATV6000 Medium Voltage: All versions Schneider Electric Altivar Soft Starter ATS490: All versions Schneider Electric Altivar Process Communication Modules VW3A3720: All versions Schneider Electric Altivar Process Communication Modules VW3A3721: All versions Schneider Electric Altivar Process Drives ATV630: All versions Schneider Electric Altivar Process Drives ATV650: All versions Schneider Electric Altivar Process Drives ATV660: All versions Schneider Electric Altivar Process Drives ATV680: All versions Schneider Electric Altivar Process Drives ATV6A0: All versions Schneider Electric Altivar Process Drives ATV6B0: All versions Schneider Electric Altivar Process Drives ATV6L0: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 5.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Schneider Electric Equipment: Altivar products, ATVdPAC module, ILC992 InterLink Converter Vulnerability: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to read or modify data.",
      "vulnerability_overview": "N/AImproper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability exists that could cause an unvalidated data injected by a malicious user potentially leading to modify or read data in a victim's browser. CVE-2025-7746has been assigned to this vulnerability. A CVSS v3.1 base score of 6.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N). A CVSS v4 score has also been calculated forCVE-2025-7746. A base score of 5.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:P/VC:N/VI:N/VA:N/SC:L/SI:L/SA:N).",
      "mitigations": "N/ASchneider Electric has identified the following specific workarounds and mitigations users can apply to reduce risk: Schneider Electric ATVdPAC module Versions prior to 25.0: Version 25.0 of VW3A3530D: ATVdPAC module includes a fix for this vulnerability and is available upon request from Schneider Electric's Customer Care Center. Schneider Electric ATVdPAC module Versions prior to 25.0: If users choose not to apply the remediation provided above, they should immediately apply the following mitigations to reduce the risk of exploit: End user cybersecurity awareness and workstation protections, Deactivate the Webserver after use when not needed, Setup network segmentation and implement a firewall to block all unauthorized access to port 80/HTTP, Use VPN (Virtual Private Networks) tunnels if remote access is required Schneider Electric ATV630 Altivar Process Drives All Versions, Schneider Electric ATV650 Altivar Process Drives All Versions, Schneider Electric ATV660 Altivar Process Drives All Versions, Schneider Electric ATV680 Altivar Process Drives All Versions, Schneider Electric ATV6A0 Altivar Process Drives All Versions, Schneider Electric ATV6B0 Altivar Process Drives All Versions, Schneider Electric ATV6L0 Altivar Process Drives All Versions, Schneider Electric ATV930 Altivar Process Drives All Versions, Schneider Electric ATV950 Altivar Process Drives All Versions, Schneider Electric ATV955 Altivar Process Drives All Versions, Schneider Electric ATV960 Altivar Process Drives All Versions, Schneider Electric ATV980 Altivar Process Drives All Versions, Schneider Electric ATV9A0 Altivar Process Drives All Versions, Schneider Electric ATV9B0 Altivar Process Drives All Versions, Schneider Electric ATV9L0 Altivar Process Drives All Versions, Schneider Electric ATV991 Altivar Process Drives All Versions, Schneider Electric ATV992 Altivar Process Drives All Versions, Schneider Electric ATV993 Altivar Process Drives All Versions, Schneider Electric ILC992 InterLink Converter All Versions, Schneider Electric ATV340E Altivar Machine Drives All Versions, Schneider Electric ATV6000 Medium Voltage Altivar Process Drives All Versions, Schneider Electric ATS490 Altivar Soft Starter All Versions, Schneider Electric Altivar Process Communication Modules All Versions: Schneider Electric is establishing a remediation plan for all future versions of these products that will include a fix for this vulnerability. Until then, users should immediately apply the following mitigations to reduce the risk of exploit: End user cybersecurity awareness and workstation protections, Deactivate the Webserver after use when not needed, Setup network segmentation and implement a firewall to block all unauthorized access to port 80/HTTP, Use VPN (Virtual Private Networks) tunnels if remote access is required. The following product version has been fixed: ATVdPAC module Version 25.0 is a fixed version for CVE-2025-7746 For more information see the associated Schneider Electric CPCERT security advisory SEVD-2025-252-01Multiple Altivar Process Drives and Communication Modules - SEVD-2025-252-01 PDF Version,Multiple Altivar Process Drives and Communication Modules - SEVD-2025-252-01 CSAF Version. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens OpenSSL Vulnerability in Industrial Products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-259-05",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens Industrial Edge - Machine Insight App: All versions Siemens RUGGEDCOM ROX RX1510: All versions prior to V2.15.0 Siemens SCALANCE X201-3P IRT PRO (6GK5201-3JR00-2BA6): All versions prior to V5.5.2 Siemens SCALANCE X202-2IRT (6GK5202-2BB00-2BA3): All versions prior to V5.5.2 Siemens SCALANCE X202-2P IRT (6GK5202-2BH00-2BA3): All versions prior to V5.5.2 Siemens SCALANCE X202-2P IRT PRO (6GK5202-2JR00-2BA6): All versions prior to V5.5.2 Siemens SCALANCE X204-2 (6GK5204-2BB10-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X204-2FM (6GK5204-2BB11-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X204-2LD (6GK5204-2BC10-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X204-2LD TS (6GK5204-2BC10-2CA2): All versions prior to V5.2.6 Siemens SCALANCE X204-2TS (6GK5204-2BB10-2CA2): All versions prior to V5.2.6 Siemens SCALANCE X204IRT (6GK5204-0BA00-2BA3): All versions prior to V5.5.2 Siemens RUGGEDCOM ROX RX1511: All versions prior to V2.15.0 Siemens SCALANCE X204IRT PRO (6GK5204-0JA00-2BA6): All versions prior to V5.5.2 Siemens SCALANCE X206-1 (6GK5206-1BB10-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X206-1LD (6GK5206-1BC10-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X208 (6GK5208-0BA10-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X208PRO (6GK5208-0HA10-2AA6): All versions prior to V5.2.6 Siemens SCALANCE X212-2 (6GK5212-2BB00-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X212-2LD (6GK5212-2BC00-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X216 (6GK5216-0BA00-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X224 (6GK5224-0BA00-2AA3): All versions prior to V5.2.6 Siemens SCALANCE X302-7 EEC (230V, coated) (6GK5302-7GD00-3GA3): All versions prior to V4.1.4 Siemens RUGGEDCOM ROX RX1512: All versions prior to V2.15.0 Siemens SCALANCE X302-7 EEC (230V) (6GK5302-7GD00-3EA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (24V, coated) (6GK5302-7GD00-1GA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (24V) (6GK5302-7GD00-1EA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (2x 230V, coated) (6GK5302-7GD00-4GA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (2x 230V) (6GK5302-7GD00-4EA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (2x 24V, coated) (6GK5302-7GD00-2GA3): All versions prior to V4.1.4 Siemens SCALANCE X302-7 EEC (2x 24V) (6GK5302-7GD00-2EA3): All versions prior to V4.1.4 Siemens SCALANCE X304-2FE (6GK5304-2BD00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X306-1LD FE (6GK5306-1BF00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (230V, coated) (6GK5307-2FD00-3GA3): All versions prior to V4.1.4 Siemens RUGGEDCOM ROX RX1524: All versions prior to V2.15.0 Siemens SCALANCE X307-2 EEC (230V) (6GK5307-2FD00-3EA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (24V, coated) (6GK5307-2FD00-1GA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (24V) (6GK5307-2FD00-1EA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (2x 230V, coated) (6GK5307-2FD00-4GA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (2x 230V) (6GK5307-2FD00-4EA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (2x 24V, coated) (6GK5307-2FD00-2GA3): All versions prior to V4.1.4 Siemens SCALANCE X307-2 EEC (2x 24V) (6GK5307-2FD00-2EA3): All versions prior to V4.1.4 Siemens SCALANCE X307-3 (6GK5307-3BL00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X307-3 (6GK5307-3BL10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X307-3LD (6GK5307-3BM10-2AA3): All versions prior to V4.1.4 Siemens RUGGEDCOM ROX RX1536: All versions prior to V2.15.0 Siemens SCALANCE X307-3LD (6GK5307-3BM00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2 (6GK5308-2FL00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2 (6GK5308-2FL10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LD (6GK5308-2FM00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LD (6GK5308-2FM10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LH (6GK5308-2FN00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LH (6GK5308-2FN10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LH+ (6GK5308-2FP00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2LH+ (6GK5308-2FP10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X308-2M (6GK5308-2GG00-2AA2): All versions prior to V4.1.4 Siemens RUGGEDCOM ROX RX5000: All versions prior to V2.15.0 Siemens SCALANCE X308-2M (6GK5308-2GG10-2AA2): All versions prior to V4.1.4 Siemens SCALANCE X308-2M PoE (6GK5308-2QG00-2AA2): All versions prior to V4.1.4 Siemens SCALANCE X308-2M PoE (6GK5308-2QG10-2AA2): All versions prior to V4.1.4 Siemens SCALANCE X308-2M TS (6GK5308-2GG00-2CA2): All versions prior to V4.1.4 Siemens SCALANCE X308-2M TS (6GK5308-2GG10-2CA2): All versions prior to V4.1.4 Siemens SCALANCE X310 (6GK5310-0FA00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X310 (6GK5310-0FA10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X310FE (6GK5310-0BA00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X310FE (6GK5310-0BA10-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X320-1 FE (6GK5320-1BD00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE M804PB (6GK5804-0AP00-2AA2): All versions prior to V7.1 Siemens SCALANCE X320-1-2LD FE (6GK5320-3BF00-2AA3): All versions prior to V4.1.4 Siemens SCALANCE X408-2 (6GK5408-2FD00-2AA2): All versions prior to V4.1.4 Siemens SCALANCE XF201-3P IRT (6GK5201-3BH00-2BD2): All versions prior to V5.5.2 Siemens SCALANCE XF202-2P IRT (6GK5202-2BH00-2BD2): All versions prior to V5.5.2 Siemens SCALANCE XF204 (6GK5204-0BA00-2AF2): All versions prior to V5.2.6 Siemens SCALANCE XF204-2 (6GK5204-2BC00-2AF2): All versions prior to V5.2.6 Siemens SCALANCE XF204-2BA IRT (6GK5204-2AA00-2BD2): All versions prior to V5.5.2 Siemens SCALANCE XF204IRT (6GK5204-0BA00-2BF2): All versions prior to V5.5.2 Siemens SCALANCE XF206-1 (6GK5206-1BC00-2AF2): All versions prior to V5.2.6 Siemens SCALANCE XF208 (6GK5208-0BA00-2AF2): All versions prior to V5.2.6 Siemens SCALANCE M812-1 ADSL-Router (Annex A) (6GK5812-1AA00-2AA2): All versions prior to V7.1 Siemens SCALANCE XR324-12M (230V, ports on front) (6GK5324-0GG00-3AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (230V, ports on front) (6GK5324-0GG10-3AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (230V, ports on rear) (6GK5324-0GG00-3HR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (230V, ports on rear) (6GK5324-0GG10-3HR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (24V, ports on front) (6GK5324-0GG00-1AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (24V, ports on front) (6GK5324-0GG10-1AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (24V, ports on rear) (6GK5324-0GG00-1HR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M (24V, ports on rear) (6GK5324-0GG10-1HR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M TS (24V) (6GK5324-0GG00-1CR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-12M TS (24V) (6GK5324-0GG10-1CR2): All versions prior to V4.1.4 Siemens SCALANCE M812-1 ADSL-Router (Annex B) (6GK5812-1BA00-2AA2): All versions prior to V7.1 Siemens SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on front) (6GK5324-4GG00-3ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on front) (6GK5324-4GG10-3ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG00-3JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG10-3JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (24V, ports on front) (6GK5324-4GG00-1ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (24V, ports on front) (6GK5324-4GG10-1ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (24V, ports on rear) (6GK5324-4GG00-1JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (24V, ports on rear) (6GK5324-4GG10-1JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on front) (6GK5324-4GG00-4ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on front) (6GK5324-4GG10-4ER2): All versions prior to V4.1.4 Siemens SCALANCE M816-1 ADSL-Router (Annex A) (6GK5816-1AA00-2AA2): All versions prior to V7.1 Siemens SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG00-4JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG10-4JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 24V, ports on front) (6GK5324-4GG00-2ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 24V, ports on front) (6GK5324-4GG10-2ER2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 24V, ports on rear) (6GK5324-4GG00-2JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M EEC (2x 24V, ports on rear) (6GK5324-4GG10-2JR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M PoE (230V, ports on front) (6GK5324-4QG00-3AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M PoE (230V, ports on rear) (6GK5324-4QG00-3HR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M PoE (24V, ports on front) (6GK5324-4QG00-1AR2): All versions prior to V4.1.4 Siemens SCALANCE XR324-4M PoE (24V, ports on rear) (6GK5324-4QG00-1HR2): All versions prior to V4.1.4 Siemens Industrial Edge - PROFINET IO Connector: All versions prior to V1.1.1 Siemens SCALANCE M816-1 ADSL-Router (Annex B) (6GK5816-1BA00-2AA2): All versions prior to V7.1 Siemens SCALANCE XR324-4M PoE TS (24V, ports on front) (6GK5324-4QG00-1CR2): All versions prior to V4.1.4 Siemens SIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0): All versions prior to V3.3.46 Siemens SIMATIC CP 1243-1 (6GK7243-1BX30-0XE0): All versions prior to V3.3.46 Siemens SIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0): All versions prior to V3.3.46 Siemens SIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0): All versions prior to V3.3.46 Siemens SIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0): All versions prior to V3.3.46 Siemens SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0): All versions prior to V2.2.28 Siemens SIMATIC CP 1543-1 (6GK7543-1AX00-0XE0): All versions prior to V3.0.22 Siemens SIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0): All versions prior to V2.2.28 Siemens SIMATIC CP 1545-1 (6GK7545-1GX00-0XE0): All versions prior to V1.1 Siemens SCALANCE M826-2 SHDSL-Router (6GK5826-2AB00-2AB2): All versions prior to V7.1 Siemens SIMATIC PCS neo (Administration Console): All versions < V3.1 SP 1 Siemens SIMATIC Process Historian OPC UA Server: All versions prior to V2020 SP1 Siemens SIMATIC S7-1200 CPU family (incl. SIPLUS variants): All versions prior to V4.5.2 Siemens SINEC NMS: All versions prior to V1.0.3 Siemens SINEMA Remote Connect Server: All versions prior to V3.1 Siemens SINEMA Server V14: All versions Siemens SINUMERIK Operate: All versions prior to V4.95 SP1 Siemens SIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0): All versions prior to V2.2.28 Siemens SIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0): All versions prior to V2.2.28 Siemens SIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0): All versions prior to V3.3.46 Siemens SCALANCE M874-2 (6GK5874-2AA00-2AA2): All versions prior to V7.1 Siemens SIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): All versions prior to V3.0.22 Siemens SIPLUS NET SCALANCE X308-2 (6AG1308-2FL10-4AA3): All versions prior to V4.1.4 Siemens SIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0): All versions prior to V3.3.46 Siemens SIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): All versions prior to V3.3.46 Siemens TIA Administrator: All versions < V1.0 SP7 Siemens SCALANCE M874-3 (6GK5874-3AA00-2AA2): All versions prior to V7.1 Siemens SCALANCE M876-3 (EVDO) (6GK5876-3AA02-2BA2): All versions prior to V7.1 Siemens SCALANCE M876-3 (ROK) (6GK5876-3AA02-2EA2): All versions prior to V7.1 Siemens SCALANCE M876-4 (EU) (6GK5876-4AA00-2BA2): All versions prior to V7.1 Siemens SCALANCE M876-4 (NAM) (6GK5876-4AA00-2DA2): All versions prior to V7.1 Siemens SCALANCE MUM853-1 (EU) (6GK5853-2EA00-2DA1): All versions prior to V7.1 Siemens SCALANCE MUM856-1 (EU) (6GK5856-2EA00-3DA1): All versions prior to V7.1 Siemens RUGGEDCOM RM1224 LTE(4G) EU (6GK6108-4AM00-2BA2): All versions prior to V7.1 Siemens SCALANCE MUM856-1 (RoW) (6GK5856-2EA00-3AA1): All versions prior to V7.1 Siemens SCALANCE S615 (6GK5615-0AA00-2AA2): All versions prior to V7.1 Siemens SCALANCE SC622-2C (6GK5622-2GS00-2AC2): All versions prior to V2.3 Siemens SCALANCE SC632-2C (6GK5632-2GS00-2AC2): All versions prior to V2.3 Siemens SCALANCE SC636-2C (6GK5636-2GS00-2AC2): All versions prior to V2.3 Siemens SCALANCE SC642-2C (6GK5642-2GS00-2AC2): All versions prior to V2.3 Siemens SCALANCE SC646-2C (6GK5646-2GS00-2AC2): All versions prior to V2.3 Siemens SCALANCE W1748-1 M12 (6GK5748-1GY01-0TA0): All versions prior to V3.0.0 Siemens SCALANCE W1748-1 M12 (6GK5748-1GY01-0AA0): All versions prior to V3.0.0 Siemens SCALANCE W1788-1 M12 (6GK5788-1GY01-0AA0): All versions prior to V3.0.0 Siemens RUGGEDCOM RM1224 LTE(4G) NAM (6GK6108-4AM00-2DA2): All versions prior to V7.1 Siemens SCALANCE W1788-2 EEC M12 (6GK5788-2GY01-0TA0): All versions prior to V3.0.0 Siemens SCALANCE W1788-2 M12 (6GK5788-2GY01-0AA0): All versions prior to V3.0.0 Siemens SCALANCE W1788-2IA M12 (6GK5788-2HY01-0AA0): All versions prior to V3.0.0 Siemens SCALANCE W721-1 RJ45 (6GK5721-1FC00-0AA0): All versions Siemens SCALANCE W721-1 RJ45 (6GK5721-1FC00-0AB0): All versions Siemens SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AA0): All versions Siemens SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AB0): All versions Siemens SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AC0): All versions Siemens SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AA0): All versions Siemens SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AB0): All versions Siemens RUGGEDCOM ROX MX5000: All versions prior to V2.15.0 Siemens SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AA6): All versions Siemens SCALANCE W734-1 RJ45 (USA) (6GK5734-1FX00-0AB6): All versions Siemens SCALANCE W738-1 M12 (6GK5738-1GY00-0AA0): All versions Siemens SCALANCE W738-1 M12 (6GK5738-1GY00-0AB0): All versions Siemens SCALANCE W748-1 M12 (6GK5748-1GD00-0AA0): All versions Siemens SCALANCE W748-1 M12 (6GK5748-1GD00-0AB0): All versions Siemens SCALANCE W748-1 RJ45 (6GK5748-1FC00-0AA0): All versions Siemens SCALANCE W748-1 RJ45 (6GK5748-1FC00-0AB0): All versions Siemens SCALANCE W761-1 RJ45 (6GK5761-1FC00-0AA0): All versions Siemens SCALANCE W761-1 RJ45 (6GK5761-1FC00-0AB0): All versions Siemens RUGGEDCOM ROX MX5000RE: All versions prior to V2.15.0 Siemens SCALANCE W774-1 M12 EEC (6GK5774-1FY00-0TA0): All versions Siemens SCALANCE W774-1 M12 EEC (6GK5774-1FY00-0TB0): All versions Siemens SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AA0): All versions Siemens SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AB0): All versions Siemens SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AC0): All versions Siemens SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AA6): All versions Siemens SCALANCE W774-1 RJ45 (USA) (6GK5774-1FX00-0AB6): All versions Siemens SCALANCE W778-1 M12 (6GK5778-1GY00-0AA0): All versions Siemens SCALANCE W778-1 M12 (6GK5778-1GY00-0AB0): All versions Siemens SCALANCE W778-1 M12 EEC (6GK5778-1GY00-0TA0): All versions Siemens RUGGEDCOM ROX RX1400: All versions prior to V2.15.0 Siemens SCALANCE W778-1 M12 EEC (USA) (6GK5778-1GY00-0TB0): All versions Siemens SCALANCE W786-1 RJ45 (6GK5786-1FC00-0AA0): All versions Siemens SCALANCE W786-1 RJ45 (6GK5786-1FC00-0AB0): All versions Siemens SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AA0): All versions Siemens SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AB0): All versions Siemens SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AC0): All versions Siemens SCALANCE W786-2 SFP (6GK5786-2FE00-0AA0): All versions Siemens SCALANCE W786-2 SFP (6GK5786-2FE00-0AB0): All versions Siemens SCALANCE W786-2IA RJ45 (6GK5786-2HC00-0AA0): All versions Siemens SCALANCE W786-2IA RJ45 (6GK5786-2HC00-0AB0): All versions Siemens RUGGEDCOM ROX RX1500: All versions prior to V2.15.0 Siemens SCALANCE W788-1 M12 (6GK5788-1GD00-0AA0): All versions Siemens SCALANCE W788-1 M12 (6GK5788-1GD00-0AB0): All versions Siemens SCALANCE W788-1 RJ45 (6GK5788-1FC00-0AA0): All versions Siemens SCALANCE W788-1 RJ45 (6GK5788-1FC00-0AB0): All versions Siemens SCALANCE W788-2 M12 (6GK5788-2GD00-0AA0): All versions Siemens SCALANCE W788-2 M12 (6GK5788-2GD00-0AB0): All versions Siemens SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TA0): All versions Siemens SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TB0): All versions Siemens SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TC0): All versions Siemens SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AA0): All versions Siemens RUGGEDCOM ROX RX1501: All versions prior to V2.15.0 Siemens SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AB0): All versions Siemens SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AC0): All versions Siemens SCALANCE WAM766-1 (EU) (6GK5766-1GE00-7DA0): All versions prior to V1.2 Siemens SCALANCE WAM766-1 (US) (6GK5766-1GE00-7DB0): All versions prior to V1.2 Siemens SCALANCE WAM766-1 EEC (EU) (6GK5766-1GE00-7TA0): All versions prior to V1.2 Siemens SCALANCE WAM766-1 EEC (US) (6GK5766-1GE00-7TB0): All versions prior to V1.2 Siemens SCALANCE WUM766-1 (EU) (6GK5766-1GE00-3DA0): All versions prior to V1.2 Siemens SCALANCE WUM766-1 (US) (6GK5766-1GE00-3DB0): All versions prior to V1.2 Siemens SCALANCE X200-4P IRT (6GK5200-4AH00-2BA3): All versions prior to V5.5.2 Siemens SCALANCE X201-3P IRT (6GK5201-3BH00-2BA3): All versions prior to V5.5.2",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.4 ATTENTION: Exploitable remotely Vendor: Siemens Equipment: INDUSTRIAL EDGE, RUGGEDCOM, SCALANCE, SIMATIC, SINEC, SINEMA, SINUMERIK, SIPLUS, TIA Vulnerability: Out-of-bounds Read",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an unauthenticated remote attacker to execute arbitrary code or to cause a denial-of-service condition.",
      "vulnerability_overview": "N/AASN.1 strings are represented internally within OpenSSL as an ASN1_STRING structure which contains a buffer holding the string data and a field holding the buffer length. This contrasts with normal C strings which are represented as a buffer for the string data which is terminated with a NUL (0) byte. Although not a strict requirement, ASN.1 strings that are parsed using OpenSSL's own \"d2i\" functions (and other similar parsing functions) as well as any string whose value has been set with the ASN1_STRING_set() function will additionally NUL terminate the byte array in the ASN1_STRING structure. However, it is possible for applications to directly construct valid ASN1_STRING structures which do not NUL terminate the byte array by directly setting the \"data\" and \"length\" fields in the ASN1_STRING array. This can also happen by using the ASN1_STRING_set0() function. Numerous OpenSSL functions that print ASN.1 data have been found to assume that the ASN1_STRING byte array will be NUL terminated, even though this is not guaranteed for strings that have been directly constructed. Where an application requests an ASN.1 structure to be printed, and where that ASN.1 structure contains ASN1_STRINGs that have been directly constructed by the application without NUL terminating the \"data\" field, then a read buffer overrun can occur. The same thing can also occur during name constraints processing of certificates (for example if a certificate has been directly constructed by the application instead of loading it via the OpenSSL parsing functions, and the certificate contains non NUL terminated ASN1_STRING structures). It can also occur in the X509_get1_email(), X509_REQ_get1_email() and X509_get1_ocsp() functions. If a malicious actor can cause an application to directly construct an ASN1_STRING and then process it through one of the affected OpenSSL functions then this issue could be hit. This might result in a crash (causing a Denial of Service attack). It could also result in the disclosure of private memory contents (such as private keys, or sensitive plaintext). Fixed in OpenSSL 1.1.1l (Affected 1.1.1-1.1.1k). Fixed in OpenSSL 1.0.2za (Affected 1.0.2-1.0.2y). CVE-2021-3712has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Industrial Edge - Machine Insight App, SCALANCE W721-1 RJ45 (6GK5721-1FC00-0AA0), SCALANCE W721-1 RJ45 (6GK5721-1FC00-0AB0), SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AA0), SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AB0), SCALANCE W722-1 RJ45 (6GK5722-1FC00-0AC0), SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AA0), SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AA6), SCALANCE W734-1 RJ45 (6GK5734-1FX00-0AB0), SCALANCE W734-1 RJ45 (USA) (6GK5734-1FX00-0AB6), SCALANCE W738-1 M12 (6GK5738-1GY00-0AA0), SCALANCE W738-1 M12 (6GK5738-1GY00-0AB0), SCALANCE W748-1 M12 (6GK5748-1GD00-0AA0), SCALANCE W748-1 M12 (6GK5748-1GD00-0AB0), SCALANCE W748-1 RJ45 (6GK5748-1FC00-0AA0), SCALANCE W748-1 RJ45 (6GK5748-1FC00-0AB0), SCALANCE W761-1 RJ45 (6GK5761-1FC00-0AA0), SCALANCE W761-1 RJ45 (6GK5761-1FC00-0AB0), SCALANCE W774-1 M12 EEC (6GK5774-1FY00-0TA0), SCALANCE W774-1 M12 EEC (6GK5774-1FY00-0TB0), SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AA0), SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AA6), SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AB0), SCALANCE W774-1 RJ45 (6GK5774-1FX00-0AC0), SCALANCE W774-1 RJ45 (USA) (6GK5774-1FX00-0AB6), SCALANCE W778-1 M12 (6GK5778-1GY00-0AA0), SCALANCE W778-1 M12 (6GK5778-1GY00-0AB0), SCALANCE W778-1 M12 EEC (6GK5778-1GY00-0TA0), SCALANCE W778-1 M12 EEC (USA) (6GK5778-1GY00-0TB0), SCALANCE W786-1 RJ45 (6GK5786-1FC00-0AA0), SCALANCE W786-1 RJ45 (6GK5786-1FC00-0AB0), SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AA0), SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AB0), SCALANCE W786-2 RJ45 (6GK5786-2FC00-0AC0), SCALANCE W786-2 SFP (6GK5786-2FE00-0AA0), SCALANCE W786-2 SFP (6GK5786-2FE00-0AB0), SCALANCE W786-2IA RJ45 (6GK5786-2HC00-0AA0), SCALANCE W786-2IA RJ45 (6GK5786-2HC00-0AB0), SCALANCE W788-1 M12 (6GK5788-1GD00-0AA0), SCALANCE W788-1 M12 (6GK5788-1GD00-0AB0), SCALANCE W788-1 RJ45 (6GK5788-1FC00-0AA0), SCALANCE W788-1 RJ45 (6GK5788-1FC00-0AB0), SCALANCE W788-2 M12 (6GK5788-2GD00-0AA0), SCALANCE W788-2 M12 (6GK5788-2GD00-0AB0), SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TA0), SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TB0), SCALANCE W788-2 M12 EEC (6GK5788-2GD00-0TC0), SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AA0), SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AB0), SCALANCE W788-2 RJ45 (6GK5788-2FC00-0AC0), SINEMA Server V14: Currently no fix is planned SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0), SIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0), SIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0), SIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0): Update to V2.2.28 orlater version SCALANCE X200-4P IRT (6GK5200-4AH00-2BA3), SCALANCE X201-3P IRT (6GK5201-3BH00-2BA3), SCALANCE X201-3P IRT PRO (6GK5201-3JR00-2BA6), SCALANCE X202-2IRT (6GK5202-2BB00-2BA3), SCALANCE X202-2P IRT (6GK5202-2BH00-2BA3), SCALANCE X202-2P IRT PRO (6GK5202-2JR00-2BA6), SCALANCE X204IRT (6GK5204-0BA00-2BA3), SCALANCE X204IRT PRO (6GK5204-0JA00-2BA6), SCALANCE XF201-3P IRT (6GK5201-3BH00-2BD2), SCALANCE XF202-2P IRT (6GK5202-2BH00-2BD2), SCALANCE XF204-2BA IRT (6GK5204-2AA00-2BD2), SCALANCE XF204IRT (6GK5204-0BA00-2BF2): Update to V5.5.2 orlater version SIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0), SIMATIC CP 1243-1 (6GK7243-1BX30-0XE0), SIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0), SIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0), SIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0), SIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0), SIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0), SIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): Update to V3.3.46 orlater version SINEC NMS: Update to V1.0.3 orlater version SINEMA Remote Connect Server: Update to V3.1 orlater version SIMATIC CP 1545-1 (6GK7545-1GX00-0XE0): Update to V1.1 orlater version SINUMERIK Operate: Upgrade to V4.95 SP1 or later version SINUMERIK software can be obtained from your local Siemens account manager SIMATIC S7-1200 CPU family (incl. SIPLUS variants): Update to V4.5.2 orlater version SIMATIC Process Historian OPC UA Server: Update to V2020 SP1 or later version SIMATIC Process Historian OPC UA Server: For PCS neo customers: Update to PCS neo V3.1 SP1 (https://support.industry.siemens.com/cs/ww/de/view/109807752/) SIMATIC Process Historian OPC UA Server: For PCS 7 customers: Update to PCS 7 V9.1 SP1 (https://support.industry.siemens.com/cs/ww/en/view/109805073/) SIMATIC Process Historian OPC UA Server: For WinCC customers: contact local support TIA Administrator: Update to V1.0 SP7 orlater version SCALANCE SC622-2C (6GK5622-2GS00-2AC2), SCALANCE SC632-2C (6GK5632-2GS00-2AC2), SCALANCE SC636-2C (6GK5636-2GS00-2AC2), SCALANCE SC642-2C (6GK5642-2GS00-2AC2), SCALANCE SC646-2C (6GK5646-2GS00-2AC2): Update to V2.3 orlater version SIMATIC CP 1543-1 (6GK7543-1AX00-0XE0), SIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): Update to V3.0.22 orlater version RUGGEDCOM ROX MX5000, RUGGEDCOM ROX MX5000RE, RUGGEDCOM ROX RX1400, RUGGEDCOM ROX RX1500, RUGGEDCOM ROX RX1501, RUGGEDCOM ROX RX1510, RUGGEDCOM ROX RX1511, RUGGEDCOM ROX RX1512, RUGGEDCOM ROX RX1524, RUGGEDCOM ROX RX1536, RUGGEDCOM ROX RX5000: Update to V2.15.0 orlater version SCALANCE WAM766-1 (EU) (6GK5766-1GE00-7DA0), SCALANCE WAM766-1 (US) (6GK5766-1GE00-7DB0), SCALANCE WAM766-1 EEC (EU) (6GK5766-1GE00-7TA0), SCALANCE WAM766-1 EEC (US) (6GK5766-1GE00-7TB0), SCALANCE WUM766-1 (EU) (6GK5766-1GE00-3DA0), SCALANCE WUM766-1 (US) (6GK5766-1GE00-3DB0): Update to V1.2 orlater version SCALANCE X302-7 EEC (230V, coated) (6GK5302-7GD00-3GA3), SCALANCE X302-7 EEC (230V) (6GK5302-7GD00-3EA3), SCALANCE X302-7 EEC (24V, coated) (6GK5302-7GD00-1GA3), SCALANCE X302-7 EEC (24V) (6GK5302-7GD00-1EA3), SCALANCE X302-7 EEC (2x 230V, coated) (6GK5302-7GD00-4GA3), SCALANCE X302-7 EEC (2x 230V) (6GK5302-7GD00-4EA3), SCALANCE X302-7 EEC (2x 24V, coated) (6GK5302-7GD00-2GA3), SCALANCE X302-7 EEC (2x 24V) (6GK5302-7GD00-2EA3), SCALANCE X304-2FE (6GK5304-2BD00-2AA3), SCALANCE X306-1LD FE (6GK5306-1BF00-2AA3), SCALANCE X307-2 EEC (230V, coated) (6GK5307-2FD00-3GA3), SCALANCE X307-2 EEC (230V) (6GK5307-2FD00-3EA3), SCALANCE X307-2 EEC (24V, coated) (6GK5307-2FD00-1GA3), SCALANCE X307-2 EEC (24V) (6GK5307-2FD00-1EA3), SCALANCE X307-2 EEC (2x 230V, coated) (6GK5307-2FD00-4GA3), SCALANCE X307-2 EEC (2x 230V) (6GK5307-2FD00-4EA3), SCALANCE X307-2 EEC (2x 24V, coated) (6GK5307-2FD00-2GA3), SCALANCE X307-2 EEC (2x 24V) (6GK5307-2FD00-2EA3), SCALANCE X307-3 (6GK5307-3BL00-2AA3), SCALANCE X307-3 (6GK5307-3BL10-2AA3), SCALANCE X307-3LD (6GK5307-3BM00-2AA3), SCALANCE X307-3LD (6GK5307-3BM10-2AA3), SCALANCE X308-2 (6GK5308-2FL00-2AA3), SCALANCE X308-2 (6GK5308-2FL10-2AA3), SCALANCE X308-2LD (6GK5308-2FM00-2AA3), SCALANCE X308-2LD (6GK5308-2FM10-2AA3), SCALANCE X308-2LH (6GK5308-2FN00-2AA3), SCALANCE X308-2LH (6GK5308-2FN10-2AA3), SCALANCE X308-2LH+ (6GK5308-2FP00-2AA3), SCALANCE X308-2LH+ (6GK5308-2FP10-2AA3), SCALANCE X308-2M (6GK5308-2GG00-2AA2), SCALANCE X308-2M (6GK5308-2GG10-2AA2), SCALANCE X308-2M PoE (6GK5308-2QG00-2AA2), SCALANCE X308-2M PoE (6GK5308-2QG10-2AA2), SCALANCE X308-2M TS (6GK5308-2GG00-2CA2), SCALANCE X308-2M TS (6GK5308-2GG10-2CA2), SCALANCE X310 (6GK5310-0FA00-2AA3), SCALANCE X310 (6GK5310-0FA10-2AA3), SCALANCE X310FE (6GK5310-0BA00-2AA3), SCALANCE X310FE (6GK5310-0BA10-2AA3), SCALANCE X320-1 FE (6GK5320-1BD00-2AA3), SCALANCE X320-1-2LD FE (6GK5320-3BF00-2AA3), SCALANCE X408-2 (6GK5408-2FD00-2AA2), SCALANCE XR324-12M (230V, ports on front) (6GK5324-0GG00-3AR2), SCALANCE XR324-12M (230V, ports on front) (6GK5324-0GG10-3AR2), SCALANCE XR324-12M (230V, ports on rear) (6GK5324-0GG00-3HR2), SCALANCE XR324-12M (230V, ports on rear) (6GK5324-0GG10-3HR2), SCALANCE XR324-12M (24V, ports on front) (6GK5324-0GG00-1AR2), SCALANCE XR324-12M (24V, ports on front) (6GK5324-0GG10-1AR2), SCALANCE XR324-12M (24V, ports on rear) (6GK5324-0GG00-1HR2), SCALANCE XR324-12M (24V, ports on rear) (6GK5324-0GG10-1HR2), SCALANCE XR324-12M TS (24V) (6GK5324-0GG00-1CR2), SCALANCE XR324-12M TS (24V) (6GK5324-0GG10-1CR2), SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on front) (6GK5324-4GG00-3ER2), SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on front) (6GK5324-4GG10-3ER2), SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG00-3JR2), SCALANCE XR324-4M EEC (100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG10-3JR2), SCALANCE XR324-4M EEC (24V, ports on front) (6GK5324-4GG00-1ER2), SCALANCE XR324-4M EEC (24V, ports on front) (6GK5324-4GG10-1ER2), SCALANCE XR324-4M EEC (24V, ports on rear) (6GK5324-4GG00-1JR2), SCALANCE XR324-4M EEC (24V, ports on rear) (6GK5324-4GG10-1JR2), SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on front) (6GK5324-4GG00-4ER2), SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on front) (6GK5324-4GG10-4ER2), SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG00-4JR2), SCALANCE XR324-4M EEC (2x 100-240VAC/60-250VDC, ports on rear) (6GK5324-4GG10-4JR2), SCALANCE XR324-4M EEC (2x 24V, ports on front) (6GK5324-4GG00-2ER2), SCALANCE XR324-4M EEC (2x 24V, ports on front) (6GK5324-4GG10-2ER2), SCALANCE XR324-4M EEC (2x 24V, ports on rear) (6GK5324-4GG00-2JR2), SCALANCE XR324-4M EEC (2x 24V, ports on rear) (6GK5324-4GG10-2JR2), SCALANCE XR324-4M PoE (230V, ports on front) (6GK5324-4QG00-3AR2), SCALANCE XR324-4M PoE (230V, ports on rear) (6GK5324-4QG00-3HR2), SCALANCE XR324-4M PoE (24V, ports on front) (6GK5324-4QG00-1AR2), SCALANCE XR324-4M PoE (24V, ports on rear) (6GK5324-4QG00-1HR2), SCALANCE XR324-4M PoE TS (24V, ports on front) (6GK5324-4QG00-1CR2), SIPLUS NET SCALANCE X308-2 (6AG1308-2FL10-4AA3): Update to V4.1.4 orlater version Industrial Edge - PROFINET IO Connector: Use the Edge Management System to update to V1.1.1 or later version RUGGEDCOM RM1224 LTE(4G) EU (6GK6108-4AM00-2BA2), RUGGEDCOM RM1224 LTE(4G) NAM (6GK6108-4AM00-2DA2), SCALANCE M804PB (6GK5804-0AP00-2AA2), SCALANCE M812-1 ADSL-Router (Annex A) (6GK5812-1AA00-2AA2), SCALANCE M812-1 ADSL-Router (Annex B) (6GK5812-1BA00-2AA2), SCALANCE M816-1 ADSL-Router (Annex A) (6GK5816-1AA00-2AA2), SCALANCE M816-1 ADSL-Router (Annex B) (6GK5816-1BA00-2AA2), SCALANCE M826-2 SHDSL-Router (6GK5826-2AB00-2AB2), SCALANCE M874-2 (6GK5874-2AA00-2AA2), SCALANCE M874-3 (6GK5874-3AA00-2AA2), SCALANCE M876-3 (EVDO) (6GK5876-3AA02-2BA2), SCALANCE M876-3 (ROK) (6GK5876-3AA02-2EA2), SCALANCE M876-4 (EU) (6GK5876-4AA00-2BA2), SCALANCE M876-4 (NAM) (6GK5876-4AA00-2DA2), SCALANCE MUM853-1 (EU) (6GK5853-2EA00-2DA1), SCALANCE MUM856-1 (EU) (6GK5856-2EA00-3DA1), SCALANCE MUM856-1 (RoW) (6GK5856-2EA00-3AA1), SCALANCE S615 (6GK5615-0AA00-2AA2): Update to V7.1 orlater version SIMATIC PCS neo (Administration Console): Update to V3.1 SP 1 orlater version SCALANCE W1748-1 M12 (6GK5748-1GY01-0AA0), SCALANCE W1748-1 M12 (6GK5748-1GY01-0TA0), SCALANCE W1788-1 M12 (6GK5788-1GY01-0AA0), SCALANCE W1788-2 EEC M12 (6GK5788-2GY01-0TA0), SCALANCE W1788-2 M12 (6GK5788-2GY01-0AA0), SCALANCE W1788-2IA M12 (6GK5788-2HY01-0AA0): Update to V3.0.0 orlater version SCALANCE X204-2 (6GK5204-2BB10-2AA3), SCALANCE X204-2FM (6GK5204-2BB11-2AA3), SCALANCE X204-2LD (6GK5204-2BC10-2AA3), SCALANCE X204-2LD TS (6GK5204-2BC10-2CA2), SCALANCE X204-2TS (6GK5204-2BB10-2CA2), SCALANCE X206-1 (6GK5206-1BB10-2AA3), SCALANCE X206-1LD (6GK5206-1BC10-2AA3), SCALANCE X208 (6GK5208-0BA10-2AA3), SCALANCE X208PRO (6GK5208-0HA10-2AA6), SCALANCE X212-2 (6GK5212-2BB00-2AA3), SCALANCE X212-2LD (6GK5212-2BC00-2AA3), SCALANCE X216 (6GK5216-0BA00-2AA3), SCALANCE X224 (6GK5224-0BA00-2AA3), SCALANCE XF204 (6GK5204-0BA00-2AF2), SCALANCE XF204-2 (6GK5204-2BC00-2AF2), SCALANCE XF206-1 (6GK5206-1BC00-2AF2), SCALANCE XF208 (6GK5208-0BA00-2AF2): Update to V5.2.6 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage. For more information see the associated Siemens security advisory SSA-244969 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Delta Electronics DIALink",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-259-07",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/AThe following versions of Delta Electronics DIALink are affected: DIALink: Versions V1.6.0.0 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 10.0 ATTENTION: Exploitable remotely/low attack complexity Vendor: Delta Electronics Equipment: DIALink Vulnerabilities: Path Traversal",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to bypass authentication.",
      "vulnerability_overview": "N/ADelta Electronics DIALink has an Improper Limitation of a Pathname to a Restricted Directory vulnerability which could allow an attacker to bypass authentication. CVE-2025-58320has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-58320. A base score of 6.9 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:L/SC:N/SI:N/SA:N). Delta Electronics DIALink has an Improper Limitation of a Pathname to a Restricted Directory vulnerability which could allow an attacker to bypass authentication. CVE-2025-58321has been assigned to this vulnerability. A CVSS v3.1 base score of 10 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-58321. A base score of 10 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H).",
      "mitigations": "N/ADelta Electronics recommends users to download and upgrade to DIALink v1.8.0.0 or later. The latest version can be found at theDelta Download Center. Delta Electronics has the following general recommendations for users to follow: Don't click on untrusted Internet links or open unsolicited attachments in emails. Avoid exposing control systems and equipment to the Internet. Place systems and devices behind a firewall and isolate them from the business network. When remote access is required, use a secure access method, such as a virtual private network (VPN). Users are encouraged to seeDelta-PCSA-2025-00016_DIALinkfor more information. For more information, contactDelta Electronics. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Siemens SIMATIC NET CP, SINEMA, and SCALANCE",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-259-03",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens RUGGEDCOM RM1224 LTE(4G) EU (6GK6108-4AM00-2BA2): < V7.1 Siemens SCALANCE M874-3 (6GK5874-3AA00-2AA2): < V7.1 Siemens SCALANCE M876-3 (EVDO) (6GK5876-3AA02-2BA2): < V7.1 Siemens SCALANCE M876-3 (ROK) (6GK5876-3AA02-2EA2): < V7.1 Siemens SCALANCE M876-4 (EU) (6GK5876-4AA00-2BA2): < V7.1 Siemens SCALANCE M876-4 (NAM) (6GK5876-4AA00-2DA2): < V7.1 Siemens SCALANCE MUM853-1 (EU) (6GK5853-2EA00-2DA1): < V7.1 Siemens SCALANCE MUM856-1 (EU) (6GK5856-2EA00-3DA1): < V7.1 Siemens SCALANCE MUM856-1 (RoW) (6GK5856-2EA00-3AA1): < V7.1 Siemens SCALANCE S615 (6GK5615-0AA00-2AA2): < V7.1 Siemens SCALANCE SC622-2C (6GK5622-2GS00-2AC2): < V2.3 (CVE-2021-41991) Siemens RUGGEDCOM RM1224 LTE(4G) NAM (6GK6108-4AM00-2DA2): < V7.1 Siemens SCALANCE SC632-2C (6GK5632-2GS00-2AC2): < V2.3 (CVE-2021-41991) Siemens SCALANCE SC636-2C (6GK5636-2GS00-2AC2): < V2.3 (CVE-2021-41991) Siemens SCALANCE SC642-2C (6GK5642-2GS00-2AC2): < V2.3 (CVE-2021-41991) Siemens SCALANCE SC646-2C (6GK5646-2GS00-2AC2): < V2.3 (CVE-2021-41991) Siemens SIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0): < V3.3.46 (CVE-2021-41991) Siemens SIMATIC CP 1243-1 (6GK7243-1BX30-0XE0): < V3.3.46 (CVE-2021-41991) Siemens SIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0): < V3.3.46 (CVE-2021-41991) Siemens SIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0): < V3.3.46 (CVE-2021-41991) Siemens SIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0): < V3.3.46 (CVE-2021-41991) Siemens SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0): < V2.2.28 (CVE-2021-41991) Siemens SCALANCE M804PB (6GK5804-0AP00-2AA2): < V7.1 Siemens SIMATIC CP 1542SP-1 IRC (6GK7542-6VX00-0XE0): < V2.2.28 (CVE-2021-41991) Siemens SIMATIC CP 1543-1 (6GK7543-1AX00-0XE0): < V2.2.28 (CVE-2021-41991) Siemens SIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0): < V2.2.28 (CVE-2021-41991) Siemens SIMATIC CP 1545-1 (6GK7545-1GX00-0XE0): < V1.1 (CVE-2021-41991) Siemens SINEMA Remote Connect Server: < V3.1 (CVE-2021-41991) Siemens SIPLUS ET 200SP CP 1542SP-1 IRC TX RAIL (6AG2542-6VX00-4XE0): < V2.2.28 (CVE-2021-41991) Siemens SIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0): < V2.2.28 (CVE-2021-41991) Siemens SIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0): < V2.2.28 (CVE-2021-41991) Siemens SIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0): < V3.3.46 (CVE-2021-41991) Siemens SIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): < V3.0.22 (CVE-2021-41991) Siemens SCALANCE M812-1 ADSL-Router (Annex A) (6GK5812-1AA00-2AA2): < V7.1 Siemens SIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0): < V3.3.46 (CVE-2021-41991) Siemens SIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): < V3.3.46 (CVE-2021-41991) Siemens SCALANCE M812-1 ADSL-Router (Annex B) (6GK5812-1BA00-2AA2): < V7.1 Siemens SCALANCE M816-1 ADSL-Router (Annex A) (6GK5816-1AA00-2AA2): < V7.1 Siemens SCALANCE M816-1 ADSL-Router (Annex B) (6GK5816-1BA00-2AA2): < V7.1 Siemens SCALANCE M826-2 SHDSL-Router (6GK5826-2AB00-2AB2): < V7.1 Siemens SCALANCE M874-2 (6GK5874-2AA00-2AA2): < V7.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 7.5 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: SIMATIC NET CP, SINEMA and SCALANCE Vulnerabilities: Integer Overflow or Wraparound",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service (DoS) condition in the affected devices by exploiting integer overflow bugs.",
      "vulnerability_overview": "N/AThe gmp plugin in strongSwan before version 5.9.4 has a remote integer overflow vulnerability via a crafted certificate with an RSASSA-PSS signature. For example, this can be triggered by an unrelated self-signed CA certificate sent by an initiator. Remote code execution cannot occur. CVE-2021-41990has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). The in-memory certificate cache in strongSwan before version 5.9.4 has a remote integer overflow vulnerability upon receiving many requests with different certificates to fill the cache and later trigger the replacement of cache entries. The code attempts to select a less-often-used cache entry by means of a random number generator, but this is not done correctly. This could lead to a denial of service (DoS) condition. Remote code execution can't be excluded completely, but it would require attackers to have control over the dereferenced memory, so it is very unlikely. CVE-2021-41991has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: RUGGEDCOM RM1224 LTE(4G) EU (6GK6108-4AM00-2BA2), RUGGEDCOM RM1224 LTE(4G) NAM (6GK6108-4AM00-2DA2), SCALANCE M804PB (6GK5804-0AP00-2AA2), SCALANCE M812-1 ADSL-Router (Annex A) (6GK5812-1AA00-2AA2), SCALANCE M812-1 ADSL-Router (Annex B) (6GK5812-1BA00-2AA2), SCALANCE M816-1 ADSL-Router (Annex A) (6GK5816-1AA00-2AA2), SCALANCE M816-1 ADSL-Router (Annex B) (6GK5816-1BA00-2AA2), SCALANCE M826-2 SHDSL-Router (6GK5826-2AB00-2AB2), SCALANCE M874-2 (6GK5874-2AA00-2AA2), SCALANCE M874-3 (6GK5874-3AA00-2AA2), SCALANCE M876-3 (EVDO) (6GK5876-3AA02-2BA2), SCALANCE M876-3 (ROK) (6GK5876-3AA02-2EA2), SCALANCE M876-4 (EU) (6GK5876-4AA00-2BA2), SCALANCE M876-4 (NAM) (6GK5876-4AA00-2DA2), SCALANCE MUM853-1 (EU) (6GK5853-2EA00-2DA1), SCALANCE MUM856-1 (EU) (6GK5856-2EA00-3DA1), SCALANCE MUM856-1 (RoW) (6GK5856-2EA00-3AA1), SCALANCE S615 (6GK5615-0AA00-2AA2): Update to V7.1 orlater version (CVE-2021-41991) SIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0), SIMATIC CP 1243-1 (6GK7243-1BX30-0XE0), SIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0), SIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0), SIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0), SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0), SIMATIC CP 1543-1 (6GK7543-1AX00-0XE0), SIMATIC CP 1545-1 (6GK7545-1GX00-0XE0), SIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0), SIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0), SIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0), SIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): Only deploy certificates via TIA portal that got created with TIA portal (CVE-2021-41991) SIMATIC CP 1542SP-1 (6GK7542-6UX00-0XE0), SIMATIC CP 1542SP-1 IRC (6GK7542-6VX00-0XE0), SIMATIC CP 1543SP-1 (6GK7543-6WX00-0XE0), SIPLUS ET 200SP CP 1542SP-1 IRC TX RAIL (6AG2542-6VX00-4XE0), SIPLUS ET 200SP CP 1543SP-1 ISEC (6AG1543-6WX00-7XE0), SIPLUS ET 200SP CP 1543SP-1 ISEC TX RAIL (6AG2543-6WX00-4XE0): Update to V2.2.28 orlater version (CVE-2021-41991) SIMATIC CP 1242-7 V2 (6GK7242-7KX31-0XE0), SIMATIC CP 1243-1 (6GK7243-1BX30-0XE0), SIMATIC CP 1243-7 LTE EU (6GK7243-7KX30-0XE0), SIMATIC CP 1243-7 LTE US (6GK7243-7SX30-0XE0), SIMATIC CP 1243-8 IRC (6GK7243-8RX30-0XE0), SIPLUS NET CP 1242-7 V2 (6AG1242-7KX31-7XE0), SIPLUS S7-1200 CP 1243-1 (6AG1243-1BX30-2AX0), SIPLUS S7-1200 CP 1243-1 RAIL (6AG2243-1BX30-1XE0): Update to V3.3.46 orlater version (CVE-2021-41991) SIMATIC CP 1545-1 (6GK7545-1GX00-0XE0): Update to V1.1 orlater version (CVE-2021-41991) SINEMA Remote Connect Server: Update to V3.1 orlater version (CVE-2021-41991) SCALANCE SC622-2C (6GK5622-2GS00-2AC2), SCALANCE SC632-2C (6GK5632-2GS00-2AC2), SCALANCE SC636-2C (6GK5636-2GS00-2AC2), SCALANCE SC642-2C (6GK5642-2GS00-2AC2), SCALANCE SC646-2C (6GK5646-2GS00-2AC2): Update to V2.3 orlater version (CVE-2021-41991) SIMATIC CP 1543-1 (6GK7543-1AX00-0XE0), SIPLUS NET CP 1543-1 (6AG1543-1AX00-2XE0): Update to V3.0.22 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-539476 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Hitachi Energy RTU500 Series",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-259-02",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Hitachi Energy",
      "affected_products": "N/AHitachi Energy reports that the following products are affected: Hitachi Energy RTU500 series: Version 13.6.1 (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) Hitachi Energy RTU500 series: Versions 12.7.1 through 12.7.7 (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) Hitachi Energy RTU500 series: Versions 13.4.1 through 13.4.4 (CVE-2025-39203) Hitachi Energy RTU500 series: Versions 13.5.1 through 13.5.3 (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) Hitachi Energy RTU500 series: Versions 13.7.1 through 13.7.6",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.2 ATTENTION: Exploitable remotely/low attack complexity Vendor: Hitachi Energy Equipment: RTU500 series Vulnerabilities: NULL Pointer Dereference, Improper Validation of Integrity Check Value, Improper Restriction of XML External Entity Reference, Heap-based Buffer Overflow, Integer Overflow or Wraparound, Improper Restriction of Recursive Entity References in DTDs ('XML Entity Expansion'), Stack-based Buffer Overflow",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could cause a Denial-of-Service condition in RTU500 devices.",
      "vulnerability_overview": "N/AA vulnerability has been identified in the openLDAP library used in Central Account Management (CAM) client. This issue can lead to a Denial of Service (DoS) condition when a specially crafted request may cause a null pointer to dereference, resulting in affected CMU to automatically recovering itself by rebooting. CVE-2023-2953has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2023-2953. A base score of 8.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A vulnerability exists in the IEC 61850 protocol of the RTU500 product series. An IEC 61850-8 crafted message content from a device (e.g. an IED) or remote system can cause a Denial of Service (DoS) resulting in disconnection of the device to the RTU 500 until next reboot. CVE-2025-39203has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L). A CVSS v4 score has also been calculated forCVE-2025-39203. A base score of 5.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:L/SC:N/SI:N/SA:N). A vulnerability has been identified in the libexpat library used in IEC 61850 client and server components of the RTU500 product series. An authenticated and authorized malicious user could load a crafted XML input which may lead to memory mismanagement potentially causing RTU500 to reboot. CVE-2024-45490has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2024-45490. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A vulnerability has been identified in libexpat library used in the IEC 61850 client and server components of the RTU500 product series. An authenticated and authorized malicious user could load a crafted XML input which may lead to heap corruption potentially causing RTU500 to reboot. CVE-2024-45491has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2024-45491. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A vulnerability has been identified in libexpat library used in the IEC 61850 client and server components of the RTU500 product series. An authenticated and authorized malicious user could load a crafted XML input which leads to an integer overflow potentially causing RTU500 to reboot. CVE-2024-45492has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2024-45492. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A vulnerability has been identified in libexpat library used in the IEC 61850 client and server components of the RTU500 product series. An authenticated and authorized malicious user could load a crafted XML input which may lead to a memory mismanagement potentially causing RTU500 to reboot. CVE-2024-28757has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2024-28757. A base score of 7.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N). A vulnerability exists in libxml library used by RTU500 Web server functionality. An authenticated and authorized malicious user could send a crafted XML message which may lead to buffer overflow potentially causing RTU500 to reboot. CVE-2025-6021has been assigned to this vulnerability. A CVSS v3.1 base score of 6.5 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H). A CVSS v4 score has also been calculated forCVE-2025-6021. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:P/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AHitachi Energy has identified the following specific workarounds and mitigations users can apply to reduce risk: (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) RTU500 series CMU Firmware version 12.7.1 – 12.7.7: Update to CMU Firmware version 12.7.8 when available (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) RTU500 series CMU Firmware version 13.5.1 – 13.5.3: Update to CMU Firmware version 13.5.4 (CVE-2023-2953, CVE-2025-39203, CVE-2025-6021) RTU500 series CMU Firmware version 13.6.1: Update to CMU Firmware version 13.6.3 (CVE-2023-2953) RTU500 series CMU Firmware version 12.7.1 – 12.7.7: Follow general mitigation factors /workarounds (CVE-2023-2953, CVE-2025-39203) RTU500 series CMU Firmware version 13.6.1, RTU500 series CMU Firmware version 13.5.1 – 13.5.3, RTU500 series CMU Firmware version 13.7.1 – 13.7.6: Follow general mitigation factors/workarounds. (CVE-2023-2953, CVE-2024-45490, CVE-2024-45491, CVE-2024-45492, CVE-2024-28757, CVE-2025-6021) RTU500 series CMU Firmware version 13.7.1 – 13.7.6: Update to CMU Firmware version 13.7.7 (CVE-2025-39203) RTU500 series CMU Firmware version 12.7.1 – 12.7.7: Follow general mitigation factors/ workarounds. (CVE-2025-39203) RTU500 series CMU Firmware version 13.4.1 – 13.4.4, RTU500 series CMU Firmware version 13.7.1 – 13.7.6: Update to CMU Firmware version 13.7.7 (CVE-2025-39203) RTU500 series CMU Firmware version 13.4.1 – 13.4.4: Follow General Mitigation Factors/Workarounds. (CVE-2024-45490, CVE-2024-45491, CVE-2024-45492, CVE-2024-28757) RTU500 series CMU Firmware version 13.7.1 – 13.7.6: Follow general mitigation factors/workarounds. (CVE-2025-6021) RTU500 series CMU Firmware version 13.6.1, RTU500 series CMU Firmware version 12.7.1 – 12.7.7, RTU500 series CMU Firmware version 13.5.1 – 13.5.3, RTU500 series CMU Firmware version 13.7.1 – 13.7.6: Follow general mitigation factors/workarounds. For more information see the associated Hitachi Energy PSIRT security advisory 8DBD000220Multiple Vulnerabilities in Hitachi Energy's RTU500 series Product. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases Eight Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/09/16/cisa-releases-eight-industrial-control-systems-advisories",
      "published": "Tue, 16 Sep 25 12:00:00 +0000",
      "vendor": "Delta Electronics",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Daikin Security Gateway",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-254-10",
      "published": "Thu, 11 Sep 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of Daikin Europe N.V Security Gateway are affected: Security Gateway: App: 100, Frm: 214",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.8 ATTENTION: Exploitable remotely/low attack complexity/public exploits are available Vendor: Daikin Europe N.V Equipment: Security Gateway Vulnerability: Weak Password Recovery Mechanism for Forgotten Password",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to gain unauthorized access to the system.",
      "vulnerability_overview": "N/ADaikin Europe N.V Security Gateway is vulnerable to an authorization bypass through a user-controlled key vulnerability that could allow an attacker to bypass authentication. An unauthorized attacker could access the system without prior credentials. CVE-2025-10127has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-10127. A base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:L/VA:H/SC:N/SI:N/SA:L).",
      "mitigations": "N/ADaikin Europe N.V has reported they will not fix this vulnerability and will respond directly to user inquiries. For more information, contactDaikin customer support. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    }
  ]
}