{
  "source": "https://www.cisa.gov/cybersecurity-advisories/all.xml",
  "fetched_at": "2025-12-15T11:18:31.323415Z",
  "items": [
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/12/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Fri, 12 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/12/cisa-adds-one-known-exploited-vulnerability-catalog-0",
      "published": "Fri, 12 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens IAM Client",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-04",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: COMOS V10.6: All versions NX V2412: All versions prior to 2412.8700 NX V2506: All versions prior to 2506.6000 Simcenter 3D: All versions prior to 2506.6000 Simcenter Femap: All versions prior to 2506.0002 Solid Edge SE2025: All versions prior to V225.0 Update 10 Solid Edge SE2026: All versions prior to V226.0 Update 1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.1 ATTENTION: Exploitable remotely Vendor: Siemens Equipment: IAM Client Vulnerability: Improper Certificate Validation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to perform man-in-the-middle attacks.",
      "vulnerability_overview": "N/AThe IAM client in affected products is missing server certificate validation while establishing TLS connections to the authorization server. This could allow an attacker to perform a man-in-the-middle attack. CVE-2025-40800has been assigned to this vulnerability. A CVSS v3.1 base score of 7.4 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2025-40800. A base score of 9.1 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: COMOS V10.6: Currently no fix is available Solid Edge SE2025: Update to V225.0 Update 10 orlater version Solid Edge SE2026: Update to V226.0 Update 1 orlater version NX V2412: Update to V2412.8700 orlater version Simcenter Femap: Update to V2506.0002 orlater version NX V2506: Update to V2506.6000 orlater version Simcenter 3D: Update to V2506.6000 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-868571 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "Siemens Energy Services",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-08",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: Siemens Energy Services: All versions with G5DFR",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.0 ATTENTION: Low attack complexity Vendor: Siemens Equipment: Energy Services Vulnerability: Authentication Bypass Using an Alternate Path or Channel",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability will allow an attacker to reset the Admin password.",
      "vulnerability_overview": "N/AOn Elspec G5 devices through 1.2.2.19, a person with physical access to the device can reset the Admin password by inserting a USB drive (containing a publicly documented reset string) into a USB port. CVE-2025-59392has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-59392. A base score of 7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:P/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Energy Services: Update G5DFR to V1.2.3.13 or later version.https://www.elspec-ltd.com/support/release-notes/g5dfr-release-notes/ As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-734261 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Johnson Controls iSTAR",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-01",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Johnson Controls",
      "affected_products": "N/AJohnson Controls reports the following products are affected: iSTAR Ultra: Versions prior to 6.9.7.CU01 iSTAR Ultra SE: Versions prior to 6.9.7.CU01 iSTAR Ultra G2: Versions prior to 6.9.3 iSTAR Ultra G2 SE: Versions prior to 6.9.3 iSTAR Edge G2: Versions prior to 6.9.3",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Johnson Controls Inc. Equipment: iSTAR Ultra, iSTAR Ultra SE, iSTAR Ultra G2, iSTAR Ultra G2 SE, iSTAR Edge G2 Vulnerabilities: Improper Neutralization of Special Elements used in an OS Command",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could result in unauthorized access to the device.",
      "vulnerability_overview": "N/AUnder certain circumstances a successful exploitation of this vulnerability could result in access to the device. CVE-2025-43875has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-43875. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Under certain circumstances a successful exploitation of this vulnerability could result in access to the device. CVE-2025-43876has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-43876. A base score of 8.7 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AJohnson Controls recommends users complete the following actions to address these issues: Upgrade iSTAR Ultra, and iSTAR Ultra SE to version 6.9.7.CU01 or greater. Upgrade iSTAR Ultra G2, iSTAR Ultra G2 SE, and iSTAR Edge G2 to version 6.9.3 or greater. For detailed mitigation instructions, see theJohnson Controls Product Security Advisories JCI-PSA-2025-14 and JCI-PSA-2025-15.Johnson Controls recommends implementing measures to minimize risks to all building automation systems. Further ICS security notices and product security guidance are located at theJohnson Controls product security website. ContactJohnson Controls Global Product Security. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as virtual private networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Varex Imaging Panoramic Dental Imaging Software",
      "link": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-345-02",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following AJAT dental imaging software (owned by Varex Imaging) containing vulnerable SDKs is affected: Panoramic Dental Imaging Software: Versions prior to 6.6.1.490",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.5 ATTENTION: Low attack complexity Vendor: Varex Imaging Equipment: Panoramic Dental Imaging Software Vulnerability: Uncontrolled Search Path Element",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a standard user to obtain NT Authority/SYSTEM privileges.",
      "vulnerability_overview": "N/AThe AJAT Panoramic Dental Imaging Software SDK is vulnerable to DLL hijacking, which may allow an attacker to obtain NT Authority/SYSTEM as a standard user. CVE-2024-22774has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2024-22774. A base score of 8.5 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AVarex Imaging, which acquired Direct Conversion Lt (formerly Oh AJAT Ltd) has provided a software patch for this vulnerability. Varex Imaging recommends users download the [Panoramic Dental Imaging SW patch] (https://vareximaging.sharepoint.com/:f:/r/sites/External/DetectorSW/Software/PC/SNAP/Ajat%20Dental%20SW?csf=1&web=1&e=hdFtCI). The files must be run on each workstation running the Panoramic Dental Imaging software. After downloading, users must run the file called AJAT_DENTAL_IMAGING_9.4.55.9888.exe. For more information,contact Varex Imagingdirectly for assistance. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/11/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Siemens Building X - Security Manager Edge Controller",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-07",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports the following products are affected: Building X - Security Manager Edge Controller (ACC-AP): All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 5.9 ATTENTION: Low attack complexity Vendor: Siemens Equipment: Building X - Security Manager Edge Controller (ACC-AP) Vulnerability: Improper Verification of Cryptographic Signature",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to upload maliciously modified firmware onto the device.",
      "vulnerability_overview": "N/AAffected devices do not properly check the integrity of firmware updates. This could allow a local attacker to upload maliciously modified firmware onto the device. In a second scenario, a remote attacker who is able to intercept the transfer of valid firmware from the server to the device could modify the firmware \"on the fly\". CVE-2022-31807has been assigned to this vulnerability. A CVSS v3.1 base score of 6.2 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N). A CVSS v4 score has also been calculated forCVE-2022-31807. A base score of 5.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:L/AC:L/AT:P/PR:N/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Building X - Security Manager Edge Controller (ACC-AP): Use the ACC Firmware App to apply updates in a controlled and authenticated manner, ensuring that only verified firmware packages from the official SIOS portal are installed on the controller. Validate the integrity of the downloaded firmware by confirming its hash value. Access to the controller should remain limited to authorized personnel, and credentials must be protected and updated according to policy to reduce the risk of unauthorized modifications or the installation of tampered firmware Building X - Security Manager Edge Controller (ACC-AP): Currently no fix is planned As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-420375 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "Siemens SINEMA Remote Connect Server",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-06",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: SINEMA Remote Connect Server: All versions prior to V3.2 SP4",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 4.3 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: SINEMA Remote Connect Server Vulnerabilities: Incorrect Permission Assignment for Critical Resource, Incorrect Authorization",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an authenticated attacker to impersonate the server potentially enabling man-in-the-middle, traffic decryption, or unauthorized access to services that trust these certificates.",
      "vulnerability_overview": "N/AAffected applications contain private SSL/TLS keys on the server that are not properly protected allowing any user with server access to read these keys. This could allow an authenticated attacker to impersonate the server potentially enabling man-in-the-middle, traffic decryption or unauthorized access to services that trust these certificates. CVE-2025-40818has been assigned to this vulnerability. A CVSS v3.1 base score of 3.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N). Affected applications do not properly validate license restrictions against the database, allowing direct modification of the system_ticketinfo table to bypass license limitations without proper enforcement checks. This could allow an attacker with database access to circumvent licensing restrictions by directly modifying database values and potentially enabling unauthorized use beyond the permitted scope. CVE-2025-40819has been assigned to this vulnerability. A CVSS v3.1 base score of 4.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: SINEMA Remote Connect Server: Update to V3.2 SP4 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-626856 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "2025 CWE Top 25 Most Dangerous Software Weaknesses",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/11/2025-cwe-top-25-most-dangerous-software-weaknesses",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Cybersecurity Performance Goals 2.0 for Critical Infrastructure",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/11/cybersecurity-performance-goals-20-critical-infrastructure",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Grassroots DICOM (GDCM)",
      "link": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-345-01",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following open source products and specified components are affected: Grassroots DICOM (GDCM): Versions 3.0.24 and prior SimpleITK: Versions 2.5.2 and prior medInria: Versions 4.0 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.8 ATTENTION: Low attack complexity Vendor: Grassroots Equipment: DICOM (GDCM) Vulnerability: Out-of-bounds Write",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an attacker to craft a malicious DICOM file and, if opened, could crash the application resulting in a denial-of-service condition.",
      "vulnerability_overview": "N/AAn out-of-bounds write vulnerability exists in the Grassroots DICOM library (GDCM). The issue is triggered during parsing of a malformed DICOM file containing encapsulated PixelData fragments (compressed image data stored as multiple fragments). This vulnerability leads to a segmentation fault caused by an out-of-bounds memory access due to unsigned integer underflow in buffer indexing. It is exploitable via file input, simply opening a crafted malicious DICOM file is sufficient to trigger the crash, resulting in a denial-of-service condition. CVE-2025-11266has been assigned to this vulnerability. A CVSS v3.1 base score of 6.6 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H). A CVSS v4 score has also been calculated forCVE-2025-11266. A base score of 6.8 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AThe maintainer of the software recommends users updateGrassroots DICOM (GDCM) to v3.2.2 or laterfrom the main GitHub repository. SimpleITK and medInria have both released fixes for the vulnerability. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "OpenPLC_V3",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-10",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following versions of OpenPLC_V3 are affected: OpenPLC_V3: Versions prior to pull request #310",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 7.0 ATTENTION:Exploitable remotely Vendor:OpenPLC_V3 Equipment:OpenPLC_V3 Vulnerability:Cross-Site Request Forgery (CSRF)",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in the alteration of PLC settings or the upload of malicious programs.",
      "vulnerability_overview": "N/AOpenPLC_V3 is vulnerable to a cross-site request forgery (CSRF) attack due to the absence of proper CSRF validation. This issue allows an unauthenticated attacker to trick a logged-in administrator into visiting a maliciously crafted link, potentially enabling unauthorized modification of PLC settings or the upload of malicious programs which could lead to significant disruption or damage to connected systems. CVE-2025-13970has been assigned to this vulnerability. A CVSS v3 base score of 8.0 has been calculated; the CVSS vector string is (AV:N/AC:H/PR:N/UI:R/S:C/C:N/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-13970. A base score of 7.0 has been calculated; the CVSS vector string is (AV:N/AC:H/AT:N/PR:N/UI:A/VC:N/VI:H/VA:H/SC:N/SI:N/SA:H).",
      "mitigations": "N/APull request #310 resolves this issue. Users are advised to update OpenPLC_V3 to pull request #310 or later from themain GitHub repository. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity."
    },
    {
      "title": "AzeoTech DAQFactory",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-03",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "AzeoTech",
      "affected_products": "N/AThe following releases of AzeoTech DAQFactory, a software and application development platform, are affected: DAQFactory: Release 20.7 (Build 2555) and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.4 ATTENTION: Low attack complexity Vendor: AzeoTech Equipment: DAQFactory Vulnerabilities: Out-of-bounds Write, Out-of-bounds Read, Access of Uninitialized Pointer, Heap-based Buffer Overflow, Type Confusion, Use After Free, Stack-based Buffer Overflow",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities requires an attacker to upload a malicious .ctl file. This could lead to information disclosure or arbitrary code execution.",
      "vulnerability_overview": "N/AIn AzeoTech DAQFactory release 20.7 (Build 2555), an Out-of-bounds Write vulnerability can be exploited by an attacker to cause the program to write data past the end of an allocated memory buffer. This can lead to arbitrary code execution or a system crash. CVE-2025-66590has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66590. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), an Out-of-bounds Read vulnerability can be exploited by an attacker to cause the program to read data past the end of an allocated buffer. This could allow an attacker to disclose information or cause a system crash. CVE-2025-66589has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66589. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), an Access of Uninitialized Pointer vulnerability can be exploited by an attacker which can lead to arbitrary code execution. CVE-2025-66588has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66588. A base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), the affected application is vulnerable to memory corruption while parsing specially crafted .ctl files. This could allow an attacker to execute code in the context of the current process. CVE-2025-66587has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66587. A base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:H/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), an Access of Resource Using Incompatible Type vulnerability can be exploited to cause memory corruption while parsing specially crafted .ctl files. This could allow an attacker to execute code in the context of the current process. CVE-2025-66586has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66586. A base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:H/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), a Use After Free vulnerability can be exploited to cause memory corruption while parsing specially crafted .ctl files. This could allow an attacker to execute code in the context of the current process. CVE-2025-66585has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66585. A base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:H/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). In AzeoTech DAQFactory release 20.7 (Build 2555), a Stack-Based Buffer Overflow vulnerability can be exploited to cause memory corruption while parsing specially crafted .ctl files. This could allow an attacker to execute code in the context of the current process. CVE-2025-66584has been assigned to this vulnerability. A CVSS v3 base score of 7.8 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-66584. A base score of 7.3 has been calculated; the CVSS vector string is (AV:L/AC:H/AT:N/PR:N/UI:P/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AAzeoTech has released the following update that addresses these issues: DAQFactory: Release 21.1 AzeoTech also recommends users take the following actions to reduce the risk: Users are discouraged from using documents from unknown/untrusted sources. Users are encouraged to store .ctl files in a folder only writeable by admin-level users. Users are encouraged to operate in \"Safe Mode\" when loading documents that have been out of their control. Users are encouraged to apply a document editing password to their documents. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. These vulnerabilities have a high attack complexity."
    },
    {
      "title": "Siemens Advanced Licensing (SALT) Toolkit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-05",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following products are affected: COMOS V10.6: All versions JT Bi-Directional Translator for STEP: All versions NX V2412: Versions prior to 2412.8900 NX V2506: Versions prior to 2506.6000 Simcenter 3D: Versions prior to 2506.6000 Simcenter Femap: Versions prior to 2506.0002 Simcenter Studio: All versions Simcenter System Architect: All versions Tecnomatix Plant Simulation: Versions prior to 2504.0007",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.2 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Advanced Licensing (SALT) Toolkit Vulnerability: Improper Certificate Validation",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow an unauthenticated remote attacker to perform man-in-the-middle attacks.",
      "vulnerability_overview": "N/AThe SALT SDK is missing server certificate validation while establishing TLS connections to the authorization server. This could allow an attacker to perform a man-in-the-middle attack. CVE-2025-40801has been assigned to this vulnerability. A CVSS v3.1 base score of 8.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-40801. A base score of 9.2 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: JT Bi-Directional Translator for STEP: Currently no fix is planned COMOS V10.6, Simcenter Studio, Simcenter System Architect: Currently no fix is available NX V2412: Update to V2412.8900 orlater version Tecnomatix Plant Simulation: Update to V2504.0007 orlater version Simcenter Femap: Update to V2506.0002 orlater version Simcenter 3D: Update to V2506.6000 orlater version NX V2506: Update to V2506.6000 orlater version As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-710408 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Siemens Gridscale X Prepay",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-09",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/ASiemens reports that the following product is affected: Gridscale X Prepay: Version prior to 4.2.1",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.9 ATTENTION: Exploitable remotely/low attack complexity Vendor: Siemens Equipment: Gridscale X Prepay Vulnerabilities: Observable Response Discrepancy, Authentication Bypass by Capture-replay",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to enumerate valid user names and to bypass locked-out user sessions.",
      "vulnerability_overview": "N/AThe affected application is vulnerable to user enumeration due to distinguishable responses. This could allow an unauthenticated remote attacker to determine if a user is valid or not, enabling a brute force attack with valid users. CVE-2025-40806has been assigned to this vulnerability. A CVSS v3.1 base score of 5.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-40806. A base score of 6.9 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:L/VI:N/VA:N/SC:N/SI:N/SA:N). The affected application is vulnerable to capture-replay of authentication tokens. This could allow an authenticated but already locked-out user to establish still valid user sessions. CVE-2025-40807has been assigned to this vulnerability. A CVSS v3.1 base score of 6.3 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:L). A CVSS v4 score has also been calculated forCVE-2025-40807. A base score of 5.3 has been calculated; the CVSS vector string is (CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:L/VI:L/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASiemens has identified the following specific workarounds and mitigations users can apply to reduce risk: Gridscale X Prepay: Please contact your local Siemens representative for further information. As a general security measure, Siemens recommends protecting network access to devices with appropriate mechanisms. To operate the devices in a protected IT environment, Siemens recommends configuring the environment according toSiemens' operational guidelines for industrial securityand following recommendations in the product manuals. Additional information on industrial security by Siemens can be found on theSiemens industrial security webpage For more information see the associated Siemens security advisory SSA-356310 inHTMLandCSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "CISA Releases 12 Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/11/cisa-releases-12-industrial-control-systems-advisories",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Siemens",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Johnson Controls iSTAR Ultra",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-345-02",
      "published": "Thu, 11 Dec 25 12:00:00 +0000",
      "vendor": "Johnson Controls",
      "affected_products": "N/AThe following versions of iSTAR Ultra and iSTAR Edge door controllers are affected: iSTAR Ultra: Versions prior to 6.9.7.CU01 iSTAR Ultra SE: Versions prior to 6.9.7.CU01 iSTAR Ultra LT: Versions prior to 6.9.7.CU01 iSTAR Ultra G2: Versions prior to 6.9.3 iSTAR Ultra G2 SE: Versions prior to 6.9.3 iSTAR Edge G2: Versions prior to 6.9.3",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.7 ATTENTION: Exploitable remotely/low attack complexity Vendor: Johnson Controls Equipment: iSTAR Ultra, iSTAR Ultra SE, iSTAR Ultra G2, iSTAR Ultra G2 SE, iSTAR Edge G2, iSTAR Ultra LT Vulnerabilities: OS Command Injection",
      "risk_evaluation": "N/ASuccessful exploitation of these vulnerabilities could allow an attacker to modify firmware and gain full access to the device.",
      "vulnerability_overview": "N/AJohnson Controls iSTAR Ultra, Ultra SE, Ultra LT versions prior to 6.9.7.CU01 and Ultra G2, Ultra G2 SE, Edge G2 versions prior to 6.9.3 are vulnerable to OS Command Injection under certain circumstances that could allow an attacker full control of the device. CVE-2025-43873has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-43873. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N). Johnson Controls iSTAR Ultra, Ultra SE, Ultra LT versions prior to 6.9.7.CU01 and Ultra G2, Ultra G2 SE, Edge G2 versions prior to 6.9.3 are vulnerable to OS Command Injection under certain circumstances that could allow an attacker full control of the device. CVE-2025-43874has been assigned to this vulnerability. A CVSS v3.1 base score of 8.8 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-43874. A base score of 8.7 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AJohnson Controls recommends users take the following actions: Upgrade iSTAR Ultra, iSTAR Ultra SE, iStar Ultra LT to version 6.9.7.CU01 or greater. Upgrade iSTAR Ultra G2, iSTAR Ultra G2 SE, iSTAR Edge G2 to version 6.9.3 or greater. For more detailed mitigation instructions, please see Johnson Controls Product Security AdvisoryJCI-PSA-2025-11 and JCI-PSA-2025-13. Johnson Controls recommends taking steps to minimize risks to all building automation systems in alignment with CISA's guidance. Further ICS security notices and product security guidance are located at Johnson Controls product securitywebsite. Organizations observing any suspected malicious activity should follow their established internal procedures and report their findings to CISA for tracking and correlation against other incidents. For more information please contactJohnson Controls Global Product Securityor visit theirCybersecuritypage. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time."
    },
    {
      "title": "Pro-Russia Hacktivists Conduct Opportunistic Attacks Against US and Global Critical Infrastructure",
      "link": "https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-343a",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/09/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Festo LX Appliance",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-343-02",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/AFesto reports that the following products are affected: Festo Software LX Appliance: Versions prior to June 2023",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v3 6.1 ATTENTION: Exploitable remotely/low attack complexity Vendor: Festo SE & Co. KG Equipment: LX Appliance Vulnerability: Cross-site Scripting",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could allow a user of LX Appliance with a high privilege account to craft a malicious course and launch an XSS attack.",
      "vulnerability_overview": "N/AThe \"src\" attribute of the \"track\" tag allows a malicious user to bypass HTML escaping and execute arbitrary code. This affects the package video.js before 7.14.3. CVE-2021-23414has been assigned to this vulnerability. A CVSS v3.1 base score of 6.1 has been calculated; the CVSS vector string is (CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).",
      "mitigations": "N/AFesto has identified the following specific workarounds and mitigations users can apply to reduce risk: LX Appliance Versions prior to June 2023: Contact Festo Didactic services department atservices.didactic@festo.comto update your LX Appliance to the latest version. For more information see the associated Festo SE & Co. KG security advisory FSA-202301 FSA-202301: Festo: Cross-Site-Scripting (XSS) vulnerability in LX-Appliance - HTML FSA-202301: Festo: Cross-Site-Scripting (XSS) vulnerability in LX-Appliance - CSAF. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs). Recognize VPNs may have vulnerabilities, should be updated to the most recent version available, and are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.govin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer toRecognizing and Avoiding Email Scamsfor more information on avoiding email scams. Refer toAvoiding Social Engineering and Phishing Attacksfor more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Universal Boot Loader (U-Boot)",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-343-01",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following version of U-boot is affected: U-boot: All versions prior to 2017.11 The following specific chips have been confirmed to be affected: Qualcomm IPQ4019 Qualcomm IPQ5018 Qualcomm IPQ5322 Qualcomm IPQ6018 Qualcomm IPQ8064 Qualcomm IPQ8074 Qualcomm IPQ9574",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 8.6 ATTENTION:Low attack complexity Vendor:U-Boot Equipment:U-Boot Vulnerability:Improper Access Control for Volatile Memory Containing Boot Code",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in arbitrary code execution.",
      "vulnerability_overview": "N/AThe affected products are vulnerable to a bootloader vulnerability, which could allow an attacker to execute arbitrary code. CVE-2025-24857has been assigned to this vulnerability. A CVSS v3 base score of 8.4 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H). A CVSS v4 score has also been calculated forCVE-2025-24857. A base score of 8.6 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N).",
      "mitigations": "N/AKonsulko, the third-party maintainer of U-boot, recommends users upgrade toversion v2025.4 or laterand ensure the physical security of the device. Qualcomm recommends users with the affected chips tocontact supportreferencing CVE-2025-24857, QPSIIR-1969 or CR4082905. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    },
    {
      "title": "CISA Releases Three Industrial Control Systems Advisories",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/09/cisa-releases-three-industrial-control-systems-advisories",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "Festo",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "Multiple India-based CCTV Cameras",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-343-03",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/AThe following D-Link CCTV camera model is confirmed to be affected; specific affected models for Sparsh Securitech and Securus CCTV are unavailable: DCS-F5614-L1: Versions v1.03.038 and prior",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 9.3 ATTENTION:Exploitable remotely/Low attack complexity Vendor:D-Link (India Limited), Sparsh Securitech, Securus CCTV Equipment:DCS-F5614-L1 Vulnerability:Missing Authentication for Critical Function",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could result in information disclosure including capture of camera account credentials.",
      "vulnerability_overview": "N/AA malicious actor can access camera configuration information, including account credentials, without authenticating when accessing a vulnerable URL. CVE-2025-13607has been assigned to this vulnerability. A CVSS v3 base score of 9.4 has been calculated; the CVSS vector string is (AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L). A CVSS v4 score has also been calculated forCVE-2025-13607. A base score of 9.3 has been calculated; the CVSS vector string is (AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N).",
      "mitigations": "N/ASecurus CCTV and Sparsh Securitech did not respond to CISA's requests for coordination. Users of cameras from these vendors are encouraged to reach out to their respective customer service representatives to see if their specific model of camera is affected. Securus CCTV:sales@securuscctv.comor use the form athttps://www.securuscctv.com/contactus Sparsh Securitech:info@sparshsecuritech.comor use the form athttps://www.sparshsecuritech.com/contact-us D-Link has released a security advisory and a software update for the affected camera model. Please visit thisD-Link Security Announcementfor further information. D-Link strongly urges all users to install the relevant updates and regularly check for further updates. After downloading the software update, it is essential to ALWAYS validate its success by comparing the software version on your product interface to the software update version. The model number listed in this advisory is known only for D-Link India Limited. Users of cameras produced by the other listed vendors are encouraged to evaluate this vulnerability within their environment. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they arenot accessible from the Internet. Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time."
    },
    {
      "title": "Opportunistic Pro-Russia Hacktivists Attack US and Global Critical Infrastructure",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/09/opportunistic-pro-russia-hacktivists-attack-us-and-global-critical-infrastructure",
      "published": "Tue, 09 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/08/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "published": "Mon, 08 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/05/cisa-adds-one-known-exploited-vulnerability-catalog",
      "published": "Fri, 05 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "PRC State-Sponsored Actors Use BRICKSTORM Malware Across Public Sector and Information Technology Systems",
      "link": "https://www.cisa.gov/news-events/alerts/2025/12/04/prc-state-sponsored-actors-use-brickstorm-malware-across-public-sector-and-information-technology",
      "published": "Thu, 04 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/A"
    },
    {
      "title": "BRICKSTORM Backdoor",
      "link": "https://www.cisa.gov/news-events/analysis-reports/ar25-338a",
      "published": "Thu, 04 Dec 25 12:00:00 +0000",
      "vendor": "N/A",
      "affected_products": "N/A",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/A",
      "risk_evaluation": "N/A",
      "vulnerability_overview": "N/A",
      "mitigations": "N/ACISA, NSA, and Cyber Centre recommend organizations implement the mitigations below to improve organization cybersecurity posture based on the cyber actors’ activity. These mitigations align with the Cross-Sector Cybersecurity Performance Goals (CPGs) developed by CISA and the National Institute of Standards and Technology (NIST). The CPGs provide a minimum set of practices and protections that CISA and NIST recommend all organizations implement. CISA and NIST based the CPGs on existing cybersecurity frameworks and guidance to protect against the most common and impactful threats, tactics, techniques, and procedures. Visit CISA’sCPGs webpagefor more information on the CPGs, including additional recommended baseline protections. Upgrade VMware vSphere serversto the latest version [CPG 1.E]. Harden your VMware vSphere environmentsby applyingVMware’s guidance. For additional guidance on logging [CPG 2.T] and hardening, seeFrom Help Desk to Hypervisor: Defending Your VMware vSphere Estate from UNC3944. Take inventory of all network edge devices [CPG 1.A] and monitorfor any suspicious network connectivity originating from these devices. Ensure proper network segmentation restricts network traffic from the DMZ to the internal network [CPG 2.F]. Disable RDP and SMBfrom the DMZ to the internal network. Apply the principle of least privilege and restrict service accountsto only needed permissions. Increase monitoring for service accounts,which are highly privileged and have a predictable pattern of behavior (e.g., scans that reliably run at a certain hour of the day). Block unauthorized DoH providers and external DoH network trafficto reduce unmonitored communications."
    },
    {
      "title": "Mitsubishi Electric GX Works2",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-338-01",
      "published": "Thu, 04 Dec 25 12:00:00 +0000",
      "vendor": "Mitsubishi Electric",
      "affected_products": "N/AThe following versions of GX Works2 are affected: GX Works2: All versions",
      "release_date": "N/A",
      "cvss_v4": "N/A",
      "executive_summary": "N/ACVSS v4 6.8 ATTENTION: Low attack complexity Vendor: Mitsubishi Electric Equipment: GX Works2 Vulnerability: Cleartext Storage of Sensitive Information",
      "risk_evaluation": "N/ASuccessful exploitation of this vulnerability could open project files protected by user authentication using disclosed credential information, and obtain or modify project information.",
      "vulnerability_overview": "N/AAn attacker could disclose credential information stored in plaintext from project files. As a result, the attacker may be able to open project files protected by user authentication using disclosed credential information, and obtain or modify project information. CVE-2025-3784has been assigned to this vulnerability. A CVSS v3.1 base score of 5.5 has been calculated; the CVSS vector string is (AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N). A CVSS v4 score has also been calculated forCVE-2025-3784. A base score of 6.8 has been calculated; the CVSS vector string is (AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N).",
      "mitigations": "N/AThe fixed version for this vulnerability is currently under development by Mitsubishi Electric. Until the fixed version is released, please implement the following mitigations: Use the PCs with the affected product installed in the LAN and block remote logins from untrusted networks, hosts, or users. Block unauthorized access by using a firewall or a virtual private network (VPN), etc., and allow remote logins only for trusted users when connecting the PCs with the affected product installed to the Internet. Restrict physical access to the PCs with the affected product installed, as well as to PCs and network devices that can communicate with those PCs. Install an antivirus software on the PCs running the affected product. Encrypt project files when sending or receiving them over the Internet. SeeMitsubishi Electric's security bulletinfor information on the availability of the security updates. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section forcontrol systems security recommended practiceson the ICS webpage oncisa.gov/ics. Several CISA products detailing cyber defense best practices are available for reading and download, includingImproving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies. CISA encourages organizations to implement recommended cybersecurity strategies forproactive defense of ICS assets. Additional mitigation guidance and recommended practices are publicly available on the ICS webpage atcisa.gov/icsin the technical information paper,ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies. Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely."
    }
  ]
}